#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function LLHSDK.LLHSDKAppUtils.ShowSteamVirtualKeyboard
	 */
	struct ULLHSDKAppUtils_ShowSteamVirtualKeyboard_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.SDKConfigIsMultiDetect
	 */
	struct ULLHSDKAppUtils_SDKConfigIsMultiDetect_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.SDKConfigIsDebug
	 */
	struct ULLHSDKAppUtils_SDKConfigIsDebug_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKAppUtils.OnSteamUserStatesUpdate__DelegateSignature
	 */
	struct ULLHSDKAppUtils_OnSteamUserStatesUpdate__DelegateSignature_Params
	{
	public:
		class FString                                              SteamId;                                                 // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       IsFriend;                                                // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       Online;                                                  // 0x0011(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_68I8[0x6];                                   // 0x0012(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              FriendName;                                              // 0x0018(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.IsSteamFriendOnline
	 */
	struct ULLHSDKAppUtils_IsSteamFriendOnline_Params
	{
	public:
		class FString                                              SteamId;                                                 // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.IsSimulator
	 */
	struct ULLHSDKAppUtils_IsSimulator_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.IsPlatformSteamDeck
	 */
	struct ULLHSDKAppUtils_IsPlatformSteamDeck_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.IsPackageInstalled
	 */
	struct ULLHSDKAppUtils_IsPackageInstalled_Params
	{
	public:
		class FString                                              InPackageName;                                           // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.IsGrayRelease
	 */
	struct ULLHSDKAppUtils_IsGrayRelease_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.InviteSteamUserToGame
	 */
	struct ULLHSDKAppUtils_InviteSteamUserToGame_Params
	{
	public:
		class FString                                              SteamId;                                                 // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetVersionName
	 */
	struct ULLHSDKAppUtils_GetVersionName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetVersionCode
	 */
	struct ULLHSDKAppUtils_GetVersionCode_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetSteamFriendsOnlineList
	 */
	struct ULLHSDKAppUtils_GetSteamFriendsOnlineList_Params
	{
	public:
		TArray<bool>                                               ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetSteamFriendsNameList
	 */
	struct ULLHSDKAppUtils_GetSteamFriendsNameList_Params
	{
	public:
		TArray<class FString>                                      ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetSteamFriendName
	 */
	struct ULLHSDKAppUtils_GetSteamFriendName_Params
	{
	public:
		class FString                                              SteamId;                                                 // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReturnValue;                                             // 0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetSteamFriendIDList
	 */
	struct ULLHSDKAppUtils_GetSteamFriendIDList_Params
	{
	public:
		TArray<class FString>                                      ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetSteamFriendCount
	 */
	struct ULLHSDKAppUtils_GetSteamFriendCount_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetSDKVersionName
	 */
	struct ULLHSDKAppUtils_GetSDKVersionName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetSDKVersionCode
	 */
	struct ULLHSDKAppUtils_GetSDKVersionCode_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetRunningProcessName
	 */
	struct ULLHSDKAppUtils_GetRunningProcessName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetOperatingSystemId
	 */
	struct ULLHSDKAppUtils_GetOperatingSystemId_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetInstance
	 */
	struct ULLHSDKAppUtils_GetInstance_Params
	{
	public:
		class ULLHSDKAppUtils*                                     ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetGameTime
	 */
	struct ULLHSDKAppUtils_GetGameTime_Params
	{
	public:
		int64_t                                                    ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetGameID
	 */
	struct ULLHSDKAppUtils_GetGameID_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetEnvId
	 */
	struct ULLHSDKAppUtils_GetEnvId_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetDeviceUUID
	 */
	struct ULLHSDKAppUtils_GetDeviceUUID_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetChannelID
	 */
	struct ULLHSDKAppUtils_GetChannelID_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetBiosUUID
	 */
	struct ULLHSDKAppUtils_GetBiosUUID_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetAppName
	 */
	struct ULLHSDKAppUtils_GetAppName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetAppIDRaw
	 */
	struct ULLHSDKAppUtils_GetAppIDRaw_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.GetAppID
	 */
	struct ULLHSDKAppUtils_GetAppID_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.DoesDistributeForDomestic
	 */
	struct ULLHSDKAppUtils_DoesDistributeForDomestic_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.DismissSteamVirtualKeyboard
	 */
	struct ULLHSDKAppUtils_DismissSteamVirtualKeyboard_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.DestoryInstance
	 */
	struct ULLHSDKAppUtils_DestoryInstance_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKAppUtils.BindOnlineSubsystemSteamPresence
	 */
	struct ULLHSDKAppUtils_BindOnlineSubsystemSteamPresence_Params
	{	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKCommunity.OnInitCommunity__DelegateSignature
	 */
	struct ULLHSDKCommunity_OnInitCommunity__DelegateSignature_Params
	{
	public:
		class FString                                              ResultStr;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKCommunity.OnImageDownload__DelegateSignature
	 */
	struct ULLHSDKCommunity_OnImageDownload__DelegateSignature_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKCommunity.OnGetCommunityRedhint__DelegateSignature
	 */
	struct ULLHSDKCommunity_OnGetCommunityRedhint__DelegateSignature_Params
	{
	public:
		class FString                                              ResultStr;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKCommunity.OnExitCommunity__DelegateSignature
	 */
	struct ULLHSDKCommunity_OnExitCommunity__DelegateSignature_Params
	{
	public:
		class FString                                              ResultStr;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKCommunity.OnClearCommunityRedhint__DelegateSignature
	 */
	struct ULLHSDKCommunity_OnClearCommunityRedhint__DelegateSignature_Params
	{
	public:
		class FString                                              ResultStr;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKCommunity.InitCommunityConfig
	 */
	struct ULLHSDKCommunity_InitCommunityConfig_Params
	{
	public:
		class FString                                              UrlInfo;                                                 // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReqMethod;                                               // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ExtraHttpParams;                                         // 0x0020(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKCommunity.GetInstance
	 */
	struct ULLHSDKCommunity_GetInstance_Params
	{
	public:
		class ULLHSDKCommunity*                                    ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKCommunity.GetCommunityRedHint
	 */
	struct ULLHSDKCommunity_GetCommunityRedHint_Params
	{
	public:
		class FString                                              URL;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReqMethod;                                               // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ExtraHttpParams;                                         // 0x0020(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKCommunity.ExitCommunity
	 */
	struct ULLHSDKCommunity_ExitCommunity_Params
	{
	public:
		class FString                                              URL;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReqMethod;                                               // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ExtraHttpParams;                                         // 0x0020(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKCommunity.DownloadImage
	 */
	struct ULLHSDKCommunity_DownloadImage_Params
	{
	public:
		class FString                                              URL;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              FilePath;                                                // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKCommunity.DestoryInstance
	 */
	struct ULLHSDKCommunity_DestoryInstance_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKCommunity.ClearCommunityRedHint
	 */
	struct ULLHSDKCommunity_ClearCommunityRedHint_Params
	{
	public:
		class FString                                              URL;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReqMethod;                                               // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ExtraHttpParams;                                         // 0x0020(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKCustomerService.ShowCustomerServicePage
	 */
	struct ULLHSDKCustomerService_ShowCustomerServicePage_Params
	{
	public:
		class FString                                              ExtInfoStr;                                              // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKCustomerService.SetCustomerServiceDebug
	 */
	struct ULLHSDKCustomerService_SetCustomerServiceDebug_Params
	{
	public:
		bool                                                       bIsPspDebug;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_Q67B[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              PlayerId;                                                // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int64_t                                                    ServerId;                                                // 0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKCustomerService.OnReceiveNotification__DelegateSignature
	 */
	struct ULLHSDKCustomerService_OnReceiveNotification__DelegateSignature_Params
	{
	public:
		int32_t                                                    NotificationType;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKCustomerService.GetInstance
	 */
	struct ULLHSDKCustomerService_GetInstance_Params
	{
	public:
		class ULLHSDKCustomerService*                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKCustomerService.DestoryInstance
	 */
	struct ULLHSDKCustomerService_DestoryInstance_Params
	{	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKDeviceUtils.OnGoogleAdID__DelegateSignature
	 */
	struct ULLHSDKDeviceUtils_OnGoogleAdID__DelegateSignature_Params
	{
	public:
		class FString                                              GoogleAdID;                                              // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKDeviceUtils.OnDeviceScore__DelegateSignature
	 */
	struct ULLHSDKDeviceUtils_OnDeviceScore__DelegateSignature_Params
	{
	public:
		int32_t                                                    DeviceScore;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.IsEmulator
	 */
	struct ULLHSDKDeviceUtils_IsEmulator_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetTotalRAM
	 */
	struct ULLHSDKDeviceUtils_GetTotalRAM_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetTotalMemorySize
	 */
	struct ULLHSDKDeviceUtils_GetTotalMemorySize_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetTimezoneName
	 */
	struct ULLHSDKDeviceUtils_GetTimezoneName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetOSVersion
	 */
	struct ULLHSDKDeviceUtils_GetOSVersion_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetNetworkTypeEnum
	 */
	struct ULLHSDKDeviceUtils_GetNetworkTypeEnum_Params
	{
	public:
		ELLHSDKNetworkType                                         ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetNetworkType
	 */
	struct ULLHSDKDeviceUtils_GetNetworkType_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetMacAddress
	 */
	struct ULLHSDKDeviceUtils_GetMacAddress_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetInstance
	 */
	struct ULLHSDKDeviceUtils_GetInstance_Params
	{
	public:
		class ULLHSDKDeviceUtils*                                  ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetIMSI
	 */
	struct ULLHSDKDeviceUtils_GetIMSI_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetIDFA
	 */
	struct ULLHSDKDeviceUtils_GetIDFA_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetGoogleAdID
	 */
	struct ULLHSDKDeviceUtils_GetGoogleAdID_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetDisplayMetrics
	 */
	struct ULLHSDKDeviceUtils_GetDisplayMetrics_Params
	{
	public:
		TArray<float>                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetDisplayCutout
	 */
	struct ULLHSDKDeviceUtils_GetDisplayCutout_Params
	{
	public:
		TArray<float>                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetDeviceType
	 */
	struct ULLHSDKDeviceUtils_GetDeviceType_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetDeviceScore
	 */
	struct ULLHSDKDeviceUtils_GetDeviceScore_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetDeviceModel
	 */
	struct ULLHSDKDeviceUtils_GetDeviceModel_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetDeviceID
	 */
	struct ULLHSDKDeviceUtils_GetDeviceID_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetDeviceCarrier
	 */
	struct ULLHSDKDeviceUtils_GetDeviceCarrier_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetDeviceBrand
	 */
	struct ULLHSDKDeviceUtils_GetDeviceBrand_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetDeviceAbi
	 */
	struct ULLHSDKDeviceUtils_GetDeviceAbi_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetCPUModel
	 */
	struct ULLHSDKDeviceUtils_GetCPUModel_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetCPUHardWareName
	 */
	struct ULLHSDKDeviceUtils_GetCPUHardWareName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetAvailableRAM
	 */
	struct ULLHSDKDeviceUtils_GetAvailableRAM_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.GetAndroidID
	 */
	struct ULLHSDKDeviceUtils_GetAndroidID_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKDeviceUtils.DestoryInstance
	 */
	struct ULLHSDKDeviceUtils_DestoryInstance_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKLocalization.SetLocaleName
	 */
	struct ULLHSDKLocalization_SetLocaleName_Params
	{
	public:
		class FString                                              InLocale;                                                // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLocalization.SetLocale
	 */
	struct ULLHSDKLocalization_SetLocale_Params
	{
	public:
		ELLHSDKSupportedLanguage                                   InLocale;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLocalization.GetLocaleName
	 */
	struct ULLHSDKLocalization_GetLocaleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLocalization.GetLocaleInfo
	 */
	struct ULLHSDKLocalization_GetLocaleInfo_Params
	{
	public:
		struct FLLHSDKLocaleInfo                                   ReturnValue;                                             // 0x0000(0x0020)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLocalization.GetLocaleEnum
	 */
	struct ULLHSDKLocalization_GetLocaleEnum_Params
	{
	public:
		ELLHSDKSupportedLanguage                                   ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLocalization.GetInstance
	 */
	struct ULLHSDKLocalization_GetInstance_Params
	{
	public:
		class ULLHSDKLocalization*                                 ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLocalization.DestoryInstance
	 */
	struct ULLHSDKLocalization_DestoryInstance_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKLogin.UpdateSteamCallBack
	 */
	struct ULLHSDKLogin_UpdateSteamCallBack_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKLogin.SwitchOrLinkAccount
	 */
	struct ULLHSDKLogin_SwitchOrLinkAccount_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKLogin.SteamRegister
	 */
	struct ULLHSDKLogin_SteamRegister_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.SteamLoginResultSet
	 */
	struct ULLHSDKLogin_SteamLoginResultSet_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.SteamGetAccountInfo
	 */
	struct ULLHSDKLogin_SteamGetAccountInfo_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.SteamFree
	 */
	struct ULLHSDKLogin_SteamFree_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKLogin.SteamBindUrlGet
	 */
	struct ULLHSDKLogin_SteamBindUrlGet_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.SteamAutoLogin
	 */
	struct ULLHSDKLogin_SteamAutoLogin_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.ShowProtocolViewV2Ok
	 */
	struct ULLHSDKLogin_ShowProtocolViewV2Ok_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKLogin.ShowProtocolViewV2Confirm
	 */
	struct ULLHSDKLogin_ShowProtocolViewV2Confirm_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKLogin.SetLimPCSDKLogHandler
	 */
	struct ULLHSDKLogin_SetLimPCSDKLogHandler_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.SetLimPCSDKEventHandler
	 */
	struct ULLHSDKLogin_SetLimPCSDKEventHandler_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.SetLimPCAlilogFieldsData
	 */
	struct ULLHSDKLogin_SetLimPCAlilogFieldsData_Params
	{
	public:
		class FString                                              LimPCAlilogFieldsStr;                                    // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.QueryCurrentUserInfo
	 */
	struct ULLHSDKLogin_QueryCurrentUserInfo_Params
	{
	public:
		struct FLLHSDKLoginUserInfo                                ReturnValue;                                             // 0x0000(0x0140)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.QueryCurrentUser
	 */
	struct ULLHSDKLogin_QueryCurrentUser_Params
	{
	public:
		struct FLLHSDKLoginUser                                    ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.OpenSteamBindPage
	 */
	struct ULLHSDKLogin_OpenSteamBindPage_Params
	{
	public:
		class FString                                              URL;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.OpenLIMPCSwitchAccPage
	 */
	struct ULLHSDKLogin_OpenLIMPCSwitchAccPage_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.OpenLIMPCAccountPage
	 */
	struct ULLHSDKLogin_OpenLIMPCAccountPage_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKLogin.OnProtocolClick__DelegateSignature
	 */
	struct ULLHSDKLogin_OnProtocolClick__DelegateSignature_Params
	{
	public:
		bool                                                       bConfirmed;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKLogin.OnLoginFinish__DelegateSignature
	 */
	struct ULLHSDKLogin_OnLoginFinish__DelegateSignature_Params
	{
	public:
		class FString                                              AppUid;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              AppToken;                                                // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ELLHSDKLoginType                                           LoginType;                                               // 0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKLogin.OnLoginFailed__DelegateSignature
	 */
	struct ULLHSDKLogin_OnLoginFailed__DelegateSignature_Params
	{
	public:
		ELLHSDKLoginType                                           LoginType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_5U2V[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ErrorCode;                                               // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKLogin.OnInitFinish__DelegateSignature
	 */
	struct ULLHSDKLogin_OnInitFinish__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKLogin.OnBindFinish__DelegateSignature
	 */
	struct ULLHSDKLogin_OnBindFinish__DelegateSignature_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_B3MS[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              AppUid;                                                  // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              AppToken;                                                // 0x0018(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ELLHSDKLoginType                                           LoginType;                                               // 0x0028(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.NSLogout
	 */
	struct ULLHSDKLogin_NSLogout_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKLogin.NSLoginStart
	 */
	struct ULLHSDKLogin_NSLoginStart_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.NSFinalize
	 */
	struct ULLHSDKLogin_NSFinalize_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKLogin.NSAccountInfoGet
	 */
	struct ULLHSDKLogin_NSAccountInfoGet_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.LogoutLimPCSDK
	 */
	struct ULLHSDKLogin_LogoutLimPCSDK_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.Logout
	 */
	struct ULLHSDKLogin_Logout_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKLogin.LoginUserInfo_ToString
	 */
	struct ULLHSDKLogin_LoginUserInfo_ToString_Params
	{
	public:
		struct FLLHSDKLoginUserInfo                                InUserInfo;                                              // 0x0000(0x0140)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FString                                              ReturnValue;                                             // 0x0140(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.LoginUser_ToString
	 */
	struct ULLHSDKLogin_LoginUser_ToString_Params
	{
	public:
		struct FLLHSDKLoginUser                                    InUser;                                                  // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FString                                              ReturnValue;                                             // 0x0048(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.LoginLimPCSDK
	 */
	struct ULLHSDKLogin_LoginLimPCSDK_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.Login
	 */
	struct ULLHSDKLogin_Login_Params
	{	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKLogin.LimSteamSDKCallBack__DelegateSignature
	 */
	struct ULLHSDKLogin_LimSteamSDKCallBack__DelegateSignature_Params
	{
	public:
		class FString                                              Datas;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKLogin.LimPCSDKCallBack__DelegateSignature
	 */
	struct ULLHSDKLogin_LimPCSDKCallBack__DelegateSignature_Params
	{
	public:
		class FString                                              Datas;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction LLHSDK.LLHSDKLogin.LimOnSteamLoginResultSet__DelegateSignature
	 */
	struct ULLHSDKLogin_LimOnSteamLoginResultSet__DelegateSignature_Params
	{
	public:
		class FString                                              AppUid;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              AppToken;                                                // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              AppId;                                                   // 0x0020(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.IsInitFinish
	 */
	struct ULLHSDKLogin_IsInitFinish_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.IsCurrentUserNewReg
	 */
	struct ULLHSDKLogin_IsCurrentUserNewReg_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.InitNSSDK
	 */
	struct ULLHSDKLogin_InitNSSDK_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.InitLimSteamSDK
	 */
	struct ULLHSDKLogin_InitLimSteamSDK_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.InitLimPCSDK
	 */
	struct ULLHSDKLogin_InitLimPCSDK_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.GetSteamToken
	 */
	struct ULLHSDKLogin_GetSteamToken_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.GetSteamRegisterUrl
	 */
	struct ULLHSDKLogin_GetSteamRegisterUrl_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.GetLimPCUserInfo
	 */
	struct ULLHSDKLogin_GetLimPCUserInfo_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.GetLimPCAlilogFieldsData
	 */
	struct ULLHSDKLogin_GetLimPCAlilogFieldsData_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.GetLimPCAlilogFields
	 */
	struct ULLHSDKLogin_GetLimPCAlilogFields_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.GetInstance
	 */
	struct ULLHSDKLogin_GetInstance_Params
	{
	public:
		class ULLHSDKLogin*                                        ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.FreeLimPCSDK
	 */
	struct ULLHSDKLogin_FreeLimPCSDK_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKLogin.DoSteamBind
	 */
	struct ULLHSDKLogin_DoSteamBind_Params
	{
	public:
		class FString                                              URL;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.DestoryInstance
	 */
	struct ULLHSDKLogin_DestoryInstance_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKLogin.DAPLogAdd
	 */
	struct ULLHSDKLogin_DAPLogAdd_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.CommonReportLimPCPoint
	 */
	struct ULLHSDKLogin_CommonReportLimPCPoint_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.ClearAutoLogin
	 */
	struct ULLHSDKLogin_ClearAutoLogin_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.ChangeLIMPCLanguage
	 */
	struct ULLHSDKLogin_ChangeLIMPCLanguage_Params
	{
	public:
		class FString                                              Params;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.CanContinueLogin
	 */
	struct ULLHSDKLogin_CanContinueLogin_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKLogin.CancelSteamCallBack
	 */
	struct ULLHSDKLogin_CancelSteamCallBack_Params
	{	};

	/**
	 * Function LLHSDK.LLHSDKMisc.UpdateNetworkExtensions
	 */
	struct ULLHSDKMisc_UpdateNetworkExtensions_Params
	{
	public:
		class FString                                              InUserId;                                                // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              InDeviceID;                                              // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKMisc.TwitterShareText
	 */
	struct ULLHSDKMisc_TwitterShareText_Params
	{
	public:
		class FString                                              InText;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function LLHSDK.LLHSDKMisc.TwitterSharePhoto
	 */
	struct ULLHSDKMisc_TwitterSharePhoto_Params
	{
	public:
		class FString                                              InText;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
