#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x710 (0x9E0 - 0x2D0)
// DynamicClass R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C
class UR_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C : public UWeaponAnimInstance
{
public:
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x2D0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x300(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x328(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x350(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x378(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x3A0(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x3C8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x3F0(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x418(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x440(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x468(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x490(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x4B8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x4E0(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x508(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x530(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x558(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x580(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x5A8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x5D0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x600(0x78)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x678(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x6A8(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x6D8(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x708(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x738(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x768(0x78)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x7E0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x810(0x78)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x888(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x8B8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x8E0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x910(0xB0)(NativeAccessSpecifierPublic)
	struct FAnimMsgData                          K2Node_MakeStruct_AnimMsgData;                     // 0x9C0(0x8)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FAnimMsgData>                  K2Node_MakeArray_Array;                            // 0x9C8(0x10)(ZeroConstructor, Transient, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2581[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UR_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C* GetDefaultObj();

	void TestAPI();
	void InterruptAnim();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F24ACCD04F9816FE9D766B945C515A17();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_EE537D0E40457B0C18FCAEBC0C3ED399();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_E0229C914BA4E5771C33CCBDC40559C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_D066E4F445D8B9D17E881E99F7DDFDFC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_BC0CF4F64A6C98918E7513B5D9394953();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_B4B62B9D47B0C1161E6CE19216D27AEA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_AABE1C004ECF87A2034CCA88B05CDD38();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A863A2F74187E8118A2F6D8E60300523();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_84EB688D49FE8D60181894BF737AC498();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_7B529D21433A869664E2179B4C613BA5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_77EDB4C1425DF2DF774DAEB1479B3048();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_6CEE3A2D414CEB6E9949B3AE8B35E54E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_68B6675247DA823995BD8A8473A86377();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_50AE56FC480E668DE2BAE78A71FF5789();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_47B480004460910C1D11029F8F7F5163();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_37A891C448B1ADADFF382886CBBA43FF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_13B1B2364014E8EE709B10992D43ECBF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0011171C434B57CADB4A22B6D1C6DEF5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_FD9E62FB4BF9F8E65B55ABB0CCD5B28C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_E4E641294B19BA48572E4BAAE5E32FA9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_7208B17C4942AAB3573456B9468769AA();
	void AnimNotify_QuitIdle();
	void AnimNotify_QuitFire();
	void AnimNotify_EnterIdle();
	void AnimNotify_EnterFire();
	void AnimGraph(struct FPoseLink* bpp__AnimGraph__pf);
};

}


