#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x710 (0x9E0 - 0x2D0)
// DynamicClass R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C
class UR_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C : public UWeaponAnimInstance
{
public:
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x2D0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x300(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x328(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x350(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x378(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x3A0(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x3C8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x3F0(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x418(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x440(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x468(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x490(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x4B8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x4E0(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x508(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x530(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x558(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x580(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x5A8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x5D0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x600(0x78)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x678(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x6A8(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x6D8(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x708(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x738(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x768(0x78)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x7E0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x810(0x78)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x888(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x8B8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x8E0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x910(0xB0)(NativeAccessSpecifierPublic)
	struct FAnimMsgData                          K2Node_MakeStruct_AnimMsgData;                     // 0x9C0(0x8)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FAnimMsgData>                  K2Node_MakeArray_Array;                            // 0x9C8(0x10)(ZeroConstructor, Transient, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_236A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UR_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C* GetDefaultObj();

	void TestAPI();
	void InterruptAnim();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F1D9DDBB413911FB9DAB608900412973();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_ED21629F443C13EB618022956A31D19A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_DF0EDC2A4C9FD52DDBFB5AB16F296F1F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C03C50F94DB6AE0D2D3E5C9ED0973F8F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_AAD002E1429649E2A71240AC589B09B4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_AA031CB74743982BEE3C5797368DAA52();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A5160CCA42B37A4C3B4188B28169B213();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A2FAECDE4FDF2B0F0058E592F914226B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_94B2047B4C3C85D5F4207DBB55087639();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_75627B5046C82AA9436B29B4F5249E44();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_57810D744E7C3FBDD015CAA7F41F4FC9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3B7C19954B39C84A940DAAA2F33497FF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3894EEFF4AF65DB06E1EF6B3E50D61C8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_22B64B724989FED60A22A891E13B0124();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_157669F74CFD34995FC79C884849B3AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_12DD48B84B001C059F7A2AB37F97FCFB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0C1E6158487EAC02C7B875B4515A137E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_096C1B414C4EC717A873538B7A500073();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_B88F52044BA7D36ADD40709403A148A7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_9521C87845A62B5E05A2FC98EEAE4394();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_6E0892AF47D14DE4DBFCD6A9DD05BF1F();
	void AnimNotify_QuitIdle();
	void AnimNotify_QuitFire();
	void AnimNotify_EnterIdle();
	void AnimNotify_EnterFire();
	void AnimGraph(struct FPoseLink* bpp__AnimGraph__pf);
};

}


