#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x710 (0x9E0 - 0x2D0)
// DynamicClass R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C
class UR_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C : public UWeaponAnimInstance
{
public:
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x2D0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x300(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x328(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x350(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x378(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x3A0(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x3C8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x3F0(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x418(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x440(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x468(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x490(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x4B8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x4E0(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x508(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x530(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x558(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x580(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x5A8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x5D0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x600(0x78)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x678(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x6A8(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x6D8(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x708(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x738(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x768(0x78)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x7E0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x810(0x78)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x888(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x8B8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x8E0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x910(0xB0)(NativeAccessSpecifierPublic)
	struct FAnimMsgData                          K2Node_MakeStruct_AnimMsgData;                     // 0x9C0(0x8)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FAnimMsgData>                  K2Node_MakeArray_Array;                            // 0x9C8(0x10)(ZeroConstructor, Transient, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2378[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UR_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C* GetDefaultObj();

	void TestAPI();
	void InterruptAnim();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F864A8404805F7EACEFC909E832043EE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_EF1003244660F4F16818ACB549FE30A2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C9FED2714733C7A7136C3B853D25E8AF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C75E784B46BBB88DCA0310ACB0D26B5C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_B0F67D2C42C3309858AB33AC10288A84();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A9D4CFA64B088023BC866EB7258D24DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A09B0CDA42727AF610670C94DE73F3FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_6DD2D4034F92A9BD828C65B8BFBA2293();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_648093B0430A4941FAABC299AD2FE963();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_52925DBD4E136234F3ECC881874BD63D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_5253111046BC8B08009AD3A86A2A6A92();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_4891E8A74C85C9FAA5F481BF49F3C328();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3F59DA0B453648FCA8849BB4F06C4CAD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3648865447AFE466BAF6F1AA55855DBA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_2B2B494947D256B2462E0C8D47029D4D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1A41016A4CC12032E6B0F3B5B6DDF69A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1210DDEB4E4988C12C9E2E8BBF476289();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_06660E20471885C3FDEA209298977A13();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_B900DE27498B8EBDD9C81293F7BB1ED6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_AEDD1FCA452DB89BD307AAA8B18B310C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_611D453D494879EE90A0FE84805C41A1();
	void AnimNotify_QuitIdle();
	void AnimNotify_QuitFire();
	void AnimNotify_EnterIdle();
	void AnimNotify_EnterFire();
	void AnimGraph(struct FPoseLink* bpp__AnimGraph__pf);
};

}


