#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x710 (0x9E0 - 0x2D0)
// DynamicClass R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint.R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_C
class UR_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_C : public UWeaponAnimInstance
{
public:
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x2D0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x300(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x328(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x350(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x378(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x3A0(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x3C8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x3F0(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x418(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x440(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x468(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x490(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x4B8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x4E0(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x508(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x530(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x558(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x580(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x5A8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x5D0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x600(0x78)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x678(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x6A8(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x6D8(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x708(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x738(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x768(0x78)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x7E0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x810(0x78)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x888(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x8B8(0x28)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x8E0(0x30)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x910(0xB0)(NativeAccessSpecifierPublic)
	struct FAnimMsgData                          K2Node_MakeStruct_AnimMsgData;                     // 0x9C0(0x8)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FAnimMsgData>                  K2Node_MakeArray_Array;                            // 0x9C8(0x10)(ZeroConstructor, Transient, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2491[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UR_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_C* GetDefaultObj();

	void TestAPI();
	void InterruptAnim();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_FC0194B2401EA22381DBF39C55947FF9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_E401BBA149B0DABC77E320A5D26F161C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C959CBB24B6E3FBB125D5386BA83BA89();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_968E57334D0560E0D81E8F8CBF255866();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_90C97F4B4CBC8816A38216BE138E6F89();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_902489064567DB8F1C7F35A412FC55BD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_8E281982451991810FB1CDBE5C7AB333();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_75414DB244FBB7A53F3CE18A9FB7157B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_73C2053F48EBA57AE80C7EB511A1ED8A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_666390444F55176B8452A3ADD88C04EC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_57FE46434F01218D85EC4697425396E0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_57691DF54B9855E9DD506B9FCCB61EA7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_4ADDE6E04C5F8810E1EEA58820D214AE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_43F44591410E60EB2C5CD2B43DEB8E8E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_2C342F604862980A804FF2996F90C087();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_28F31C444D5EA218BB1A38AACC8722F3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_20E8B10A4E9FF7BA091039BFD5B13AD8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_056EEB8B459D1AC625DFDB8AC5C35452();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_9CEFF7884F12CE6C82E80A8548619832();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_696B215C4C93CC06D553F2B7970E6146();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_Mphy01_Set001_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_0D0A1C5849872911C76BD99ABCFFA34E();
	void AnimNotify_QuitIdle();
	void AnimNotify_QuitFire();
	void AnimNotify_EnterIdle();
	void AnimNotify_EnterFire();
	void AnimGraph(struct FPoseLink* bpp__AnimGraph__pf);
};

}


