#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum Solarland.EBoolean
	 */
	enum class EBoolean : uint8_t
	{
		BranchFalse = 0,
		BranchTrue = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EActorRegisterType
	 */
	enum class EActorRegisterType : uint8_t
	{
		EART_None = 0,
		EART_Character = 1,
		EART_Vehicle = 2,
		EART_Turret = 3,
		EART_TreasureBox = 4,
		EART_ChargingPile = 5,
		EART_Summon = 6,
		EART_HumanoidTarget = 7,
		EART_Water = 8,
		EART_MAX = 9
	};

	/**
	 * Enum Solarland.ESolarNetMode
	 */
	enum class ESolarNetMode : uint8_t
	{
		NM_Standalone = 0,
		NM_DedicatedServer = 1,
		NM_ListenServer = 2,
		NM_Client = 3,
		NM_MAX = 4,
		NM_Unknown = 5
	};

	/**
	 * Enum Solarland.ESolarPlayStage
	 */
	enum class ESolarPlayStage : uint8_t
	{
		None = 0,
		Login = 1,
		Lobby = 2,
		Battle = 3,
		Settlement = 4,
		PlaceHolder1 = 5,
		PlaceHolder2 = 6,
		PlaceHolder3 = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.ERoleSkillOperation
	 */
	enum class ERoleSkillOperation : uint8_t
	{
		None = 0,
		ToNormal = 1,
		ClearCD = 2,
		ResetCD = 3,
		Forbid = 4,
		Unforbid = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ECustomParamType
	 */
	enum class ECustomParamType : uint8_t
	{
		WeaponDamageScale = 0,
		SkillDamageScale = 1,
		HeadShootDamageScale = 2,
		VehicleDamageScale = 3,
		MoveSpeedScale = 4,
		ShieldScale = 5,
		HealthScale = 6,
		Resurgence = 7,
		GravityScale = 8,
		None = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.EBattleEndType
	 */
	enum class EBattleEndType : uint8_t
	{
		None = 0,
		BattleOver = 1,
		PlayerNotEnough = 2,
		BeginTimeOut = 3,
		Abandoned = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESCTournamentType
	 */
	enum class ESCTournamentType : uint8_t
	{
		None = 0,
		SingleRace = 1,
		PointRace = 2,
		KnockoutRace = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESCRoomType
	 */
	enum class ESCRoomType : uint8_t
	{
		None = 0,
		Normal = 1,
		Tournament = 2,
		CustomServer = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESCMInGameState
	 */
	enum class ESCMInGameState : uint8_t
	{
		None = 0,
		InPrepare = 1,
		InBattle = 2,
		InBattleEnd = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESCMHostType
	 */
	enum class ESCMHostType : uint8_t
	{
		Global = 0,
		Side = 1,
		Player = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESCMDataRankType
	 */
	enum class ESCMDataRankType : uint8_t
	{
		None = 0,
		Ascending = 1,
		AscendingReplace = 2,
		Descending = 3,
		DescendingReplace = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESCMDataChangeType
	 */
	enum class ESCMDataChangeType : uint8_t
	{
		Add = 0,
		Change = 1,
		Delete = 2,
		DeleteAll = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EStatisticsType
	 */
	enum class EStatisticsType : uint8_t
	{
		None = 0,
		DSTime = 1,
		G_UnBattleEndPlayerCount = 2,
		G_UnBattleEndTeamCount = 3,
		S_KillCount = 4,
		S_KillDownCount = 5,
		S_AssistCount = 6,
		S_DeathCount = 7,
		S_SaveCount = 8,
		S_UnBattleEndPlayerCount = 9,
		G_KillNum = 10,
		G_KillDown = 11,
		KillNum = 12,
		KillNumToRealPlayer = 13,
		P_KillStreak = 14,
		KillStreakHistory = 15,
		CharacterKillNumWithID = 16,
		KillDownNum = 17,
		AssistNum = 18,
		KillNpcNum = 19,
		KillMonster = 20,
		KillPlayer = 21,
		KillTeammate = 22,
		KillDownTeammate = 23,
		TotalWeaponKillNum = 24,
		WeaponAssistWithID = 25,
		WeaponKillNumWithID = 26,
		KillNumWithIDByVechile = 27,
		TotalVehicleKillNum = 28,
		RevengeNum = 29,
		AccurateKillTimes = 30,
		AccurateKillDownTimes = 31,
		WeaponSkillKillNum = 32,
		PunchKill = 33,
		AreaKillNum_Bubble = 34,
		DeathNum = 35,
		DyingCount = 36,
		DyingByNpc = 37,
		DyingByMonster = 38,
		DeathByVechile = 39,
		DeathByBombingArea = 40,
		CauseDamage = 41,
		CauseDamageToRealPlayer = 42,
		WeaponDamageWithIDToPlayer = 43,
		WeaponDamageWithTypeToPlayer = 44,
		VechileDamageWithIDToPlayer = 45,
		TotalVehicleDamage = 46,
		ReceivedDamage = 47,
		DamageByAI = 48,
		DamageByMonster = 49,
		DamageToMonster = 50,
		DamageToNpc = 51,
		AccurateDamage = 52,
		AttackTimes = 53,
		HitTimes = 54,
		HitedTimes = 55,
		AccurateDameageTimes = 56,
		BeAccurateDameageTimes = 57,
		LifeTime = 58,
		HealSelf = 59,
		SaveCount = 60,
		TeammateHeal = 61,
		ReceivedHeal = 62,
		ResurrectionCount = 63,
		CarSkillCount = 64,
		VechileDistance = 65,
		TotalVechileDistance = 66,
		VehicleTime = 67,
		UseVehicleTypes = 68,
		LastUseVehicleID = 69,
		TakeTheCarOfEnemy = 70,
		DriveCarInAirTime = 71,
		DriveHoverCarInWaterDistance = 72,
		WeaponID1 = 73,
		WeaponID2 = 74,
		WeaponLevel1 = 75,
		WeaponLevel2 = 76,
		UseWeaponSkillNum = 77,
		WeaponUseStartTimeWithID = 78,
		WeaponUseTimeWithID = 79,
		MaxGodWeaponNum = 80,
		CollectEnergy = 81,
		EscapeTimes = 82,
		CollectBoxNum = 83,
		CollectBoxNumWithHighQuality = 84,
		FlyCount = 85,
		ArmorUseCount = 86,
		ShieldRechargeCount = 87,
		EChestOpenNumForID = 88,
		DeathPos = 89,
		LandingPos = 90,
		LandingTime = 91,
		DropoutEvent = 92,
		DropoutTime = 93,
		MedicineUseCount = 94,
		RadarUseCount = 95,
		P_BattleResult = 96,
		OpenAirBoxNum = 97,
		KillInAirNum = 98,
		KillDownInAirNum = 99,
		ResurrectionNum = 100,
		ResurrectionCapsule = 101,
		TeamFriendRevive = 102,
		BuyESElectricNum = 103,
		CarFireCount = 104,
		HangTimeDuration = 105,
		SkydiveLandingDuration = 106,
		SwimDistance = 107,
		DanceCount = 108,
		PosionWalkDistance = 109,
		ShieldExpGainCount = 110,
		UpgradeShieldCount = 111,
		UpgradeRedShieldCount = 112,
		JumpBoardUseCount = 113,
		TerminaterCount = 114,
		UltimateSkillUseCount = 115,
		TacticalSkillUseCount = 116,
		UltimateSkillDamage = 117,
		TacticalSkillDamage = 118,
		UltimateSkillTakenDamage = 119,
		TacticalSkillTakenDamage = 120,
		UltimateSkillKillNum = 121,
		TacticalSkillKillNum = 122,
		HasHighlight = 123,
		WeaponID3 = 124,
		BackpackItems = 125,
		CurrentWeaponID = 126,
		MAX = 127
	};

	/**
	 * Enum Solarland.ERecordingType
	 */
	enum class ERecordingType : uint8_t
	{
		None = 0,
		Local = 1,
		NormalMatch = 2,
		Tournament = 3,
		LiveWatchOnly = 4,
		LocalHighlight = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EReplayManagerState
	 */
	enum class EReplayManagerState : uint8_t
	{
		Initializing = 0,
		Idle = 1,
		Recording = 2,
		PlayingTryToStart = 3,
		PlayingStarted = 4,
		PlayingLoadLevelsStarted = 5,
		PlayingLevelLoaded = 6,
		PlayingStreamReadied = 7,
		PlayingFirstScrubing = 8,
		Playing = 9,
		PlayingAtEnd = 10,
		MAX = 11
	};

	/**
	 * Enum Solarland.EReplayPlayingFinishReason
	 */
	enum class EReplayPlayingFinishReason : uint8_t
	{
		Normal = 0,
		GMForce = 1,
		StreamerDownloadChunkTimeout = 2,
		StreamerServiceUnavailable = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EMultiplePassMaterialChangeCompatibilityMode
	 */
	enum class EMultiplePassMaterialChangeCompatibilityMode : uint8_t
	{
		Compatible = 0,
		Incompatible = 1,
		CompatibleWithSpecifiedPriorityTags = 2,
		IncompatibleWithSpecifiedPriorityTags = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EMaterialChangeConflictResolveStrategy
	 */
	enum class EMaterialChangeConflictResolveStrategy : uint8_t
	{
		KeepAll = 0,
		KeepNew = 1,
		KeepOld = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWalkMode
	 */
	enum class EWalkMode : uint8_t
	{
		Idle = 0,
		Run = 1,
		Sprint = 2,
		CrouchIdle = 3,
		CrouchRun = 4,
		CrouchSprint = 5,
		Crawl = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EAirMoveMode
	 */
	enum class EAirMoveMode : uint8_t
	{
		None = 0,
		Jump = 1,
		JetFly = 2,
		Cruise = 3,
		Skydive = 4,
		Launch = 5,
		Fall = 6,
		Fly = 7,
		WallRun = 8,
		SkywardFly = 9,
		ZipLine = 10,
		MAX = 11
	};

	/**
	 * Enum Solarland.EClientMoveTrustType
	 */
	enum class EClientMoveTrustType : uint8_t
	{
		TrustLocation = 0,
		TrustLocationAndMovementMode = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EItemModifyResult
	 */
	enum class EItemModifyResult : uint8_t
	{
		Succeed = 0,
		Overflow = 1,
		Deficient = 2,
		IllegalParam = 3,
		Error = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EEnergyUsage
	 */
	enum class EEnergyUsage : uint8_t
	{
		Box = 0,
		Weapon = 1,
		Ability = 2,
		Jet = 3,
		Pile = 4,
		Armor = 5,
		Shield = 6,
		Sky = 7,
		RadarStation = 8,
		ElectricShop = 9,
		DeathBox = 10,
		MAX = 11
	};

	/**
	 * Enum Solarland.EItemAppearanceType
	 */
	enum class EItemAppearanceType : uint8_t
	{
		EApprenace_None = 0,
		EApprenace_Outline = 1,
		EApprenace_Float = 2,
		EApprenace_All = 3,
		EApprenace_MAX = 4
	};

	/**
	 * Enum Solarland.EItemType
	 */
	enum class EItemType : uint32_t
	{
		NONE = 0,
		SHIELD = 101,
		ARMOR = 102,
		BULLET = 103,
		CARIRIDGE_BAG = 104,
		ARMOR_MATERIAL = 105,
		ENERGY_MODULE = 106,
		EXTRA_ENERGY = 107,
		RADAR_OPERATOR = 108,
		BACKPACK_ENERGY = 109,
		BACKUP_ENERGY = 110,
		SHIELD_RECHARGER = 112,
		BACKPACK_ITEM = 113,
		WEAPON_PARTS = 114,
		JETPACK_MODULE_HORIZONTAL = 111,
		JETPACK_MODULE_VERTICAL = 115,
		REVIVE_ITEM = 116,
		TREASUREBOX = 120,
		AIRDROPBOX = 121,
		DEATHBOX = 122,
		NEUTRAL_CARD = 130,
		SHIELD_UPGRADE_MATERIAL = 148,
		EXP_ITEM = 149,
		WEAPON = 151,
		WEAPON_SKIN = 171,
		BACKPACK = 201,
		TAILFLAME = 202,
		CARDPOSE = 203,
		CARDBACKGROUND = 204,
		CAPSULE = 251,
		CHAR_SKIN_MIN = 301,
		CHAR_ANIMATION_MVP = 302,
		CHAR_SKIN_MAX = 350,
		CHARACTER = 351,
		EXPERIENCE = 401,
		GIFTBAG = 404,
		CHARACTER_TRIALCARD = 405,
		CHARACTERSKIN_TRIALCARD = 406,
		ACTIVENESS = 411,
		WEAPONSKIN_TRIALCARD = 412,
		GIFTBAG_ONBACKPACK = 414,
		BACKPACK_TRIALCARD = 415,
		TAILFLAME_TRIALCARD = 416,
		DIAMOND_VOUCHER = 417,
		LOTCOIN = 421,
		ZOMBORG = 422,
		WISHCOIN = 423,
		SURPRISECOIN = 424,
		TOKEN = 430,
		BUSINESSCARDFRAME = 432,
		AVATARFRAME = 434,
		CHARACTER_SHARD = 435,
		CHARACTER_SKIN_SHARD = 436,
		WEAPON_SKIN_SHARD = 437,
		BACKPACK_SHARD = 438,
		TAILFLAME_SHARD = 439,
		CAPSULE_SHARD = 440,
		VEHICLE_SKIN_SHARD = 441,
		ACCOUNT_AVATAR = 443,
		EMOTE = 444,
		SIGNIN_CARD = 447,
		RAFFLE_TICKET = 448,
		HOMEBUILD = 501,
		HOMEINSTALLATION = 502,
		HOMEITEM = 503,
		HOMEDRAWING = 504,
		HOMEPART = 505,
		HOMEDEVICE = 506,
		HOMEMAX = 520,
		VEHICLE_SKIN = 701,
		SUPPLYBOX = 801,
		DISPLAY_ITEM = 999,
		MAX = 1000
	};

	/**
	 * Enum Solarland.EWeaponSlotType
	 */
	enum class EWeaponSlotType : uint8_t
	{
		UnArm = 0,
		Primary = 1,
		Secondary = 2,
		Tertiary = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EGmType
	 */
	enum class EGmType : uint8_t
	{
		Fetch = 0,
		Discard = 1,
		ClearBackPack = 2,
		Use = 3,
		RemoveWeapon = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EEnergyState
	 */
	enum class EEnergyState : uint8_t
	{
		NORMAL = 0,
		SKY = 1,
		PILE = 2,
		BOX = 3,
		E2M = 4,
		M2E = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ESocialActionType
	 */
	enum class ESocialActionType : uint8_t
	{
		None = 0,
		Like = 1,
		Unlike = 2,
		Gift = 3,
		SendTask = 4,
		IncreaseTaskLevel = 5,
		FinishTask = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EVehicleWeaponScopeType
	 */
	enum class EVehicleWeaponScopeType : uint8_t
	{
		None = 0,
		Magnifier_X2 = 1,
		Magnifier_X4 = 2,
		Magnifier_X8 = 3,
		Max = 4
	};

	/**
	 * Enum Solarland.EInteractiveTaskType
	 */
	enum class EInteractiveTaskType : uint8_t
	{
		None = 0,
		KillWithWeaponType = 1,
		KillWithAnyVehicle = 2,
		KillByFist = 3,
		OpenAirdrop = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESocialCurrencyType
	 */
	enum class ESocialCurrencyType : uint8_t
	{
		None = 0,
		Gold = 1,
		Diamond = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EFindSpectateTargetType
	 */
	enum class EFindSpectateTargetType : uint8_t
	{
		Teammate = 0,
		PlayerKiller = 1,
		AIKiller = 2,
		AllNonBot = 3,
		All = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESpectatePhase
	 */
	enum class ESpectatePhase : uint8_t
	{
		NotSpectate = 0,
		LookAtSelfDeathBox = 1,
		SpectateTeammates = 2,
		BlockWhenAllTeammatesDead = 3,
		SpectateAllPlayers = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_BattleUpgradeEffectType
	 */
	enum class ESolarTablesEnum_BattleUpgradeEffectType : uint8_t
	{
		MaxHp = 0,
		BulletDamage = 1,
		CharacterSkillDamage = 2,
		VehicleWeaponDamage = 3,
		VehicleSkillDamage = 4,
		VehicleStrikeDamage = 5,
		CharacterPunchDamage = 6,
		CharacterUpgradeDamage = 7,
		_Count = 8,
		ESolarTablesEnum_MAX = 9
	};

	/**
	 * Enum Solarland.EPlayerStateRepType
	 */
	enum class EPlayerStateRepType : uint8_t
	{
		Character = 0,
		Controller = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EPlayerChangedGoldResult
	 */
	enum class EPlayerChangedGoldResult : uint8_t
	{
		None = 0,
		Success = 1,
		GoldIsNotEnough = 2,
		NetworkError = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EPlayerChangedGoldType
	 */
	enum class EPlayerChangedGoldType : uint8_t
	{
		None = 0,
		CostedGold = 1,
		ReceivedGold = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EExpBehaviorType
	 */
	enum class EExpBehaviorType : uint8_t
	{
		None = 0,
		Kill = 1,
		Assist = 2,
		Damage = 3,
		Pickup = 4,
		Survival = 5,
		Spawner = 6,
		Device = 7,
		TreasureBox = 8,
		DeathBox = 9,
		Airdrop = 10,
		PureDrop = 11,
		MAX = 12
	};

	/**
	 * Enum Solarland.ECharacterStateInGame
	 */
	enum class ECharacterStateInGame : uint8_t
	{
		None = 0,
		InVehicle = 1,
		Dying = 2,
		Dead = 3,
		MaxState = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EPlayerStateInGame
	 */
	enum class EPlayerStateInGame : uint8_t
	{
		None = 0,
		AppHasDeactivated = 1,
		AppHasReactivated = 2,
		Talking = 3,
		MaxState = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EPassiveTriggeredVoice
	 */
	enum class EPassiveTriggeredVoice : uint8_t
	{
		NOVOICE = 0,
		Personality = 1,
		TakeIt = 2,
		Alright = 3,
		GotIt = 4,
		MarkLocation = 5,
		AirdropsDelivering = 6,
		AirdropsDelivered = 7,
		Remaining3EnemySuqads = 8,
		Remaining2EnemySuqads = 9,
		Remaining1EnemySuqads = 10,
		SafeZoneRetract30s = 11,
		ResurrectionPeriodEnded = 12,
		WelcomeToFarlight84 = 13,
		AirdropsArriveIn60 = 14,
		AirdropsArriveIn45 = 15,
		AirdropsArriveIn30 = 16,
		CharAppear = 17,
		UsingMedicine = 18,
		AddingShield = 19,
		Reloading = 20,
		HelpingTeammate = 21,
		HitEnemy = 22,
		KillEnemy = 23,
		DestroyOtherTeam = 24,
		ReviveTeammate = 25,
		TakeDamage = 26,
		Defeated = 27,
		GetKilled = 28,
		TeammataDefeated = 29,
		TooFarApart = 30,
		Charging50 = 31,
		ChargingFinish = 32,
		BecomeKillLeader = 33,
		BackInTheFight = 34,
		ParachuteFollowMe = 35,
		ParachuteStartJump = 36,
		NeedWeapons = 37,
		NeedVehicle = 38,
		NeedMuzzle = 39,
		NeedGrip = 40,
		NeedMagazine = 41,
		NeedStock = 42,
		NeedScope = 43,
		NeedShield = 44,
		NeedBatteryPack = 45,
		NeedHorizontalCooldown = 46,
		NeedVerticalCooldown = 47,
		NeedSMGAmmo = 48,
		NeedShutGunAmmo = 49,
		NeedRifleAmmo = 50,
		NeedSniperAmmo = 51,
		NeedMedKit = 52,
		NeedShieldRestorer = 53,
		NeedSpecialWeapon = 54,
		NeedRespawnPod = 55,
		NeedBigShield = 56,
		UseSuperSkill = 57,
		Level1 = 58,
		Level2 = 59,
		Level3 = 60,
		Level4 = 61,
		Level5 = 62,
		RemindTeammateRevive = 63,
		MAX = 64
	};

	/**
	 * Enum Solarland.EPlayerNetStateInGame
	 */
	enum class EPlayerNetStateInGame : uint8_t
	{
		None = 0,
		Online = 1,
		Offline = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ETeamType
	 */
	enum class ETeamType : uint8_t
	{
		PlayerTeam = 0,
		AITeam = 1,
		OnlyPlayerTeam = 2,
		EmptyTeam = 3,
		AnyTeam = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ETalentState
	 */
	enum class ETalentState : uint8_t
	{
		Activating = 0,
		CoolingDown = 1,
		Unactivated = 2,
		Invalid = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EInteractableType
	 */
	enum class EInteractableType : uint8_t
	{
		FIRECIRCLE = 0,
		JUMPPAD = 1,
		VEHICLEPAD = 2,
		RADARSTATION = 3,
		ELECTRICSHOP = 4,
		CHARGINGPILE = 5,
		SHIELDUPGRADEITEM = 6,
		SHIELDCREATOR = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.EWorldMarkType
	 */
	enum class EWorldMarkType : uint8_t
	{
		ITEM = 0,
		INVALID = 1,
		WARNING = 2,
		MINIMAP = 3,
		BIGMAP = 4,
		VEHICLE = 5,
		INTERACTABLEACTOR = 6,
		QUICKCHATWHEEL = 7,
		ATTACHED = 8,
		SUMMONACTOR = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.EAppLifetimeState
	 */
	enum class EAppLifetimeState : uint8_t
	{
		NONE = 0,
		NORMAL = 1,
		Background = 2,
		Deactive = 3,
		Terminated = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESkydivingState
	 */
	enum class ESkydivingState : uint8_t
	{
		NotStarted = 0,
		PreStart = 1,
		InProgress = 2,
		Completed = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESCMPlayerOutPath
	 */
	enum class ESCMPlayerOutPath : uint8_t
	{
		None = 0,
		OutFromSettingUI = 1,
		OutBySelf = 2,
		KickOutByServer = 3,
		OBSwitchScene = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESCMPlayerPunishType
	 */
	enum class ESCMPlayerPunishType : uint8_t
	{
		None = 0,
		HangUp = 1,
		DropOut = 2,
		IsolationPool = 3,
		KillTeammate = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EReplayCameraMode
	 */
	enum class EReplayCameraMode : uint8_t
	{
		None = 0,
		ThirdPersonMode = 1,
		LockMode = 2,
		FreeMode = 3,
		LookAtMode = 4,
		CircularMode = 5,
		FreeLookAtMode = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.ESolarSummonDeathReason
	 */
	enum class ESolarSummonDeathReason : uint8_t
	{
		SelfTimeDecay = 0,
		SelfLifeDecay = 1,
		OtherDestroy = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESkydiveStage
	 */
	enum class ESkydiveStage : uint8_t
	{
		None = 0,
		Flying = 1,
		Landing = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarCharacterType
	 */
	enum class ESolarCharacterType : uint8_t
	{
		None = 0,
		Player = 1,
		Bot = 2,
		Monster = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ECharacterSoundOpt
	 */
	enum class ECharacterSoundOpt : uint8_t
	{
		None = 0,
		Shield_Hit_1P = 1,
		Shield_Hit_3P = 2,
		Shield_Broken_1P = 3,
		Shield_Broken_3P = 4,
		Vehicle_Speedboard_1P = 5,
		Body_Hit_With_Bullet_Common_1P = 6,
		Body_Hit_By_Bullet_Common_1P = 7,
		Body_Hit_With_Punch_Common_1P = 8,
		Body_Hit_By_Punch_Common_1P = 9,
		Headshot_1P = 10,
		Headshot_Kill_UI = 11,
		Shot_Down_UI = 12,
		Shot_Down_1P = 13,
		Shot_Down_3P = 14,
		Shot_Down_3P_Enemy = 15,
		Death_UI = 16,
		Death_1P = 17,
		Death_3P = 18,
		Airborne_Fall_Start_1P = 19,
		Water_Fall_1P = 20,
		Water_Fall_3P = 21,
		Water_Fall_3P_Enemy = 22,
		Squat_1P = 23,
		Squat_3P = 24,
		Squat_3P_Enemy = 25,
		Stop_Climb_1P = 26,
		Stop_Climb_3P = 27,
		Stop_Climb_3P_Enemy = 28,
		Loop_Knapsack_Solar_Percent_1P = 29,
		Stop_Knapsack_Solar_Percent_1P = 30,
		Knapsack_Solar_Charging_Done_1P = 31,
		Knapsack_Solar_On_1P = 32,
		Knapsack_Solar_Off_1P = 33,
		Sniper_B01_Skill_On_1P = 34,
		Sniper_B01_Skill_Off_1P = 35,
		B9A04_Skill_Loop_1P = 36,
		B9A04_Skill_Loop_3P = 37,
		B9A04_Skill_Loop_3P_Enemy = 38,
		B9A04_Skill_Loop_End_1P = 39,
		B9A04_Skill_Loop_End_3P = 40,
		B9A04_Skill_Loop_End_3P_Enemy = 41,
		Knapsack_Landing_1P = 42,
		Knapsack_Landing_3P = 43,
		Knapsack_Landing_3P_Enemy = 44,
		Knapsack_Fly_Water_1P = 45,
		Knapsack_Fly_Water_3P = 46,
		Knapsack_Fly_Water_3P_Enemy = 47,
		Play_Shield_OneSet_1P = 48,
		Play_Shield_OneSet_3P = 49,
		Play_Shield_OneSet_3P_Enemy = 50,
		Play_Shield_Charging_1P = 51,
		Play_Shield_Multi_Charging_1P = 52,
		Play_Shield_Charging_3P = 53,
		Play_Shield_Charging_3P_Enemy = 54,
		Play_Shield_Charged_1P = 55,
		Play_Shield_Charged_3P = 56,
		Play_Shield_Charged_3P_Enemy = 57,
		Play_Shield_Charge_To_Max_1P = 58,
		Play_Shield_Charge_To_Max_3P = 59,
		Play_Shield_Charge_To_Max_3P_Enemy = 60,
		Play_Shield_Charge_Break_1P = 61,
		Play_Shield_Charge_Break_3P = 62,
		Play_Shield_Charge_Break_3P_Enemy = 63,
		Play_Hit_By_EMP_1P = 64,
		Play_Hit_By_EMP_3P = 65,
		Play_Hit_By_EMP_3P_Enemy = 66,
		Stop_Hit_By_EMP_1P = 67,
		Stop_Hit_By_EMP_3P = 68,
		Stop_Hit_By_EMP_3P_Enemy = 69,
		Play_Monster_Appear = 70,
		Play_Monster_Die = 71,
		Play_Heal_Wrap_1P = 72,
		Play_Heal_Wrap_3P = 73,
		Play_Heal_Wrap_3P_Enemy = 74,
		Stop_Heal_Wrap_1P = 75,
		Stop_Heal_Wrap_3P = 76,
		Stop_Heal_Wrap_3P_Enemy = 77,
		Play_Heal_Wrap_Cancel_1P = 78,
		Play_Heal_Wrap_Cancel_3P = 79,
		Play_Heal_Wrap_Cancel_3P_Enemy = 80,
		Play_Heal_Wrap_Complete_1P = 81,
		Play_Heal_Wrap_Complete_3P = 82,
		Play_Heal_Wrap_Complete_3P_Enemy = 83,
		Stop_Shield_Charging_1P = 84,
		Stop_Shield_Charging_3P = 85,
		Stop_Shield_Charging_3P_Enemy = 86,
		Mark_Select_Dial_UI = 87,
		Mark_Select_Pin_UI = 88,
		Mark_Select_Cancel_UI = 89,
		Mark_Select_Common_UI = 90,
		Mark_Danger_UI = 91,
		Play_Skill_Fast_Reload = 92,
		Play_char_skill_passive_targetlock = 93,
		Max = 94
	};

	/**
	 * Enum Solarland.ESCMDamageType
	 */
	enum class ESCMDamageType : uint8_t
	{
		Point = 0,
		Poison = 1,
		Bomb = 2,
		AirDrop = 3,
		Dying = 4,
		VehicleHit = 5,
		VehicleExplosion = 6,
		Weapon = 7,
		UnarmWeapon = 8,
		VehicleWeapon = 9,
		SummonWeapon = 10,
		VehicleAbility = 11,
		WeaponAbility = 12,
		HelplessDeathVerge = 13,
		DeathVergeInWater = 14,
		GMCmd = 15,
		BackToLobby = 16,
		AppEnterBackground = 17,
		LongTimeDisconnect = 18,
		ClassSkill = 19,
		TacticalSkill = 20,
		MAX = 21
	};

	/**
	 * Enum Solarland.EDamageResultType
	 */
	enum class EDamageResultType : uint8_t
	{
		Normal = 0,
		Down = 1,
		Die = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EHealthChangeType
	 */
	enum class EHealthChangeType : uint8_t
	{
		Normal = 0,
		Self = 1,
		Ability = 2,
		Ability_Deadly = 3,
		Item = 4,
		Teammate = 5,
		Environment = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.ESolarAttributeType
	 */
	enum class ESolarAttributeType : uint8_t
	{
		None = 0,
		BasePhysicalDamage = 1,
		BaseEnergyDamage = 2,
		Health = 3,
		DeadlyDamage = 4,
		Energy = 5,
		Shield = 6,
		Weapon = 7,
		Mark = 8,
		MaxHealth = 9,
		MaxItemPile = 10,
		MoveSpeed = 11,
		ShieldRechargeCost = 12,
		Max = 13
	};

	/**
	 * Enum Solarland.EShieldUpgradeInteractAckType
	 */
	enum class EShieldUpgradeInteractAckType : uint8_t
	{
		Success = 0,
		ItemReachLimit = 1,
		AlreadyInteracted = 2,
		SuccessWithReconnect = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EShieldCancelRechargeReason
	 */
	enum class EShieldCancelRechargeReason : uint8_t
	{
		None = 0,
		StopAutoRecharge = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarHitType
	 */
	enum class ESolarHitType : uint8_t
	{
		None = 0,
		Character_Hit = 1,
		Character_Kill = 2,
		Character_BreakArmor = 3,
		Character_BreakShield = 4,
		Character_PendingKill = 5,
		Character_Headshot = 6,
		Character_HitShield = 7,
		Character_HitArmor = 8,
		Character_HitDown = 9,
		Character_HeadshotKill = 10,
		Vehicle_Hit = 11,
		Vehicle_HitWeakness = 12,
		MAX = 13
	};

	/**
	 * Enum Solarland.EPlayerWeaponMsgType
	 */
	enum class EPlayerWeaponMsgType : uint8_t
	{
		HitPawn = 0,
		PlayerAssist = 1,
		NpcAssist = 2,
		SafeAreaUpdate = 3,
		ForbidShooting = 4,
		AddExp = 5,
		Max = 6
	};

	/**
	 * Enum Solarland.EShieldRechargeState
	 */
	enum class EShieldRechargeState : uint8_t
	{
		AutoRecharge = 0,
		ManualRecharge = 1,
		None = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ECharacterOperation
	 */
	enum class ECharacterOperation : uint8_t
	{
		None = 0,
		OpenScope = 1,
		CloseScope = 2,
		OpenScopeInstant = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EItemChangeType
	 */
	enum class EItemChangeType : uint8_t
	{
		Default = 0,
		PickUp = 1,
		Drop = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ECustomJumpType
	 */
	enum class ECustomJumpType : uint8_t
	{
		None = 0,
		Jump = 1,
		Launch = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EDriveState
	 */
	enum class EDriveState : uint8_t
	{
		None = 0,
		Driver = 1,
		Passenger = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ERoleSkillStatus
	 */
	enum class ERoleSkillStatus : uint8_t
	{
		Normal = 0,
		WaitTriggerAgain = 1,
		Disable = 2,
		InCD = 3,
		Forbidden = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESpecAnimInstType
	 */
	enum class ESpecAnimInstType : uint8_t
	{
		Base = 0,
		Vehicle = 1,
		OneHandThrow = 2,
		KeepFiring = 3,
		Gatling = 4,
		CardsThrow = 5,
		DuckRolling = 6,
		InvisibleZone = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.EWeaponPartType
	 */
	enum class EWeaponPartType : uint8_t
	{
		Muzzle = 0,
		Scope = 1,
		Clip = 2,
		Rune = 3,
		Grip = 4,
		GunStock = 5,
		Scope2x = 6,
		Scope4x = 7,
		Scope8x = 8,
		MAX = 9
	};

	/**
	 * Enum Solarland.EVelocityStatus
	 */
	enum class EVelocityStatus : uint8_t
	{
		Any = 0,
		Stationary = 1,
		Moving = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWeaponType
	 */
	enum class EWeaponType : uint8_t
	{
		AssualtRifle = 0,
		Submachinegun = 1,
		Shotgun = 2,
		Sniper = 3,
		VehicleMounted = 4,
		ItemWeapon = 5,
		SummonWeapon = 6,
		AntiVehicle = 7,
		Unarm = 8,
		Unknown = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.EShieldWidgetState
	 */
	enum class EShieldWidgetState : uint8_t
	{
		None = 0,
		PreAdd = 1,
		DoAdd = 2,
		CancelAdd = 3,
		DoSub = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EEnterBattleType
	 */
	enum class EEnterBattleType : uint8_t
	{
		OnHit = 0,
		OnWeaponFire = 1,
		NotEnter = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EJetFlyType
	 */
	enum class EJetFlyType : uint8_t
	{
		None = 0,
		VerticalJetFly = 1,
		HorizontalJetFly = 2,
		CustomJetFly = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EShieldState
	 */
	enum class EShieldState : uint8_t
	{
		NONE = 0,
		SPAWN = 1,
		NORMAL = 2,
		RECHARGE = 3,
		BREAK = 4,
		PILE = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EHitSoundTargetType
	 */
	enum class EHitSoundTargetType : uint8_t
	{
		Default = 0,
		CharacterBody = 1,
		CharacterHead = 2,
		CharacterShieldBody = 3,
		CharacterShieldHead = 4,
		CharacterHitDown = 5,
		CharacterKill = 6,
		CharacterKill2 = 7,
		Vehicle = 8,
		VehicleWeakPoint = 9,
		SummonItemSolid = 10,
		SummonItemVirtual = 11,
		MAX = 12
	};

	/**
	 * Enum Solarland.EHitSoundSourceType
	 */
	enum class EHitSoundSourceType : uint8_t
	{
		Default = 0,
		Weapon = 1,
		Melee = 2,
		Skill = 3,
		VehicleWeapon = 4,
		VehicleSkill = 5,
		VehicleHit = 6,
		Poison = 7,
		AirDrop = 8,
		Bomb = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.ESingleCruiseState
	 */
	enum class ESingleCruiseState : uint8_t
	{
		NONE = 0,
		Fly = 1,
		Parachute = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarTreatmentState
	 */
	enum class ESolarTreatmentState : uint8_t
	{
		None = 0,
		Treating = 1,
		End = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EShieldSoundType
	 */
	enum class EShieldSoundType : uint8_t
	{
		StartRecharge = 0,
		Charging = 1,
		Charged = 2,
		ChargedToMax = 3,
		ChargeBreak = 4,
		ShieldHitted = 5,
		ShieldBroken = 6,
		StopRecharge = 7,
		MultiCharging = 8,
		MAX = 9
	};

	/**
	 * Enum Solarland.EShieldSoundEventType
	 */
	enum class EShieldSoundEventType : uint8_t
	{
		Type_1P = 0,
		Type_3P = 1,
		Type_3P_Enemy = 2,
		Type_MAX = 3
	};

	/**
	 * Enum Solarland.EIdleTurnType
	 */
	enum class EIdleTurnType : uint8_t
	{
		Turn_Idle = 0,
		Turn_Left = 1,
		Turn_Right = 2,
		Turn_MAX = 3
	};

	/**
	 * Enum Solarland.ETreasureBoxState
	 */
	enum class ETreasureBoxState : uint8_t
	{
		None = 0,
		Close = 1,
		Open = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWallRunState
	 */
	enum class EWallRunState : uint8_t
	{
		WallRunning = 0,
		Success = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESkillAnimRightHandType
	 */
	enum class ESkillAnimRightHandType : uint8_t
	{
		Default = 0,
		Card = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESkillAnimType
	 */
	enum class ESkillAnimType : uint8_t
	{
		None = 0,
		SkillWithoutAnim = 1,
		OneHandThrow = 2,
		DoubleHandsThrow = 3,
		KeepFiring = 4,
		Gatling = 5,
		CardsThrow = 6,
		DuckRolling = 7,
		InvisibleZone = 8,
		MAX = 9
	};

	/**
	 * Enum Solarland.EBGMInBattle
	 */
	enum class EBGMInBattle : uint8_t
	{
		None = 0,
		Curise = 1,
		Skydiving = 2,
		Land = 3,
		End = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ECruiseState
	 */
	enum class ECruiseState : uint8_t
	{
		None = 0,
		Boarded = 1,
		CruisePendingStarted = 2,
		CruiseStarted = 3,
		ParachuteAllowed = 4,
		ParachutePendingStarted = 5,
		ParachuteStarted = 6,
		End = 7,
		Max = 8
	};

	/**
	 * Enum Solarland.ERescueState
	 */
	enum class ERescueState : uint8_t
	{
		EState_None = 0,
		EState_Dying = 1,
		EState_Rescuing = 2,
		EState_BeingRescue = 3,
		EState_MAX = 4
	};

	/**
	 * Enum Solarland.EBackpackPropellingMode
	 */
	enum class EBackpackPropellingMode : uint8_t
	{
		Default = 0,
		Skydive = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EFXJetType
	 */
	enum class EFXJetType : uint8_t
	{
		JetDefault = 0,
		JetSingle = 1,
		JetLoop = 2,
		VerticalLaunch = 3,
		WallRun = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ECharacterBodyScaleType
	 */
	enum class ECharacterBodyScaleType : uint8_t
	{
		None = 0,
		Woman = 1,
		Man = 2,
		DuckMan = 3,
		SmallWoman = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EVehicleClass
	 */
	enum class EVehicleClass : uint8_t
	{
		All = 0,
		Wheeled = 1,
		Legged = 2,
		Hover = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EWeaponUIType
	 */
	enum class EWeaponUIType : uint8_t
	{
		All = 0,
		AssualtRifle = 1,
		Submachinegun = 2,
		Shotgun = 3,
		Sniper = 4,
		Others = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ECustomParamValueType
	 */
	enum class ECustomParamValueType : uint8_t
	{
		None = 0,
		Bool = 1,
		Int = 2,
		Float = 3,
		Percent = 4,
		Enum_S = 5,
		Enum_M = 6,
		AvailableWeapons = 7,
		AvailableVehicles = 8,
		MAX = 9
	};

	/**
	 * Enum Solarland.ERemovedReasonType
	 */
	enum class ERemovedReasonType : uint8_t
	{
		None = 0,
		TimeOut = 1,
		Abandoned = 2,
		OwnerKick = 3,
		NotEnough = 4,
		ServerKick = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EReplayActivityHeatKillUseType
	 */
	enum class EReplayActivityHeatKillUseType : uint8_t
	{
		None = 0,
		Weapon = 1,
		Vehicle = 2,
		Skill = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EPlayerActivityHeatType
	 */
	enum class EPlayerActivityHeatType : uint8_t
	{
		None = 0,
		Parachute = 1,
		ResurrectionParachute = 2,
		KillDown = 3,
		MultiKill = 4,
		BeKillDown = 5,
		Death = 6,
		Win = 7,
		Max = 8
	};

	/**
	 * Enum Solarland.EShotMomentFlag
	 */
	enum class EShotMomentFlag : uint8_t
	{
		shotting = 0,
		hit = 1,
		killed = 2,
		invalid = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EShotModeFlag
	 */
	enum class EShotModeFlag : uint8_t
	{
		orgin = 0,
		d3d = 1,
		dwm = 2,
		rand = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarInputMode
	 */
	enum class ESolarInputMode : uint8_t
	{
		GameOnly = 0,
		GameAndUI = 1,
		UIOnly = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EInputSwitchType
	 */
	enum class EInputSwitchType : uint8_t
	{
		ActionBinding = 0,
		ActionRemove = 1,
		AxisBinding = 2,
		AxisRemove = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarIgnoreCollisionType
	 */
	enum class ESolarIgnoreCollisionType : uint8_t
	{
		EnergyShield = 0,
		SummonItemCore = 1,
		SummonItem = 2,
		Character = 3,
		Vehicle = 4,
		UAV = 5,
		Water = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EAlertDirection
	 */
	enum class EAlertDirection : uint8_t
	{
		Forward = 0,
		Backward = 1,
		Left = 2,
		Right = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ECustomNoticeColor
	 */
	enum class ECustomNoticeColor : uint8_t
	{
		None = 0,
		Red = 1,
		Green = 2,
		Blue = 3,
		Yellow = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ECustomNoticeType
	 */
	enum class ECustomNoticeType : uint8_t
	{
		SmallNotice = 0,
		MediumNotice = 1,
		BigNotice = 2,
		KillEffectNotice = 3,
		GlobalKillNotice = 4,
		LocalKillNotice = 5,
		PickUpNotice = 6,
		WeaponExpNotice = 7,
		EquipReplaceNotice = 8,
		TaskNotice = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.EResurrectionState
	 */
	enum class EResurrectionState : uint8_t
	{
		Alive = 0,
		WaitingTeammatesHelp = 1,
		TimeOut = 2,
		AllTeammatesDied = 3,
		LeaveBattle = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESCMDataType
	 */
	enum class ESCMDataType : uint8_t
	{
		None = 0,
		Byte = 1,
		Int = 2,
		Float = 3,
		Bool = 4,
		FVector = 5,
		FString = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.ETaskPage
	 */
	enum class ETaskPage : uint8_t
	{
		TPNone = 0,
		TPDaily = 1,
		TPGrow = 2,
		TPHomeDaily = 3,
		TPSeason = 4,
		TPPassDaily = 5,
		TPPassWelfare = 6,
		TPPassWeek = 7,
		TPMonthlyDaily = 8,
		TPMonthlyWeek = 9,
		TPHalMonth = 10,
		TPWeekChallenge = 11,
		TPShareCodeDaily = 12,
		TPShareCodePersonal = 13,
		TPShareCodeFriend = 14,
		TPCollectRedeem = 15,
		MAX = 16
	};

	/**
	 * Enum Solarland.ESCMPlayerGameRole
	 */
	enum class ESCMPlayerGameRole : uint8_t
	{
		StandBy = 0,
		OBPlayer = 1,
		Player = 2,
		Spectator = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESCMPlayerType
	 */
	enum class ESCMPlayerType : uint8_t
	{
		None = 0,
		Player = 1,
		BotAI = 2,
		Monster = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESCMPlayerOutType
	 */
	enum class ESCMPlayerOutType : uint8_t
	{
		None = 0,
		SelfLogout = 1,
		BattleEnd = 2,
		SelfEnd = 3,
		OfflineEnd = 4,
		Cheating = 5,
		Abnormal = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.ESCMPlayerState
	 */
	enum class ESCMPlayerState : uint8_t
	{
		None = 0,
		PreLogin = 1,
		NotJoin = 2,
		InBattle = 3,
		Suspend = 4,
		BattleEnd = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EPersonalScoreType
	 */
	enum class EPersonalScoreType : uint8_t
	{
		None = 0,
		Kill = 1,
		Assist = 2,
		OccupyingPerSec = 3,
		Capture = 4,
		Release = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EBattlegroundPlayerStatus
	 */
	enum class EBattlegroundPlayerStatus : uint8_t
	{
		WaitForBattle = 0,
		Battle = 1,
		WaitForRebirth = 2,
		Deploying = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EDeploymentType
	 */
	enum class EDeploymentType : uint8_t
	{
		None = 0,
		BlueHome = 1,
		RedHome = 2,
		A = 3,
		B = 4,
		C = 5,
		D = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EMatchResult
	 */
	enum class EMatchResult : uint8_t
	{
		None = 0,
		Victory = 1,
		Fail = 2,
		Draw = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EFactionType
	 */
	enum class EFactionType : uint8_t
	{
		Neutral = 0,
		Blue = 1,
		Red = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EFileDownloadError
	 */
	enum class EFileDownloadError : uint8_t
	{
		None = 0,
		ConnectFailed = 1,
		RequestHeadFailed = 2,
		CreateFileFailed = 3,
		DownloadFailed = 4,
		WriteFailed = 5,
		DeleteOldFailed = 6,
		MoveFailed = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.EDownloadFailedStep
	 */
	enum class EDownloadFailedStep : uint8_t
	{
		DownloadServerListFailed = 0,
		DownloadPakListFailed = 1,
		DownloadPakFileFailed = 2,
		MountPakFileFailed = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EBuffEffectTagType
	 */
	enum class EBuffEffectTagType : uint8_t
	{
		None = 0,
		TopHalfPart = 1,
		BottomHalfPart = 2,
		TwoSidePart = 3,
		BorderPart = 4,
		FullPart = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_InputTriggerType
	 */
	enum class ESolarTablesEnum_InputTriggerType : uint8_t
	{
		InputTriggerPressed = 0,
		InputTriggerTap = 1,
		InputTriggerDoubleTap = 2,
		InputTriggerHold = 3,
		_Count = 4,
		ESolarTablesEnum_MAX = 5
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_InputActionType
	 */
	enum class ESolarTablesEnum_InputActionType : uint8_t
	{
		Action = 0,
		Axis = 1,
		_Count = 2,
		ESolarTablesEnum_MAX = 3
	};

	/**
	 * Enum Solarland.EPickupItemType
	 */
	enum class EPickupItemType : uint8_t
	{
		None = 0,
		Normal = 1,
		TreasureBox = 2,
		DeathBox = 3,
		HomeItem = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EJetFlyForbiddenType
	 */
	enum class EJetFlyForbiddenType : uint8_t
	{
		Water = 0,
		Climb = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarITemHUDStyle
	 */
	enum class ESolarITemHUDStyle : uint8_t
	{
		Spread = 0,
		Wheel = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ECountDownState
	 */
	enum class ECountDownState : uint8_t
	{
		CD_Normal = 0,
		CD_Buff = 1,
		CD_MAX = 2
	};

	/**
	 * Enum Solarland.EInputButton
	 */
	enum class EInputButton : uint8_t
	{
		None = 0,
		Jump = 1,
		RechargeShield = 2,
		BigRechargeShield = 3,
		Crouch = 4,
		JetVertical = 5,
		JetHorizontal = 6,
		Fire = 7,
		LeftFire = 8,
		AltFire = 9,
		QuickAds = 10,
		CancelAction = 11,
		FreeLook = 12,
		Interact = 13,
		InteractAlternative = 14,
		Reload = 15,
		TogglePrimaryWeapon = 16,
		ToggleSecondaryWeapon = 17,
		ToggleTertiaryWeapon = 18,
		TogglePrimaryWeapon_Checkbox = 19,
		ToggleSecondaryWeapon_Checkbox = 20,
		ToggleTertiaryWeapon_Checkbox = 21,
		ToggleGunsight = 22,
		Gunsight = 23,
		SprintFreeOnPC = 24,
		SprintFreeOnMobile = 25,
		SprintLock = 26,
		Equip1 = 27,
		Equip2 = 28,
		Map = 29,
		Eject = 30,
		OutVehicle = 31,
		Backpack = 32,
		UseMedicine = 33,
		UseRecommendItem = 34,
		Pickup = 35,
		TogglePickup = 36,
		SwitchFireMode = 37,
		SwitchToSeat1 = 38,
		SwitchToSeat2 = 39,
		SwitchToSeat3 = 40,
		SwitchToSeat4 = 41,
		VehicleAbility1 = 42,
		VehicleAbility2 = 43,
		RoleSkillSuper = 44,
		RoleSkillTactical = 45,
		ShieldUpgrade = 46,
		ShieldUpgradeCancel = 47,
		TogglePutAwayWeapon = 48,
		Max = 49
	};

	/**
	 * Enum Solarland.EKillParamsCompressInfo
	 */
	enum class EKillParamsCompressInfo : uint8_t
	{
		Default = 0,
		bKillLeaderChange = 1,
		bKillLeaderShutDown = 2,
		bRevenge = 3,
		bShutDown = 4,
		bDown = 5,
		bClearTeam = 6,
		bKillDefender = 7,
		bKillerDead = 8,
		bHitHead = 9,
		bKillLeaderKill = 10,
		MAX = 11
	};

	/**
	 * Enum Solarland.ESpectateReferToState
	 */
	enum class ESpectateReferToState : uint8_t
	{
		Invalid = 0,
		Enter = 1,
		Change = 2,
		Exit = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EVehicleInterationUIState
	 */
	enum class EVehicleInterationUIState : uint8_t
	{
		None = 0,
		Repair = 1,
		Drive = 2,
		Passenger = 3,
		Backpacker = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ETransformerType
	 */
	enum class ETransformerType : uint8_t
	{
		Wheeled = 0,
		Legged = 1,
		Max = 2
	};

	/**
	 * Enum Solarland.EPlayerNamePanelScale
	 */
	enum class EPlayerNamePanelScale : uint8_t
	{
		ExtraSmallSize = 0,
		SmallSize = 1,
		DefaultSize = 2,
		LargeSize = 3,
		ExtraLargeSize = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EBattleOBHUDType
	 */
	enum class EBattleOBHUDType : uint8_t
	{
		None = 0,
		SpectatePlayer = 1,
		FreeView = 2,
		FreeLookAt = 3,
		Director = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EOBPlayerHeadInfoWidgetStyle
	 */
	enum class EOBPlayerHeadInfoWidgetStyle : uint8_t
	{
		NearMode = 0,
		MiddleMode = 1,
		FarMode = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EUIPanelName
	 */
	enum class EUIPanelName : uint8_t
	{
		None = 0,
		SolarBattleControll = 1,
		WorldMarkPanel = 2,
		WeaponCrosshairPanel = 3,
		SolarBattle_Backpack = 4,
		Separate_Discarded_MultiItem = 5,
		HUD_ElectricShop = 6,
		BigMapUMG = 7,
		HUD_CustomizedNotice = 8,
		UI_Settings = 9,
		UI_OB_Root = 10,
		UI_OB_GlobalControl = 11,
		UI_OB_BigMap = 12,
		UI_OB_Settlement = 13,
		UI_OB_Settlement_InputMask = 14,
		UI_OB_HeadInfo = 15,
		UI_OB_ShortKeyboard = 16,
		UI_OpeningShow = 17,
		UI_Eliminate = 18,
		UI_Skill_Scan = 19,
		UI_HeroPick = 20,
		JobEffectDetailPanel = 21,
		UI_BuffEffectScreenPanel = 22,
		UI_TestCustomPanel = 23,
		Solarland_DevDebugUI_Widget = 24,
		UI_Highlight_Overview = 25,
		UI_BattleGround_End = 26,
		MAX = 27
	};

	/**
	 * Enum Solarland.EWidgetBackKeyType
	 */
	enum class EWidgetBackKeyType : uint8_t
	{
		Invalid = 0,
		FromKey = 1,
		FromClose = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWidgetLayerLevel
	 */
	enum class EWidgetLayerLevel : uint8_t
	{
		NormalWidget = 0,
		SameLevelCacheWidget = 1,
		SameLevelReplaceWidget = 2,
		CloseAllBackKeyWidget = 3,
		CloseAllBackKeyAndNormalWidget = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EWidgetScope
	 */
	enum class EWidgetScope : uint8_t
	{
		World = 0,
		Global = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ELayoutPreviewType
	 */
	enum class ELayoutPreviewType : uint8_t
	{
		Mobile = 0,
		Desktop = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EInputCapture
	 */
	enum class EInputCapture : uint8_t
	{
		EIC_None = 0,
		EIC_Start = 1,
		EIC_End = 2,
		EIC_Move = 3,
		EIC_Transient = 4,
		EIC_All = 5,
		EIC_MAX = 6
	};

	/**
	 * Enum Solarland.ESolarSupportLanguages
	 */
	enum class ESolarSupportLanguages : uint8_t
	{
		DefaultLanguage = 0,
		SimplifiedChinese = 1,
		TraditionalChinese = 2,
		Arabic = 3,
		German = 4,
		English = 5,
		Spanish = 6,
		French = 7,
		Hindi = 8,
		Indonesian = 9,
		Italian = 10,
		Japanese = 11,
		Korean = 12,
		Malay = 13,
		Polish = 14,
		Portuguese = 15,
		Russian = 16,
		Thai = 17,
		Turkish = 18,
		Vietnamese = 19,
		Tagalog = 20,
		PO = 21,
		OP = 22,
		MAX = 23
	};

	/**
	 * Enum Solarland.EImageURLDownloadState
	 */
	enum class EImageURLDownloadState : uint8_t
	{
		NotStarted = 0,
		Processing = 1,
		Success = 2,
		Failed = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ECustomGameModeTypeForUI
	 */
	enum class ECustomGameModeTypeForUI : uint8_t
	{
		Type_Default = 0,
		Type_Sabotage = 1,
		Type_MAX = 2
	};

	/**
	 * Enum Solarland.EShopWeaponUpgradeState
	 */
	enum class EShopWeaponUpgradeState : uint8_t
	{
		Upgrade_None = 0,
		Upgrade_Enable = 1,
		Upgrade_Max = 2,
		Upgrade_NotEnoughEnergy = 3
	};

	/**
	 * Enum Solarland.EActionWheelOperateType
	 */
	enum class EActionWheelOperateType : uint8_t
	{
		NeedClick = 0,
		AutoCommand = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EActionWheelCommandType
	 */
	enum class EActionWheelCommandType : uint8_t
	{
		None = 0,
		UseItem = 1,
		WorldMark = 2,
		UseSticker = 3,
		PlayAnimation = 4,
		PlaySound = 5,
		Max = 6
	};

	/**
	 * Enum Solarland.EActorMaterialChangeRebuildReason
	 */
	enum class EActorMaterialChangeRebuildReason : uint8_t
	{
		OriginalMeshChanged = 0,
		MeshAddedOrRemoved = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EMaterialChangeTextureOverrideMode
	 */
	enum class EMaterialChangeTextureOverrideMode : uint8_t
	{
		None = 0,
		OverrideAllTextures = 1,
		OverrideSpecifiedTextures = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EMaterialParameterTypeFlags
	 */
	enum class EMaterialParameterTypeFlags : uint8_t
	{
		None = 0,
		Scaler = 1,
		Vector = 2,
		Texture = 3,
		Font = 4,
		AllWithoutFont = 5,
		All = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EMaterialParameterType2
	 */
	enum class EMaterialParameterType2 : uint8_t
	{
		Scaler = 0,
		Vector = 1,
		Texture = 2,
		Font = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EMaterialChangeType
	 */
	enum class EMaterialChangeType : uint8_t
	{
		Normal = 0,
		MultiplePass = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EActorParticleEffectAttachOption
	 */
	enum class EActorParticleEffectAttachOption : uint8_t
	{
		None = 0,
		AttachToActor = 1,
		AttachToMesh = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EOperator
	 */
	enum class EOperator : uint8_t
	{
		IDLE = 0,
		ADD = 1,
		MINUS = 2,
		CANCEL = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EAirDropOpenState
	 */
	enum class EAirDropOpenState : uint8_t
	{
		Closed = 0,
		Opening = 1,
		Opened = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EAirDropMovementState
	 */
	enum class EAirDropMovementState : uint8_t
	{
		None = 0,
		Waiting = 1,
		FreeFalling = 2,
		UniformFalling = 3,
		DecelerateFalling = 4,
		Landing = 5,
		Landed = 6,
		Removed = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.EBulletTraceTargetType
	 */
	enum class EBulletTraceTargetType : uint8_t
	{
		None = 0,
		Character = 1,
		Vehicle = 2,
		SummonItem = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EBounceType
	 */
	enum class EBounceType : uint8_t
	{
		NONE = 0,
		ONCE = 1,
		STICK = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ETriggerType
	 */
	enum class ETriggerType : uint8_t
	{
		KEY_DOWN = 0,
		KEY_UP = 1,
		KEY_HOLD = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EHoldActionType
	 */
	enum class EHoldActionType : uint8_t
	{
		HT_Charge = 0,
		HT_Projectile = 1,
		HT_None = 2,
		HT_MAX = 3
	};

	/**
	 * Enum Solarland.EVirtualBulletType
	 */
	enum class EVirtualBulletType : uint8_t
	{
		LinearBullet = 0,
		CurveBullet = 1,
		GravityBullet = 2,
		TracingBullet = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ETrajectoryType
	 */
	enum class ETrajectoryType : uint8_t
	{
		LINE = 0,
		LINE_GRAVITY = 1,
		CURVE = 2,
		CANISTER = 3,
		BEAM = 4,
		Rocket = 5,
		VirtualBullet = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EWeaponSkillChargedState
	 */
	enum class EWeaponSkillChargedState : uint8_t
	{
		PREPARE = 0,
		START = 1,
		COMPLETECHARGE = 2,
		EXECUTE = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EFireMethodType
	 */
	enum class EFireMethodType : uint8_t
	{
		BULLET = 0,
		SKILL = 1,
		SUMMONBULLET = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ECostFireType
	 */
	enum class ECostFireType : uint8_t
	{
		DESCRETE = 0,
		CONTINUOUS = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EShootingSoundOpt
	 */
	enum class EShootingSoundOpt : uint8_t
	{
		EShootingSound_SINGLE_1P = 0,
		EShootingSound_SINGLE_3P = 1,
		EShootingSound_SINGLE_3P_ENEMY = 2,
		EShootingSound_AUTO_1P = 3,
		EShootingSound_AUTO_3P = 4,
		EShootingSound_AUTO_3P_ENEMY = 5,
		EShootingSound_BURST_1P = 6,
		EShootingSound_BURST_3P = 7,
		EShootingSound_BURST_3P_ENEMY = 8,
		EShootingSound_FIRE_LAST_1P = 9,
		EShootingSound_FIRE_LAST_3P = 10,
		EShootingSound_SKILL_CAST_1P = 11,
		EShootingSound_SKILL_CAST_3P = 12,
		EShootingSound_LAND_COMMON_HIT_3P = 13,
		EShootingSound_SKILL_FX_START_1P = 14,
		EShootingSound_SKILL_FX_START_3P = 15,
		EShootingSound_SHIELD_HIT_1P = 16,
		EShootingSound_SHIELD_HIT_3P = 17,
		EShootingSound_SHIELD_BROKEN_1P = 18,
		EShootingSound_SHIELD_BROKEN_3P = 19,
		EShootingSound_BODY_HIT_1P = 20,
		EShootingSound_BODY_HIT_3P = 21,
		EShootingSound_FIRE_OVERLOAD_1P = 22,
		EShootingSound_FIRE_OVERLOAD_3P = 23,
		EShootingSound_Fly_Loop = 24,
		EShootingSound_Fly_Once = 25,
		EShootingSound_Vehicle_Gun_On = 26,
		EShootingSound_Vehicle_Gun_Off = 27,
		EShootingSound_Smoke_Loop = 28,
		EShootingSound_B9A04Skill = 29,
		EShootingSound_Reload_1P = 30,
		EShootingSound_Reload_3P = 31,
		EShootingSound_Reload_1P01 = 32,
		EShootingSound_Reload_3P01 = 33,
		EShootingSound_Reload_1P02 = 34,
		EShootingSound_Reload_3P02 = 35,
		EShootingSound_Bolt_1P = 36,
		EShootingSound_Bolt_3P = 37,
		EShootingSound_MAX = 38
	};

	/**
	 * Enum Solarland.EShootingOpt
	 */
	enum class EShootingOpt : uint8_t
	{
		SINGLE = 0,
		AUTO = 1,
		BURST = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EFootEffectType
	 */
	enum class EFootEffectType : uint8_t
	{
		Effect_None = 0,
		Effect_Water = 1,
		Effect_MAX = 2
	};

	/**
	 * Enum Solarland.EAttributeSubBehavior
	 */
	enum class EAttributeSubBehavior : uint8_t
	{
		Apply = 0,
		Cancel = 1,
		Update = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EBackPackTransitionAnimState
	 */
	enum class EBackPackTransitionAnimState : uint8_t
	{
		TransitionAnimStateDefault = 0,
		SkyCharge2NoCharge_NoFly = 1,
		SkyCharge2NoEnergy_NoFly = 2,
		SkyCharge2NoCharge_Fly = 3,
		SkyCharge2NoEnergy_Fly = 4,
		SkyCharge2NoCharge_IntoFly = 5,
		SkyCharge2NoEnergy_IntoFly = 6,
		NoCharge2SkyCharge_NoFly = 7,
		NoEnergy2SkyCharge_NoFly = 8,
		NoCharge2SkyCharge_Fly = 9,
		NoEnergy2SkyCharge_Fly = 10,
		NoCharge2SkyCharge_OutFly = 11,
		NoEnergy2SkyCharge_OutFly = 12,
		PileCharge2NoCharge_NoFly = 13,
		PileCharge2NoEnergy_NoFly = 14,
		PileCharge2NoCharge_Fly = 15,
		PileCharge2NoEnergy_Fly = 16,
		PileCharge2NoCharge_IntoFly = 17,
		PileCharge2NoEnergy_IntoFly = 18,
		NoCharge2PileCharge_NoFly = 19,
		NoEnergy2PileCharge_NoFly = 20,
		NoCharge2PileCharge_Fly = 21,
		NoEnergy2PileCharge_Fly = 22,
		NoCharge2PileCharge_OutFly = 23,
		NoEnergy2PileCharge_OutFly = 24,
		BoxCharge2NoCharge_NoFly = 25,
		BoxCharge2NoEnergy_NoFly = 26,
		BoxCharge2NoCharge_Fly = 27,
		BoxCharge2NoEnergy_Fly = 28,
		BoxCharge2NoCharge_IntoFly = 29,
		BoxCharge2NoEnergy_IntoFly = 30,
		NoCharge2BoxCharge_NoFly = 31,
		NoEnergy2BoxCharge_NoFly = 32,
		NoCharge2BoxCharge_Fly = 33,
		NoEnergy2BoxCharge_Fly = 34,
		NoCharge2BoxCharge_OutFly = 35,
		NoEnergy2BoxCharge_OutFly = 36,
		NoCharge2NoEnergy_NoFly = 37,
		NoCharge2NoEnergy_IntoFly = 38,
		NoEnergy2NoCharge_NoFly = 39,
		NoEnergy2NoCharge_OutFly = 40,
		MAX = 41
	};

	/**
	 * Enum Solarland.EBackPackFixedAnimState
	 */
	enum class EBackPackFixedAnimState : uint8_t
	{
		FixedAnimStateDefault = 0,
		FixedSkyChargeNoFly = 1,
		FixedPileChargeNoFly = 2,
		FixedBoxChargeNoFly = 3,
		FixedNoChargeNoFly = 4,
		FixedNoEnergyNoFly = 5,
		FixedSkyChargeIsFly = 6,
		FixedPileChargeIsFly = 7,
		FixedBoxChargeIsFly = 8,
		FixedNoChargeIsFly = 9,
		FixedNoEnergyIsFly = 10,
		MAX = 11
	};

	/**
	 * Enum Solarland.EBackPackAnimSubType
	 */
	enum class EBackPackAnimSubType : uint8_t
	{
		SkyChargeNoFly = 0,
		PileChargeNoFly = 1,
		BoxChargeNoFly = 2,
		NoChargeNoFly = 3,
		NoEnergyNoFly = 4,
		SkyChargeIsFly = 5,
		PileChargeIsFly = 6,
		BoxChargeIsFly = 7,
		NoChargeIsFly = 8,
		NoEnergyIsFly = 9,
		Charge2NoCharge_NoFly = 10,
		Charge2NoEnergy_NoFly = 11,
		Charge2NoCharge_Fly = 12,
		Charge2NoEnergy_Fly = 13,
		Charge2NoCharge_IntoFly = 14,
		Charge2NoEnergy_IntoFly = 15,
		NoCharge2Charge_NoFly = 16,
		NoEnergy2Charge_NoFly = 17,
		NoCharge2Charge_Fly = 18,
		NoEnergy2Charge_Fly = 19,
		NoCharge2Charge_OutFly = 20,
		NoEnergy2Charge_OutFly = 21,
		NoCharge2NoEnergy_NoFly = 22,
		NoCharge2NoEnergy_IntoFly = 23,
		NoEnergy2NoCharge_NoFly = 24,
		NoEnergy2NoCharge_OutFly = 25,
		ETypeDefault = 26,
		MAX = 27
	};

	/**
	 * Enum Solarland.EBackPackAnimType
	 */
	enum class EBackPackAnimType : uint8_t
	{
		SkyCharge = 0,
		PileCharge = 1,
		BoxCharge = 2,
		NoCharge = 3,
		NoEnergy = 4,
		NoFly = 5,
		IsFly = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EProgressStatus
	 */
	enum class EProgressStatus : uint8_t
	{
		Min = 0,
		Max = 1,
		NoChange = 2,
		Increase = 3,
		Decrease = 4
	};

	/**
	 * Enum Solarland.EControlPointStatus
	 */
	enum class EControlPointStatus : uint8_t
	{
		None = 0,
		Neutral = 1,
		Owned = 2,
		Enemy = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EBattlegroundPlayerStartRegion
	 */
	enum class EBattlegroundPlayerStartRegion : uint8_t
	{
		Default = 0,
		Inner = 1,
		Outer = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EBattlegroundMapElementType
	 */
	enum class EBattlegroundMapElementType : uint8_t
	{
		None = 0,
		Home = 1,
		ControlPoint = 2,
		AirWall = 3,
		PlayerStart = 4,
		VehicleSpawner = 5,
		Custom = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EBattleRoyalTimeLineEnum
	 */
	enum class EBattleRoyalTimeLineEnum : uint8_t
	{
		None = 0,
		CreateBombingZone = 1,
		CreateAirdrop = 2,
		ModifyEnvironmentState = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EBattleUpgradeEffectCategory
	 */
	enum class EBattleUpgradeEffectCategory : uint8_t
	{
		None = 0,
		Attack = 1,
		Defence = 2,
		Speed = 3,
		Bag = 4,
		Cooldown = 5,
		PlaceHolder1 = 6,
		PlaceHolder2 = 7,
		PlaceHolder3 = 8,
		PlaceHolder4 = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.EBombingZoneState
	 */
	enum class EBombingZoneState : uint8_t
	{
		Waiting = 0,
		Firing = 1,
		Ending = 2,
		End = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EBotAttrOperator
	 */
	enum class EBotAttrOperator : uint8_t
	{
		Equal = 0,
		Greater = 1,
		Less = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EBotAttrValueType
	 */
	enum class EBotAttrValueType : uint8_t
	{
		Current = 0,
		Max = 1,
		Percent = 2
	};

	/**
	 * Enum Solarland.EBotAttrType
	 */
	enum class EBotAttrType : uint8_t
	{
		Health = 0,
		Shield = 1,
		Energy = 2,
		Difficulty = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EBotCheckCondition
	 */
	enum class EBotCheckCondition : uint8_t
	{
		AlwaysPass = 0,
		ReadyFight = 1,
		CanJetVertical = 2,
		CanJetHorizontal = 3,
		ReadyWeaponSkill = 4,
		IsIndependent = 5,
		NeedReloading = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EBotCheckAIServer
	 */
	enum class EBotCheckAIServer : uint8_t
	{
		AlwaysPass = 0,
		AIServerIsOnline = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EBotCheckNgaiMLAction
	 */
	enum class EBotCheckNgaiMLAction : uint8_t
	{
		AlwaysPass = 0,
		DoOnceFire = 1,
		DoJump = 2,
		DoJetVertical = 3,
		DoJetForward = 4,
		DoUseRoleSkillOne = 5,
		DoUseRoleSkillTwo = 6,
		DoContinueFire = 7,
		DoMoveTo = 8,
		DoUseMedicine = 9,
		DoUseShieldRecharger = 10,
		DoVehicleFire = 11,
		DoUseVehicleFirstSkill = 12,
		DoUseVehicleSecondSkill = 13,
		MAX = 14
	};

	/**
	 * Enum Solarland.EBotCheckState
	 */
	enum class EBotCheckState : uint8_t
	{
		None = 0,
		Falling = 1,
		Driving = 2,
		Passager = 3,
		Swiming = 4,
		Dying = 5,
		Dead = 6,
		WeaponReloading = 7,
		ShootAiming = 8,
		SiegeVehicleLocated = 9,
		BeingRescued = 10,
		Cruising = 11,
		Skydiving = 12,
		SkydivingInitially = 13,
		SkydivingAfterRebirth = 14,
		SkydivingByLauncher = 15,
		MAX = 16
	};

	/**
	 * Enum Solarland.EDistanceComparison
	 */
	enum class EDistanceComparison : uint8_t
	{
		Equal = 0,
		Greater = 1,
		Less = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESameScreenEffectHandleType
	 */
	enum class ESameScreenEffectHandleType : uint8_t
	{
		Ignore = 0,
		StopPrev = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EBuffEffectDurationType
	 */
	enum class EBuffEffectDurationType : uint8_t
	{
		Instant = 0,
		HasDuration = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ELevelLoadType
	 */
	enum class ELevelLoadType : uint8_t
	{
		ClientAntServer = 0,
		ClientOnly = 1,
		ServerOnly = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EVaultType
	 */
	enum class EVaultType : uint8_t
	{
		None = 0,
		Step = 1,
		Step_Cross = 2,
		Step_Sprint = 3,
		Step_Sprint_Cross = 4,
		Vault = 5,
		Vault_Cross = 6,
		Vault_Sprint = 7,
		Vault_Sprint_Cross = 8,
		Climb = 9,
		Climb_Cross = 10,
		Climb_Sprint = 11,
		Climb_Sprint_Cross = 12,
		Climb_Water = 13,
		HighClimb = 14,
		HighClimb_Cross = 15,
		HighClimb_Sprint = 16,
		HighClimb_Sprint_Cross = 17,
		WallRun = 18,
		WallRunFailed = 19,
		MAX = 20
	};

	/**
	 * Enum Solarland.EObstacleDetectorType
	 */
	enum class EObstacleDetectorType : uint8_t
	{
		Knee = 0,
		Waist = 1,
		Chest = 2,
		Overhead = 3,
		Nullifier = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EMatActionOnRemoved
	 */
	enum class EMatActionOnRemoved : uint8_t
	{
		None = 0,
		ResetToBeginValue = 1,
		ResetToEndValue = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EBuffEffectType
	 */
	enum class EBuffEffectType : uint8_t
	{
		Both = 0,
		ScreenEffect = 1,
		ActorEffect = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EActorEffectAffectedActorType
	 */
	enum class EActorEffectAffectedActorType : uint8_t
	{
		CharacterOnly = 0,
		All = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ECueContentVisibleTargetFlag
	 */
	enum class ECueContentVisibleTargetFlag : uint8_t
	{
		None = 0,
		Self = 1,
		Teammate = 2,
		Other = 3,
		Observer = 4,
		Anyone = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ECueContentPlayTiming
	 */
	enum class ECueContentPlayTiming : uint8_t
	{
		OnExecute = 0,
		OnActive = 1,
		WhileActive = 2,
		OnRemove = 3,
		OnCustomEvent = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EUseType
	 */
	enum class EUseType : uint8_t
	{
		NORMAL = 0,
		HANDSETTING = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EWeaponEquipSlot
	 */
	enum class EWeaponEquipSlot : uint8_t
	{
		None = 0,
		First = 1,
		Second = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ECrossHairState
	 */
	enum class ECrossHairState : uint8_t
	{
		None = 0,
		Normal = 1,
		Reload = 2,
		Overload = 3,
		Forbid = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESpreadType
	 */
	enum class ESpreadType : uint8_t
	{
		Absolute = 0,
		Relative = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ECrossHairSpecialFireState
	 */
	enum class ECrossHairSpecialFireState : uint8_t
	{
		PrepareFire = 0,
		ActivateFire = 1,
		KeepFiring = 2,
		EndFire = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ECurvedEffectControllerStopMode
	 */
	enum class ECurvedEffectControllerStopMode : uint8_t
	{
		KeepCurrentProgress = 0,
		SetProgressToBegin = 1,
		SetProgressToEnd = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EUsePlayerType
	 */
	enum class EUsePlayerType : uint8_t
	{
		Self = 0,
		Teammate = 1,
		Enemy = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EUseEmojiScene
	 */
	enum class EUseEmojiScene : uint8_t
	{
		None = 0,
		Lobby = 1,
		Battle = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EAnimationType
	 */
	enum class EAnimationType : uint8_t
	{
		Overload = 0,
		Overlay = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EWeaponInfiniteAmmoMode
	 */
	enum class EWeaponInfiniteAmmoMode : uint8_t
	{
		Default = 0,
		InfiniteClip = 1,
		InfinitePkg = 2,
		InfiniteBoth = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EJetAltitudeLimitationMode
	 */
	enum class EJetAltitudeLimitationMode : uint8_t
	{
		Default = 0,
		Home = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EWeaponVibrateFactor
	 */
	enum class EWeaponVibrateFactor : uint8_t
	{
		Off = 0,
		Low = 1,
		Middle = 2,
		High = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EWeaponVibrateType
	 */
	enum class EWeaponVibrateType : uint8_t
	{
		None = 0,
		Fire = 1,
		Reload_GetOld = 2,
		Reload_Restore = 3,
		Bolt = 4,
		Charge = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EGameplayVibrateIntensity
	 */
	enum class EGameplayVibrateIntensity : uint8_t
	{
		Off = 0,
		Low = 1,
		Middle = 2,
		High = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EGameplayVibrateCategory
	 */
	enum class EGameplayVibrateCategory : uint8_t
	{
		None = 0,
		SelfBeingHit = 1,
		SelfJetpackFlying = 2,
		SelfContinuousDamaged = 3,
		TriggerCharacterDown = 4,
		TriggerCharacterDie = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EVibrateDeviceType
	 */
	enum class EVibrateDeviceType : uint8_t
	{
		Nonsupport = 0,
		Mobile = 1,
		Gamepad = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESCMDataGatherType_Settle
	 */
	enum class ESCMDataGatherType_Settle : uint8_t
	{
		None = 0,
		Self = 1,
		Side = 2,
		All = 3,
		ESCMDataGatherType_MAX = 4
	};

	/**
	 * Enum Solarland.ESCMDataReplicateType
	 */
	enum class ESCMDataReplicateType : uint8_t
	{
		None = 0,
		RepOwner = 1,
		RepSide = 2,
		RepGlobal = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESCMRankCheckType
	 */
	enum class ESCMRankCheckType : uint8_t
	{
		New = 0,
		Change = 1,
		Delete = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESCMDataSetType
	 */
	enum class ESCMDataSetType : uint8_t
	{
		None = 0,
		Array = 1,
		Map = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EGaugeType
	 */
	enum class EGaugeType : uint8_t
	{
		None = 0,
		Degree = 1,
		Degree01 = 2,
		Degree02 = 3,
		DownUp = 4,
		LeftRight = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EAimOffsetAdjustType
	 */
	enum class EAimOffsetAdjustType : uint8_t
	{
		None = 0,
		AdjustPitch = 1,
		AdjustYaw = 2,
		AdjustBoth = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EPosture
	 */
	enum class EPosture : uint8_t
	{
		Stand = 0,
		Crouch = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EAimTraceOriginType
	 */
	enum class EAimTraceOriginType : uint8_t
	{
		Default = 0,
		Muzzle = 1,
		Camera = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EUIHeroPickListCellState
	 */
	enum class EUIHeroPickListCellState : uint8_t
	{
		Show = 0,
		Lock = 1,
		Forbidden = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EHeroOwnedType
	 */
	enum class EHeroOwnedType : uint8_t
	{
		Own = 0,
		OwnForNow = 1,
		NotOwn = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EHeroPickType
	 */
	enum class EHeroPickType : uint8_t
	{
		AllSidePlayer = 0,
		SpecificPlayer = 1,
		AllPlayer = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EUIHeroPickPlayerState
	 */
	enum class EUIHeroPickPlayerState : uint8_t
	{
		Waiting = 0,
		Selecting = 1,
		Confirm = 2,
		Done = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EHomeJetPackflag
	 */
	enum class EHomeJetPackflag : uint8_t
	{
		NONE = 0,
		Horizontal = 1,
		Vertical = 2,
		Stop = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESkillStateType
	 */
	enum class ESkillStateType : uint8_t
	{
		Normal = 0,
		CD = 1,
		NoneSkill = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EKeyMappingStatus
	 */
	enum class EKeyMappingStatus : uint8_t
	{
		EMPTY = 0,
		BASE = 1,
		OTHER = 2,
		OTHERANDBASE = 3,
		INVALID = 4,
		DONE = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EKillNoticeType
	 */
	enum class EKillNoticeType : uint8_t
	{
		BeKillLeader = 0,
		ShutDownKillLeader = 1,
		Revenge = 2,
		ShutDown = 3,
		CumulativeKill = 4,
		Down = 5,
		ClearTeam = 6,
		KillDefender = 7,
		SelfKillNotify = 8,
		KillLeaderChange = 9,
		KillLeaderShutDown = 10,
		GlobalKillNotify = 11,
		MAX = 12
	};

	/**
	 * Enum Solarland.EMapCellSelectionAccess
	 */
	enum class EMapCellSelectionAccess : uint8_t
	{
		Can = 0,
		Cannot = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EMassInvState
	 */
	enum class EMassInvState : uint8_t
	{
		Begin = 0,
		Prepare = 1,
		Normal = 2,
		Sprint = 3,
		End = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EMapState
	 */
	enum class EMapState : uint8_t
	{
		Idle = 0,
		FOVScale = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EMapFOVParamType
	 */
	enum class EMapFOVParamType : uint8_t
	{
		VehicleSpeed = 0,
		PoisonCircle = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EMapFOVState
	 */
	enum class EMapFOVState : uint8_t
	{
		Default = 0,
		Fov1 = 1,
		Fov2 = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EAirdropStatus
	 */
	enum class EAirdropStatus : uint8_t
	{
		Default = 0,
		Coming = 1,
		Available = 2,
		Opening = 3,
		Opened = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EMeshWidgetDisplayType
	 */
	enum class EMeshWidgetDisplayType : uint8_t
	{
		Icon = 0,
		Flash = 1,
		Diffuse = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EMissileSwarmDebugFlag
	 */
	enum class EMissileSwarmDebugFlag : uint8_t
	{
		Aim = 0,
		Trail = 1,
		Trace = 2,
		Explode = 3,
		Mesh = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EMeshProgressType
	 */
	enum class EMeshProgressType : uint8_t
	{
		Normal = 0,
		Damage = 1,
		Background = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.E_Type_OB_Scoreboard
	 */
	enum class E_Type_OB_Scoreboard : uint8_t
	{
		OB_Settlement = 0,
		OB_InGame = 1,
		Lobby_League_Settlement = 2,
		Lobby_CreateRoom_Settlement = 3,
		E_Type_OB_MAX = 4
	};

	/**
	 * Enum Solarland.EOBPithyPlayerState
	 */
	enum class EOBPithyPlayerState : uint8_t
	{
		Alive = 0,
		Dying = 1,
		Dead = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EOBTeamListTab
	 */
	enum class EOBTeamListTab : uint8_t
	{
		Pithy = 0,
		All = 1,
		Nearby = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ERoleWidgetStatus
	 */
	enum class ERoleWidgetStatus : uint8_t
	{
		Normal = 0,
		WaitTriggerAgain = 1,
		Disable = 2,
		InCD = 3,
		Forbidden = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ERoleWidgetType
	 */
	enum class ERoleWidgetType : uint8_t
	{
		Super = 0,
		Tactical = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESCMMapElementVisibilityType
	 */
	enum class ESCMMapElementVisibilityType : uint8_t
	{
		Visible = 0,
		Hidden = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESCMMapElementStateType
	 */
	enum class ESCMMapElementStateType : uint8_t
	{
		Normal = 0,
		Suspend = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESCMMapElementType
	 */
	enum class ESCMMapElementType : uint8_t
	{
		PlayerStart = 0,
		ItemSpawner = 1,
		AirDrop = 2,
		ChargingPile = 3,
		JumpPad = 4,
		CarPad = 5,
		Vehicle = 6,
		Poison = 7,
		Custom = 8,
		MAX = 9
	};

	/**
	 * Enum Solarland.EMatchType
	 */
	enum class EMatchType : uint8_t
	{
		NONE = 0,
		Team = 1,
		AverageSide = 2,
		SingleSide = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EPlayerResurrectType
	 */
	enum class EPlayerResurrectType : uint8_t
	{
		NONE = 0,
		SelfResurrectionCoin = 1,
		RequestTeamResurrect = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EPlayerPawnType
	 */
	enum class EPlayerPawnType : uint8_t
	{
		NONE = 0,
		Character = 1,
		Vehicle = 2,
		Other = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESCMGameSceneType
	 */
	enum class ESCMGameSceneType : uint8_t
	{
		None = 0,
		InBattle = 1,
		Settlement = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EDownloadState
	 */
	enum class EDownloadState : uint8_t
	{
		None = 0,
		Downloading = 1,
		Successful = 2,
		Failed = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EShieldUpgradeItemShopOpenState
	 */
	enum class EShieldUpgradeItemShopOpenState : uint8_t
	{
		Closed = 0,
		Opening = 1,
		Open = 2,
		Closing = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarWeaponBrand
	 */
	enum class ESolarWeaponBrand : uint8_t
	{
		WeaponBrand_None = 0,
		WeaponBrand_9A = 1,
		WeaponBrand_Wasteland = 2,
		WeaponBrand_Murphy = 3,
		WeaponBrand_Prism = 4,
		WeaponBrand_MAX = 5
	};

	/**
	 * Enum Solarland.ERoleAbilityVoiceTriggerTiming
	 */
	enum class ERoleAbilityVoiceTriggerTiming : uint8_t
	{
		None = 0,
		Active = 1,
		Commit = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarAbilityInstanceType
	 */
	enum class ESolarAbilityInstanceType : uint8_t
	{
		Multiple = 0,
		SingleReplace = 1,
		SingleYield = 2,
		Max = 3
	};

	/**
	 * Enum Solarland.ESolarAttributeDurationType
	 */
	enum class ESolarAttributeDurationType : uint8_t
	{
		Instant = 0,
		HasDuration = 1,
		Infinite = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarAttributeValueSourceType
	 */
	enum class ESolarAttributeValueSourceType : uint8_t
	{
		Value = 0,
		FromConfig = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EAchievementCondition
	 */
	enum class EAchievementCondition : uint8_t
	{
		None = 0,
		AchTSubAchievement = 1,
		AchTMinuteKill = 2,
		AchTUseVehicle = 3,
		AchTHPKill = 4,
		AchTLimitWin = 5,
		AchTDyingWin = 6,
		AchTAssistWin = 7,
		AchTRescue = 8,
		AchTLevel = 9,
		AchTSkyKill = 10,
		AchTOnlyLiveWin = 11,
		AchTFirstKill = 12,
		AchTBlindSniper = 13,
		AchTFriendNum = 14,
		AchTOpenBoxNum = 15,
		AchTenemyVehicle = 16,
		AchTDie = 17,
		AchTMarsWin = 18,
		AchTFistKill = 19,
		AchTAirUmbrella = 20,
		AchTAirTrapeze = 21,
		AchTAirSpeed = 22,
		AchTBubbleKill = 23,
		AchTCharacterNum = 24,
		AchAdvancedWeapon = 25,
		AchTBombingDie = 26,
		AchTRevengeKill = 27,
		MAX = 28
	};

	/**
	 * Enum Solarland.EAchievementReportType
	 */
	enum class EAchievementReportType : uint8_t
	{
		None = 0,
		SingleBattlle = 1,
		MultiBattle = 2,
		NoBattle = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESigninItemState
	 */
	enum class ESigninItemState : uint8_t
	{
		Got = 0,
		UnGot = 1,
		No = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWidgetOverrideParamType
	 */
	enum class EWidgetOverrideParamType : uint8_t
	{
		None = 0,
		Text = 1,
		Image = 2,
		Custom = 3,
		GameplayTag = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EWidgetLoadType
	 */
	enum class EWidgetLoadType : uint8_t
	{
		Start = 0,
		Delay = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EProgressBoardChannelState
	 */
	enum class EProgressBoardChannelState : uint8_t
	{
		None = 0,
		Add = 1,
		Minus = 2,
		HoldOn = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarAIValueCompareOp
	 */
	enum class ESolarAIValueCompareOp : uint8_t
	{
		Equal = 0,
		Greater = 1,
		Less = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarAudioDetailCatalog
	 */
	enum class ESolarAudioDetailCatalog : uint8_t
	{
		SADC_Common = 0,
		SADC_Music = 1,
		SADC_UI = 2,
		SADC_Gun = 3,
		SADC_Vehicle = 4,
		SADC_Object = 5,
		SADC_Character = 6,
		SADC_Voice = 7,
		SADC_VoiceEx = 8,
		SADC_MAX = 9
	};

	/**
	 * Enum Solarland.ESolarAudioDetailUnloadMode
	 */
	enum class ESolarAudioDetailUnloadMode : uint8_t
	{
		SADU_NeverUnload = 0,
		SADU_SwitchLevel = 1,
		SADU_Manual = 2,
		SADU_EnterOtherScene = 3,
		SADU_LeaveLobby = 4,
		SADU_LeaveTutorial = 5,
		SADU_LeaveHome = 6,
		SADU_LeaveWaiting = 7,
		SADU_LeaveGame = 8,
		SADU_DontCare = 9,
		SADU_MAX = 10
	};

	/**
	 * Enum Solarland.ESolarAudioDetailLoadMode
	 */
	enum class ESolarAudioDetailLoadMode : uint8_t
	{
		SADL_BeginPlay = 0,
		SADL_OnDemand = 1,
		SADL_Manual = 2,
		SADL_EnterBindScene = 3,
		SADL_EnterLobby = 4,
		SADL_EnterTutorial = 5,
		SADL_EnterHome = 6,
		SADL_EnterWaiting = 7,
		SADL_EnterGame = 8,
		SADL_NeverLoad = 9,
		SADL_MAX = 10
	};

	/**
	 * Enum Solarland.EBankLoadState
	 */
	enum class EBankLoadState : uint8_t
	{
		NotLoaded = 0,
		Loaded = 1,
		AsyncLoading = 2,
		AsyncUnloading = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EAnimBlendDirection
	 */
	enum class EAnimBlendDirection : uint8_t
	{
		Idle = 0,
		Forward = 1,
		Back = 2,
		Right = 3,
		Left = 4,
		Max = 5
	};

	/**
	 * Enum Solarland.EInVehicleState
	 */
	enum class EInVehicleState : uint8_t
	{
		None = 0,
		Driving = 1,
		Riding = 2,
		StickingOut = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ECruiseAnimState
	 */
	enum class ECruiseAnimState : uint8_t
	{
		None = 0,
		Looping = 1,
		Leaving = 2,
		End = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ECharacterMontage
	 */
	enum class ECharacterMontage : uint8_t
	{
		Invalid = 0,
		Bolt = 1,
		Equip = 2,
		PreFire = 3,
		Rechamber = 4,
		Fire1 = 5,
		Reload = 6,
		ReloadWithBolt = 7,
		Max = 8
	};

	/**
	 * Enum Solarland.EVehicleAnimationType
	 */
	enum class EVehicleAnimationType : uint8_t
	{
		None = 0,
		Suv = 1,
		Sports = 2,
		MotorBike = 3,
		Hover = 4,
		Legged = 5,
		IronMan = 6,
		Backpacker = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.EDriveTurnType
	 */
	enum class EDriveTurnType : uint8_t
	{
		Idle = 0,
		Left = 1,
		Right = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWeaponStatus
	 */
	enum class EWeaponStatus : uint8_t
	{
		NoWeapon = 0,
		Peace = 1,
		Aiming = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EAnoAntiDataType
	 */
	enum class EAnoAntiDataType : uint8_t
	{
		Unknown = 0,
		SecAntiDataFlow = 1,
		SecAttackFlow = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EMeerkatSubComponentType
	 */
	enum class EMeerkatSubComponentType : uint8_t
	{
		MB = 0,
		Hp = 1,
		AE = 2,
		AR = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EMeerkatGameDispatchEvents
	 */
	enum class EMeerkatGameDispatchEvents : uint8_t
	{
		ServerFire = 0,
		ServerHit = 1,
		ServerKill = 2,
		ServerKilled = 3,
		ClientFire = 4,
		ClientHit = 5,
		ClientKill = 6,
		ClientKilled = 7,
		ClientHitDown = 8,
		ClientBeHitDown = 9,
		ClientTick = 10,
		ServerTick = 11,
		ClientBeginPlay = 12,
		ServerBeginPlay = 13,
		ClientEndPlay = 14,
		ServerEndPlay = 15,
		EventMax = 16,
		MAX = 17
	};

	/**
	 * Enum Solarland.EItemLoadPriority
	 */
	enum class EItemLoadPriority : uint8_t
	{
		DEFAULT = 0,
		ITEM_MIN = 1,
		ITEM_MAX = 2,
		WEAPON_MIN = 3,
		WEAPON_MAX = 4,
		VEHICLE_MIN = 5,
		VEHICLE_MAX = 6,
		CHARACTER_MIN = 7,
		CHARACTER_MAX = 8,
		CLASS_PRIORITY = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.EAutoSaveType
	 */
	enum class EAutoSaveType : uint8_t
	{
		Weapon = 0,
		ItemActor = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarBotMemberState
	 */
	enum class ESolarBotMemberState : uint8_t
	{
		None = 0,
		Leader = 1,
		OnCall = 2,
		Separate = 3,
		Leaving = 4,
		Invalid = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EBotTeleportReason
	 */
	enum class EBotTeleportReason : uint8_t
	{
		Unknown = 0,
		SolveBlock = 1,
		SolveOffMesh = 2,
		BTTask = 3,
		PreservePop = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarAITagStateTimeType
	 */
	enum class ESolarAITagStateTimeType : uint8_t
	{
		DurationInCurrentState = 0,
		TimeSinceLastExitToState = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EBotInteractCondition
	 */
	enum class EBotInteractCondition : uint8_t
	{
		Invalid = 0,
		NeedToResponsePoison = 1,
		FoundEnemyActor = 2,
		TeammateKillEnemy = 3,
		WeAreTheChampion = 4,
		TeammateMarkTargetLocation = 5,
		TeammateMarkTargetDangerPoint = 6,
		TeammateMarkTargetItem = 7,
		TeammateMarkTargetFootstep = 8,
		TeammateMarkFollowHe = 9,
		TeammateMarkGetOnVehicle = 10,
		TeammateMarkNeedVehicle = 11,
		TeammateMarkNeedWeapon = 12,
		TeammateMarkNeedHelp = 13,
		TeammateMarkAttack = 14,
		TeammateMarkDefend = 15,
		MockEnemy = 16,
		MockDyingEnemy = 17,
		EnterDying = 18,
		BoringEnough = 19,
		MAX = 20
	};

	/**
	 * Enum Solarland.EBotFocusType
	 */
	enum class EBotFocusType : uint8_t
	{
		FocusToNothing = 0,
		FocusToActor = 1,
		FocusToPoint = 2,
		FocusToDirection = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ENgaiMLType
	 */
	enum class ENgaiMLType : uint8_t
	{
		None = 0,
		OnlyImitationLearning = 1,
		OnlyReinforcementLearning = 2,
		Both = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EBotAIType
	 */
	enum class EBotAIType : uint8_t
	{
		BehaviorTree = 0,
		ImitationLearning = 1,
		ReinforcementLearning = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EPopLocationType
	 */
	enum class EPopLocationType : uint8_t
	{
		Default = 0,
		ShowFight = 1,
		Guarantee = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarBotTimelineTriggerAction
	 */
	enum class ESolarBotTimelineTriggerAction : uint8_t
	{
		None = 0,
		Add = 1,
		Remove = 2,
		Clear = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarBotTimelineFilterParameterType
	 */
	enum class ESolarBotTimelineFilterParameterType : uint8_t
	{
		None = 0,
		MoreThan = 1,
		LessThan = 2,
		Equal = 3,
		NotEqual = 4,
		Contain = 5,
		NotContain = 6,
		Radius = 7,
		Target = 8,
		MAX = 9
	};

	/**
	 * Enum Solarland.ESolarBotTimelineFilterType
	 */
	enum class ESolarBotTimelineFilterType : uint8_t
	{
		None = 0,
		RankPoint = 1,
		Equipment = 2,
		Disengagement = 3,
		KillNum = 4,
		DamageNum = 5,
		ItemNum = 6,
		SkillCoolingDown = 7,
		SurroundingTeammate = 8,
		SurroundingEnemy = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.ESolarBotTimelineAIDataSettingType
	 */
	enum class ESolarBotTimelineAIDataSettingType : uint8_t
	{
		None = 0,
		Health = 1,
		Shield = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarBotTimelineWeaponPartType
	 */
	enum class ESolarBotTimelineWeaponPartType : uint8_t
	{
		None = 0,
		Muzzle = 1,
		Grip = 2,
		Clip = 3,
		Scope = 4,
		GunStock = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ESolarBotTimelineEquipmentSettingType
	 */
	enum class ESolarBotTimelineEquipmentSettingType : uint8_t
	{
		None = 0,
		PrimaryWeapon = 1,
		SecondaryWeapon = 2,
		Shield = 3,
		VerticalJet = 4,
		HorizontalJet = 5,
		SummonGun = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.ESolarBotTimelineTriggerType
	 */
	enum class ESolarBotTimelineTriggerType : uint8_t
	{
		None = 0,
		Timeline = 1,
		Guarantee = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarBotWarmSystemType
	 */
	enum class ESolarBotWarmSystemType : uint8_t
	{
		Regular = 0,
		Script = 1,
		Unknown = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EBotShotTargetCtlType
	 */
	enum class EBotShotTargetCtlType : uint8_t
	{
		Player = 0,
		Bot = 1,
		Any = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EBotShotTargetType
	 */
	enum class EBotShotTargetType : uint8_t
	{
		Character = 0,
		Vehicle = 1,
		SummonItem = 2,
		Any = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EBotOnVehicleFireType
	 */
	enum class EBotOnVehicleFireType : uint8_t
	{
		None = 0,
		FireOn = 1,
		FireOnDelayOff = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EBotOnVehicleStopType
	 */
	enum class EBotOnVehicleStopType : uint8_t
	{
		None = 0,
		Delay = 1,
		Stop = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EBotFirePolicy
	 */
	enum class EBotFirePolicy : uint8_t
	{
		AlwaysFire = 0,
		FirstRoughMoveDone = 1,
		FirstPreciseMoveDone = 2,
		PreciseMoveOrGreater = 3,
		FollowMoveOrGreater = 4,
		OnlyWhenHitSimulatedTarget = 5,
		OnlyWhenHitLockedTarget = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EBotActionState
	 */
	enum class EBotActionState : uint8_t
	{
		Sprite = 0,
		Crouch = 1,
		GunAim = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EBotBunkerType
	 */
	enum class EBotBunkerType : uint8_t
	{
		Invalid = 0,
		FullSize = 1,
		HalfSize = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EBotTeamVehicleDrivePolicy
	 */
	enum class EBotTeamVehicleDrivePolicy : uint8_t
	{
		DirectlyMove = 0,
		HoldAndWaitPassenger = 1,
		MoveAndTakePassenger = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EPoisonResponseType
	 */
	enum class EPoisonResponseType : uint8_t
	{
		NoResponse = 0,
		LowPriority = 1,
		HighPriority = 2,
		Immediately = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarTaskScoringItemType
	 */
	enum class ESolarTaskScoringItemType : uint8_t
	{
		None = 0,
		CurrentHP = 1,
		IfSelfInBattle = 2,
		IfSelfInSafeArea = 3,
		IfSelfInPoisonCircle = 4,
		TimeToEnterSafeArea = 5,
		TimeToEnterPoisonCircleXPoisonDamage = 6,
		IfRelativeActorInSafeArea = 7,
		IfRelativeActorInPoisonCircle = 8,
		IfRescueTargetIsPlayer = 9,
		TimeToMovetoRescueTarget = 10,
		DistanceFromRescueTargetToSafeArea = 11,
		DistanceFromRescueTargetToPoisonCircleXPoisonDamage = 12,
		IfRescuingThisTarget = 13,
		IfRescuingOtherTarget = 14,
		TimePoisonToRescueTarget = 15,
		CurrentPoisonDamage = 16,
		MAX = 17
	};

	/**
	 * Enum Solarland.ESolarTeamTaskType
	 */
	enum class ESolarTeamTaskType : uint8_t
	{
		RescueTeammate = 0,
		MAX = 1
	};

	/**
	 * Enum Solarland.EJetTaskFinishMode
	 */
	enum class EJetTaskFinishMode : uint8_t
	{
		AfterResponded = 0,
		AfterDone = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EJetPackMode
	 */
	enum class EJetPackMode : uint8_t
	{
		Horizontal = 0,
		Vertical = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EJumpTaskFinishMode
	 */
	enum class EJumpTaskFinishMode : uint8_t
	{
		AfterResponded = 0,
		AfterApex = 1,
		AfterDone = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EBotShootTargetType
	 */
	enum class EBotShootTargetType : uint8_t
	{
		Player = 0,
		Bot = 1,
		Vehicle = 2,
		Monster = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ECameraShakeDurationType
	 */
	enum class ECameraShakeDurationType : uint8_t
	{
		Fixed = 0,
		Infinite = 1,
		Custom = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ECameraShakeUpdateResultFlags
	 */
	enum class ECameraShakeUpdateResultFlags : uint8_t
	{
		ApplyAsAbsolute = 0,
		SkipAutoScale = 1,
		SkipAutoPlaySpace = 2,
		Default = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ECameraShakePlaySpace
	 */
	enum class ECameraShakePlaySpace : uint8_t
	{
		CameraLocal = 0,
		World = 1,
		UserDefined = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ECruiseStatePrivate
	 */
	enum class ECruiseStatePrivate : uint8_t
	{
		None = 0,
		Start = 1,
		CanParachute = 2,
		ForceParachute = 3,
		End = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ERoleAbilityCancelPhase
	 */
	enum class ERoleAbilityCancelPhase : uint8_t
	{
		None = 0,
		Pressing = 1,
		Continuous = 2,
		All = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.CharacterRoleAbilityEnum
	 */
	enum class ECharacterRoleAbilityEnum : uint8_t
	{
		CharacterRoleAbilityEnumSuper = 0,
		CharacterRoleAbilityEnumTactical = 1,
		CharacterRoleAbilityEnumCount = 2,
		CharacterRoleAbilityEnumCharacterRoleAbilityEnum_MAX = 3
	};

	/**
	 * Enum Solarland.EMovementComponentEnableType
	 */
	enum class EMovementComponentEnableType : uint8_t
	{
		Default = 0,
		Dying = 1,
		OnLevelStreaming = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EHitTraceType
	 */
	enum class EHitTraceType : uint8_t
	{
		None = 0,
		Sniper = 1,
		Default = 2,
		Bump = 3,
		Vehicle = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EAntiCheatGameEvents
	 */
	enum class EAntiCheatGameEvents : uint8_t
	{
		ServerFire = 0,
		ServerHit = 1,
		ServerKill = 2,
		ServerKilled = 3,
		ClientFire = 4,
		ClientHit = 5,
		ClientKill = 6,
		ClientKilled = 7,
		ClientHitDown = 8,
		ClientBeHitDown = 9,
		ClientTick = 10,
		ServerTick = 11,
		ClientBeginPlay = 12,
		ServerBeginPlay = 13,
		ClientEndPlay = 14,
		ServerEndPlay = 15,
		EventMax = 16,
		MAX = 17
	};

	/**
	 * Enum Solarland.EClipAttachType
	 */
	enum class EClipAttachType : uint8_t
	{
		Weapon = 0,
		CharacterLeftHand = 1,
		CharacterRightHand = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EAnimReloadNotifyType
	 */
	enum class EAnimReloadNotifyType : uint8_t
	{
		InHand = 0,
		InHandAndDrop = 1,
		GetOld = 2,
		InPocket = 3,
		Restore = 4,
		SpawnFakeOldClip = 5,
		PhysicsDropOldClip = 6,
		SpawnFakeNewClip = 7,
		RestoreClip = 8,
		MAX = 9
	};

	/**
	 * Enum Solarland.EWeaponSystemState
	 */
	enum class EWeaponSystemState : uint8_t
	{
		None = 0,
		PreReload = 1,
		PreOpenScope = 2,
		PreCloseScope = 3,
		PreFire = 4,
		PreSwitchWeapon = 5,
		PreDropCurrentWeapon = 6,
		PreFireOverload = 7,
		PreNeedBolt = 8,
		PreCharging = 9,
		PreReplaceWeapon = 10,
		PrePickupWeapon = 11,
		PreSwapWeapon = 12,
		Max = 13
	};

	/**
	 * Enum Solarland.ECamShakeType
	 */
	enum class ECamShakeType : uint8_t
	{
		Default = 0,
		JumpBegin = 1,
		JumpEndLight = 2,
		JumpEndHeavy = 3,
		FullBodyMeleeWithTarget = 4,
		FullBodyMeleeWithoutTarget = 5,
		TacticalDodgeForward = 6,
		TacticalDodgeBackward = 7,
		TacticalDodgeLeft = 8,
		TacticalDodgeRight = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.EGunsightCameraSwitchMode
	 */
	enum class EGunsightCameraSwitchMode : uint8_t
	{
		CloseScope = 0,
		CloseShoulderShot = 1,
		OpenShoulderShot = 2,
		OpenScope = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarCameraSmoothType
	 */
	enum class ESolarCameraSmoothType : uint8_t
	{
		Default = 0,
		Instant = 1,
		Constant = 2,
		EaseOut = 3,
		EaseInEaseOut = 4,
		FloatCurve = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EReconnectionStatus
	 */
	enum class EReconnectionStatus : uint8_t
	{
		None = 0,
		Reconnecting = 1,
		Reconnected = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EAnimDirection
	 */
	enum class EAnimDirection : uint8_t
	{
		AnimNone = 0,
		AnimForward = 1,
		AnimBackward = 2,
		AnimLeft = 3,
		AnimRight = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESkydiveEffectLifetime
	 */
	enum class ESkydiveEffectLifetime : uint8_t
	{
		DuringFlying = 0,
		DuringLanding = 1,
		DuringWholeSkydiving = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.RoleAbilityCommitPhase
	 */
	enum class ERoleAbilityCommitPhase : uint8_t
	{
		RoleAbilityCommitPhaseOnActive = 0,
		RoleAbilityCommitPhaseCustom = 1,
		RoleAbilityCommitPhaseRoleAbilityCommitPhase_MAX = 2
	};

	/**
	 * Enum Solarland.EUpdateWarmServiceEventType
	 */
	enum class EUpdateWarmServiceEventType : uint8_t
	{
		None = 0,
		CharacterUpgrade = 1,
		WeaponUpgrade = 2,
		ShieldUpgrade = 3,
		SuperAbilityReady = 4,
		TacticalAbilityReady = 5,
		BattleStation = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EMassInVisibilityWarningType
	 */
	enum class EMassInVisibilityWarningType : uint8_t
	{
		None = 0,
		Character = 1,
		Vehicle = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EHitRecoverType
	 */
	enum class EHitRecoverType : uint8_t
	{
		EHRT_Normal = 0,
		EHRT_DeathVerge = 1,
		EHRT_MAX = 2
	};

	/**
	 * Enum Solarland.EBResurrectionState
	 */
	enum class EBResurrectionState : uint8_t
	{
		NoneState = 0,
		WaitForApply = 1,
		NotApply = 2,
		Resurrected = 3,
		WaitForResurrect = 4,
		GiveUp = 5,
		Timeout = 6,
		AllTeammatesDied = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.EDroppedItemType
	 */
	enum class EDroppedItemType : uint8_t
	{
		Weapons = 0,
		WeaponParts = 1,
		Consumables = 2,
		Equipments = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EBagScopeSlotType
	 */
	enum class EBagScopeSlotType : uint8_t
	{
		None = 0,
		Primary = 1,
		Second = 2,
		Bag = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EBagGridType
	 */
	enum class EBagGridType : uint8_t
	{
		None = 0,
		Pick = 1,
		Normal = 2,
		Lock = 3,
		Fix = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ETreatmentSoundType
	 */
	enum class ETreatmentSoundType : uint8_t
	{
		Healing = 0,
		Cancel = 1,
		StopHealing = 2,
		Completed = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EShieldAutoRechargeStopReason
	 */
	enum class EShieldAutoRechargeStopReason : uint8_t
	{
		SwitchShield = 0,
		OnWeaponFire = 1,
		OnHit = 2,
		Die = 3,
		ShieldFull = 4,
		ManualRecharge = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ECharacterStateForWeapon
	 */
	enum class ECharacterStateForWeapon : uint8_t
	{
		Unknown = 0,
		Standing = 1,
		Crouching = 2,
		Running = 3,
		Sprinting = 4,
		Jumping = 5,
		Flying = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EPoseMode
	 */
	enum class EPoseMode : uint8_t
	{
		Stand = 0,
		Crouch = 1,
		Crawl = 2,
		Skydive = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EPickUpTargetType
	 */
	enum class EPickUpTargetType : uint8_t
	{
		Invalid = 0,
		Item = 1,
		Weapon = 2,
		TreasureItem = 3,
		HomeItem = 4,
		BoxHomeItem = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ESolarExpBehaviorType
	 */
	enum class ESolarExpBehaviorType : uint8_t
	{
		SurvivalTime = 0,
		Kills = 1,
		Assists = 2,
		Selfhealing = 3,
		TeammateHealing = 4,
		Unpacking = 5,
		CollectElectricity = 6,
		PickExpPack = 7,
		EveryDamageDealt = 8,
		MAX = 9
	};

	/**
	 * Enum Solarland.ESolarCheckButtonSelectType
	 */
	enum class ESolarCheckButtonSelectType : uint8_t
	{
		None = 0,
		Next = 1,
		Prev = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EClassLevelUpRewardType
	 */
	enum class EClassLevelUpRewardType : uint8_t
	{
		BattleUpgradeEffect = 0,
		UpgradeSkill1 = 1,
		UpgradeSkill2 = 2,
		ClassCommonPassiveSkill = 3,
		ClassSpecificPassiveSkill = 4,
		Max = 5
	};

	/**
	 * Enum Solarland.EClassType
	 */
	enum class EClassType : uint8_t
	{
		None = 0,
		Assault = 1,
		Defence = 2,
		Support = 3,
		Scout = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarCrosshairType
	 */
	enum class ESolarCrosshairType : uint8_t
	{
		Weapon = 0,
		Feedback = 1,
		BulletContainer = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarDamageTextType
	 */
	enum class ESolarDamageTextType : uint8_t
	{
		DamageTextType_None = 0,
		DamageTextType_Common = 1,
		DamageTextType_Headshot = 2,
		DamageTextType_HitShield = 3,
		DamageTextType_HeadshotWithShield = 4,
		DamageTextType_HitVehicle = 5,
		DamageTextType_HitVehicleWeak = 6,
		DamageTextType_BrokenShiled = 7,
		DamageTextType_BrokenShieldWithHeadShot = 8,
		DamageTextType_HitSummonItem = 9,
		DamageTextType_MAX = 10
	};

	/**
	 * Enum Solarland.EUIDragSourceType
	 */
	enum class EUIDragSourceType : uint8_t
	{
		Default = 0,
		Weapon1 = 1,
		Weapon2 = 2,
		Weapon3 = 3,
		PickupList = 4,
		BackpackConsumable = 5,
		BackpackEquip = 6,
		BackpackPickupList = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.EShopStatisticType
	 */
	enum class EShopStatisticType : uint8_t
	{
		OnActivated = 0,
		OnUpgradeWeapon = 1,
		OnPurchaseItem = 2,
		OnItemRefresh = 3,
		OnUpgradeShield = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EShopModelAnimType
	 */
	enum class EShopModelAnimType : uint8_t
	{
		Idle = 0,
		Upgrade = 1,
		Purchase = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.AIVehicleState
	 */
	enum class EAIVehicleState : uint8_t
	{
		AIVehicleState_Forward = 0,
		AIVehicleState_ReverseSolveBlock = 1,
		AIVehicleState_SolveBlockFoward = 2,
		AIVehicleState_ReverseToTarget = 3,
		AIVehicleState_MAX = 4
	};

	/**
	 * Enum Solarland.EAntiCheatReportType
	 */
	enum class EAntiCheatReportType : uint8_t
	{
		Player = 0,
		Weapon = 1,
		Vehicle = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EActiveEffectDurationChangeProxy
	 */
	enum class EActiveEffectDurationChangeProxy : uint8_t
	{
		MaintainCurrent = 0,
		MaintainRemain = 1,
		ScalingCurrent = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarGAInputID
	 */
	enum class ESolarGAInputID : uint8_t
	{
		None = 0,
		Jump = 1,
		Crouch = 2,
		Sprint = 3,
		JetVertical = 4,
		JetHorizontal = 5,
		Parachute = 6,
		SkydiveAccelerate = 7,
		Fire = 8,
		OutVehicle = 9,
		SkillTest = 10,
		RoleSkillOne = 11,
		RoleSkillTwo = 12,
		MAX = 13
	};

	/**
	 * Enum Solarland.ELogChannel
	 */
	enum class ELogChannel : uint8_t
	{
		General = 0,
		Mode = 1,
		Hunt = 2,
		BattleRoyal = 3,
		Weapon = 4,
		Character = 5,
		Vehicle = 6,
		Camera = 7,
		Animation = 8,
		Physics = 9,
		Inventory = 10,
		World = 11,
		MAX = 12
	};

	/**
	 * Enum Solarland.EConfigVersion
	 */
	enum class EConfigVersion : uint8_t
	{
		BeforeCustomVersionWasAdded = 0,
		FixedCanAutoSteering = 1,
		FixedDefaultFOV = 2,
		VersionPlusOne = 3,
		LatestVersion = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EBasicSettingBool
	 */
	enum class EBasicSettingBool : uint8_t
	{
		NotInit = 0,
		Off = 1,
		On = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarTouchAccMode
	 */
	enum class ESolarTouchAccMode : uint8_t
	{
		Velocity = 0,
		Constant = 1,
		Distance = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarAudioMode
	 */
	enum class ESolarAudioMode : uint8_t
	{
		PushToTalk = 0,
		FreeToTalk = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarSoundQuality
	 */
	enum class ESolarSoundQuality : uint8_t
	{
		NotInit = 0,
		Low = 1,
		High = 2,
		Ultra = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarWeaponDoScopeMode
	 */
	enum class ESolarWeaponDoScopeMode : uint8_t
	{
		Click = 0,
		Press = 1,
		Mixed = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWheeledVehicleDriveUserType
	 */
	enum class EWheeledVehicleDriveUserType : uint8_t
	{
		DirectionalInput = 0,
		SteeringInput = 1,
		JoyStickInput = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarDamageTextDisplayModeType
	 */
	enum class ESolarDamageTextDisplayModeType : uint8_t
	{
		DamageTextDisplayMode_Off = 0,
		DamageTextDisplayMode_Stacked = 1,
		DamageTextDisplayMode_Floating = 2,
		DamageTextDisplayMode_Combined = 3,
		DamageTextDisplayMode_MAX = 4
	};

	/**
	 * Enum Solarland.ESolarGameUserSettingPart
	 */
	enum class ESolarGameUserSettingPart : uint8_t
	{
		PickupSettings = 0,
		GraphicsSettings = 1,
		WeaponSettings = 2,
		LanguageSettings = 3,
		SoundSettings = 4,
		BasicSettings = 5,
		PersonalitySettings = 6,
		SensitivitySettings = 7,
		ShakeSettings = 8,
		DriverSettings = 9,
		ChatOperatorSettings = 10,
		SensitivitySettingsKeyboard = 11,
		SensitivitySettingsGamepad = 12,
		KeyboardControlSettings = 13,
		GamepadSettings = 14,
		GamepadAdvancedSettings = 15,
		All = 16,
		MAX = 17
	};

	/**
	 * Enum Solarland.EGraphicQualitySelect
	 */
	enum class EGraphicQualitySelect : uint8_t
	{
		Default = 0,
		Lobby = 1,
		InGame = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarChatOperatorType
	 */
	enum class ESolarChatOperatorType : uint8_t
	{
		All = 0,
		Team = 1,
		Off = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarShakeMainType
	 */
	enum class ESolarShakeMainType : uint8_t
	{
		OFF = 0,
		LOW = 1,
		MEDIUM = 2,
		HIGH = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarGyroscopeChooseType
	 */
	enum class ESolarGyroscopeChooseType : uint8_t
	{
		DefaultGyroscope = 0,
		ALWAYS = 1,
		FOCUS = 2,
		NEVER = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarColorBlindMode
	 */
	enum class ESolarColorBlindMode : uint8_t
	{
		Default = 0,
		RedGreen = 1,
		RedBlue = 2,
		YellowGreen = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarRenderingResolutionScaleLevel
	 */
	enum class ESolarRenderingResolutionScaleLevel : uint8_t
	{
		Default = 0,
		Percent25 = 1,
		Percent50 = 2,
		Percent75 = 3,
		Percent100 = 4,
		Invalid = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ESolarPostProcessingEffectsLevel
	 */
	enum class ESolarPostProcessingEffectsLevel : uint8_t
	{
		Default = 0,
		Low = 1,
		Medium = 2,
		High = 3,
		ExtraHigh = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarReflectionQualityLevel
	 */
	enum class ESolarReflectionQualityLevel : uint8_t
	{
		Off = 0,
		Low = 1,
		Medium = 2,
		High = 3,
		ExtraHigh = 4,
		Invalid = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ESolarSSGIQualityLevel
	 */
	enum class ESolarSSGIQualityLevel : uint8_t
	{
		Off = 0,
		Low = 1,
		Medium = 2,
		High = 3,
		ExtraHigh = 4,
		Invalid = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ESolarAmbientOcclusionQualityLevel
	 */
	enum class ESolarAmbientOcclusionQualityLevel : uint8_t
	{
		Off = 0,
		Low = 1,
		Medium = 2,
		High = 3,
		Invalid = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarPointLightShadowDetailsLevel
	 */
	enum class ESolarPointLightShadowDetailsLevel : uint8_t
	{
		Off = 0,
		Low = 1,
		Medium = 2,
		High = 3,
		VeryHigh = 4,
		ExtraHigh = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ESolarMaxCSMResolutionLevel
	 */
	enum class ESolarMaxCSMResolutionLevel : uint8_t
	{
		Off = 0,
		Low = 1,
		Medium = 2,
		High = 3,
		Invalid = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarSunlightShadowDetailLevel
	 */
	enum class ESolarSunlightShadowDetailLevel : uint8_t
	{
		Off = 0,
		Low = 1,
		Medium = 2,
		High = 3,
		Invalid = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarAnisotropicFilterLevel
	 */
	enum class ESolarAnisotropicFilterLevel : uint8_t
	{
		Default = 0,
		Level1X = 1,
		Level2X = 2,
		Level4X = 3,
		Level8X = 4,
		Level16X = 5,
		Invalid = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.ESolarAntiAliasingLevel
	 */
	enum class ESolarAntiAliasingLevel : uint8_t
	{
		Off = 0,
		FXAA = 1,
		TAA = 2,
		MSAA = 3,
		Invalid = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarMotionBlurLevel
	 */
	enum class ESolarMotionBlurLevel : uint8_t
	{
		Off = 0,
		Low = 1,
		Medium = 2,
		High = 3,
		Ultra = 4,
		Invalid = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ESolarVSyncLevel
	 */
	enum class ESolarVSyncLevel : uint8_t
	{
		Off = 0,
		DoubleBuffered = 1,
		TripleBuffered = 2,
		Invalid = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarRayTracingLevel
	 */
	enum class ESolarRayTracingLevel : uint8_t
	{
		Off = 0,
		HighPerformance = 1,
		HighQuality = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarNvdiaReflexLevel
	 */
	enum class ESolarNvdiaReflexLevel : uint8_t
	{
		Off = 0,
		On = 1,
		High = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarGraphicQuality
	 */
	enum class ESolarGraphicQuality : uint8_t
	{
		Default = 0,
		Low = 1,
		Medium = 2,
		High = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarFPS
	 */
	enum class ESolarFPS : uint8_t
	{
		Default = 0,
		FPS30 = 1,
		FPS60 = 2,
		FPS90 = 3,
		FPS120 = 4,
		FPS144 = 5,
		FPS240 = 6,
		FPS360 = 7,
		FPS500 = 8,
		SameWithMonitor = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.ESolarGraphicsMode
	 */
	enum class ESolarGraphicsMode : uint8_t
	{
		Default = 0,
		HighPerformance = 1,
		HighQuality = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarMonitor
	 */
	enum class ESolarMonitor : uint8_t
	{
		Default = 0,
		Monitor1 = 1,
		Monitor2 = 2,
		Monitor3 = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarResolution
	 */
	enum class ESolarResolution : uint8_t
	{
		Default = 0,
		Resolution1 = 1,
		Resolution2 = 2,
		Resolution3 = 3,
		Resolution4 = 4,
		Resolution5 = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.ESolarWheelModeType
	 */
	enum class ESolarWheelModeType : uint8_t
	{
		Default = 0,
		Click = 1,
		Release = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarSprintModeType
	 */
	enum class ESolarSprintModeType : uint8_t
	{
		Default = 0,
		Pressing = 1,
		Toggle = 2,
		Auto = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarAimModeType
	 */
	enum class ESolarAimModeType : uint8_t
	{
		Default = 0,
		Change = 1,
		Press = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarColorTheme
	 */
	enum class ESolarColorTheme : uint8_t
	{
		ESCT_Default = 0,
		ESCT_Bright = 1,
		ESCT_Soft = 2,
		ESCT_Cold = 3,
		ESCT_MAX = 4
	};

	/**
	 * Enum Solarland.ESolarFrameRateLevel
	 */
	enum class ESolarFrameRateLevel : uint8_t
	{
		ESFRL_NONE = 0,
		ESFRL_Low = 1,
		ESFRL_Mid = 2,
		ESFRL_High = 3,
		ESFRL_HighEnd = 4,
		ESFRL_EXTREME = 5,
		ESFRL_MAX = 6
	};

	/**
	 * Enum Solarland.ESolarContentScaleFactorLevel
	 */
	enum class ESolarContentScaleFactorLevel : uint8_t
	{
		ESCSFL_NONE = 0,
		ESCSFL_Low = 1,
		ESCSFL_Mid = 2,
		ESCSFL_High = 3,
		ESCSFL_HighEnd = 4,
		ESCSFL_MAX = 5
	};

	/**
	 * Enum Solarland.ESolarDeviceType
	 */
	enum class ESolarDeviceType : uint8_t
	{
		ESDT_Invalid = 0,
		ESDT_Windows = 1,
		ESDT_Android = 2,
		ESDT_IOS = 3,
		ESDT_Switch = 4,
		ESDT_Other = 5,
		ESDT_MAX = 6
	};

	/**
	 * Enum Solarland.ESolarDeviceLevel
	 */
	enum class ESolarDeviceLevel : uint8_t
	{
		ESDL_Invalid = 0,
		ESDL_Level1 = 1,
		ESDL_Level2 = 2,
		ESDL_Level3 = 3,
		ESDL_Level4 = 4,
		ESDL_Level5 = 5,
		ESDL_Level6 = 6,
		ESDL_Level7 = 7,
		ESDL_VALUE_MIN = 8,
		ESDL_VALUE_MAX = 9,
		ESDL_MAX = 10
	};

	/**
	 * Enum Solarland.ESolarGraphicsQualityLevel
	 */
	enum class ESolarGraphicsQualityLevel : uint8_t
	{
		ESGQL_Invalid = 0,
		ESGQL_Level1 = 1,
		ESGQL_Level2 = 2,
		ESGQL_Level3 = 3,
		ESGQL_Level4 = 4,
		ESGQL_Level5 = 5,
		ESGQL_Level6 = 6,
		ESGQL_Level7 = 7,
		ESGQL_VALUE_MIN = 8,
		ESGQL_VALUE_MAX = 9,
		ESGQL_MAX = 10
	};

	/**
	 * Enum Solarland.EHomeCameraMode
	 */
	enum class EHomeCameraMode : uint8_t
	{
		Normal = 0,
		Ceiling = 1,
		Panoramic = 2,
		Orthographic = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EHomeLoadingChangeType
	 */
	enum class EHomeLoadingChangeType : uint8_t
	{
		NONE = 0,
		OPEN = 1,
		CLOSE = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EHomeOperationType
	 */
	enum class EHomeOperationType : uint8_t
	{
		NONE = 0,
		CREATE = 1,
		UPDATE = 2,
		REMOVE = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EHomeDragUIType
	 */
	enum class EHomeDragUIType : uint8_t
	{
		NONE = 0,
		ARROW = 1,
		ROUND = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EHomeActorOwner
	 */
	enum class EHomeActorOwner : uint8_t
	{
		NOBODY = 0,
		SELF = 1,
		OTHERS = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EHomeActorSurfaceDir
	 */
	enum class EHomeActorSurfaceDir : uint8_t
	{
		NONE = 0,
		FORWARD = 1,
		BACKWARD = 2,
		LEFT = 3,
		RIGHT = 4,
		UP = 5,
		DOWN = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EHomeActor_SecondType
	 */
	enum class EHomeActor_SecondType : uint8_t
	{
		NONE = 0,
		CONSTRUCT_BASE = 1,
		CONSTRUCT_FLOOR = 2,
		CONSTRUCT_WALL = 3,
		DEVICE_ON_FLOOR = 4,
		DEVICE_ON_WALL = 5,
		DEVICE_ON_CEILING = 6,
		EHomeActor_MAX = 7
	};

	/**
	 * Enum Solarland.EHomeActor_FirstType
	 */
	enum class EHomeActor_FirstType : uint8_t
	{
		NONE = 0,
		CONSTRUCT = 1,
		DEVICE = 2,
		EHomeActor_MAX = 3
	};

	/**
	 * Enum Solarland.EHoverCraftHitType
	 */
	enum class EHoverCraftHitType : uint8_t
	{
		Default = 0,
		HoverCraftVehicle = 1,
		HoverVehicle = 2,
		LeggedVehicle = 3,
		WheeledVehicle = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EInputKeyMappingType
	 */
	enum class EInputKeyMappingType : uint8_t
	{
		KeyAndMouse1 = 0,
		KeyAndMouse2 = 1,
		Gamepad = 2,
		Count = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EInputActionContextType
	 */
	enum class EInputActionContextType : uint8_t
	{
		Pawn = 0,
		Controller = 1,
		LevelScriptActor = 2,
		UserWidget = 3,
		Count = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EGamepadDPad
	 */
	enum class EGamepadDPad : uint8_t
	{
		None = 0,
		Reset = 1,
		Up = 2,
		Down = 3,
		Right = 4,
		Left = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EInputActionFlags
	 */
	enum class EInputActionFlags : uint8_t
	{
		None = 0,
		FlagBigMap = 1,
		FlagBackpack = 2,
		FlagChatWheel = 3,
		FlagParachute = 4,
		FlagSpectate = 5,
		FlagTeamDeath = 6,
		FlagRelive = 7,
		FlagBlockAll = 8,
		FlagMax = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.ESolarInteractionType
	 */
	enum class ESolarInteractionType : uint8_t
	{
		Invalid = 0,
		RescueTeammate = 1,
		ReviveTeammate = 2,
		OpenAirdrop = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarItemPrivilegeType
	 */
	enum class ESolarItemPrivilegeType : uint8_t
	{
		NONE = 0,
		NETBAR = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarItemShowType
	 */
	enum class ESolarItemShowType : uint8_t
	{
		NOTSHOW = 0,
		SHOW = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarRedHintType
	 */
	enum class ESolarRedHintType : uint8_t
	{
		ZERO = 0,
		SHOW = 1,
		HIDE = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarItemOwnType
	 */
	enum class ESolarItemOwnType : uint8_t
	{
		ZERO = 0,
		NOOWN = 1,
		OWN = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarItemBuyType
	 */
	enum class ESolarItemBuyType : uint8_t
	{
		ZERO = 0,
		NOBUY = 1,
		BUY = 2,
		CANTBUY = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarItemUseType
	 */
	enum class ESolarItemUseType : uint8_t
	{
		ZERO = 0,
		NOUSE = 1,
		USING = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarItemLimitType
	 */
	enum class ESolarItemLimitType : uint8_t
	{
		ZERO = 0,
		NOLIMIT = 1,
		LIMITING = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarItemMarkType
	 */
	enum class ESolarItemMarkType : uint8_t
	{
		ZERO = 0,
		NOMARK = 1,
		MARKED = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarItemDownloadType
	 */
	enum class ESolarItemDownloadType : uint8_t
	{
		ZERO = 0,
		NOTDOWNLOAD = 1,
		DOWNLOADING = 2,
		DOWNLOADED = 3,
		PAUSING = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarItemLockType
	 */
	enum class ESolarItemLockType : uint8_t
	{
		ZERO = 0,
		NOLOCK = 1,
		LOCKED = 2,
		TEMPUNLOCK = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarItemSelectType
	 */
	enum class ESolarItemSelectType : uint8_t
	{
		ZERO = 0,
		NOTSELECT = 1,
		SELECTED = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarItemQualityType
	 */
	enum class ESolarItemQualityType : uint8_t
	{
		ZERO = 0,
		N = 1,
		R = 2,
		SR = 3,
		SSR = 4,
		SSRPLUS = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EBurstMethod
	 */
	enum class EBurstMethod : uint8_t
	{
		ParabCurveFitting = 0,
		GoldenSpiral = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESpecialItemID
	 */
	enum class ESpecialItemID : uint8_t
	{
		NONE = 0,
		CARIRIDGE_BAG = 1,
		REVIVE_ITEM = 2,
		RADAR_SCANNER = 3,
		SHIELD_RECHARGER = 4,
		SHIELD_BIG_RECHARGER = 5,
		AMMO_ASSAULT_RIFLE = 6,
		AMMO_RIFLE = 7,
		AMMO_SNIPER = 8,
		AMMO_SHOTGUN = 9,
		SHIELD_UPGRADE_MATERIAL = 10,
		EXP_ITEM = 11,
		MAX = 12
	};

	/**
	 * Enum Solarland.EItemConfirmID
	 */
	enum class EItemConfirmID : uint8_t
	{
		DropExtraEnergyConfirmID = 0,
		ReplaceExtraEnergyConfirmID = 1,
		DropEnergyModuleConfirmID = 2,
		ReplaceEnergyModuleConfirmID = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EItemLocalTextID
	 */
	enum class EItemLocalTextID : uint8_t
	{
		LevelNumTextID = 0,
		MAX = 1
	};

	/**
	 * Enum Solarland.EItemNoticeID
	 */
	enum class EItemNoticeID : uint8_t
	{
		BoxBeUsing = 0,
		CantEquipThisScope = 1,
		CantEquipThisPart = 2,
		WillEquipLowLevelScope = 3,
		WillEquipLowLevelPart = 4,
		HasBetterPart = 5,
		HasBetterScope = 6,
		GetItem = 7,
		GetHomeItem = 8,
		EquipReplace = 9,
		DropItemNotAutoPickup = 10,
		ItemMaxPile = 11,
		ReviveItemMaxPile = 12,
		CantPickupReviveItem = 13,
		MAX = 14
	};

	/**
	 * Enum Solarland.ESpawnStage
	 */
	enum class ESpawnStage : uint8_t
	{
		STAGE_NONE = 0,
		STAGE_READY = 1,
		STAGE_BATTLE = 2,
		STAGE_ALL = 3,
		STAGE_MAX = 4
	};

	/**
	 * Enum Solarland.EOutcomeType
	 */
	enum class EOutcomeType : uint8_t
	{
		None = 0,
		Single = 1,
		Pool = 2,
		DynamicPool = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EItemSourceType
	 */
	enum class EItemSourceType : uint8_t
	{
		None = 0,
		DeathTreasureBox = 1,
		TreasureBox = 2,
		AirDropTreasureBox = 3,
		Max = 4
	};

	/**
	 * Enum Solarland.EItemDiscardState
	 */
	enum class EItemDiscardState : uint8_t
	{
		DEFAULT = 0,
		DEATHBOX = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EItemState
	 */
	enum class EItemState : uint8_t
	{
		NONE = 0,
		POSSESS = 1,
		DISCARD = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EItemQualityType
	 */
	enum class EItemQualityType : uint8_t
	{
		None = 0,
		White = 1,
		Green = 2,
		Blue = 3,
		Purple = 4,
		Orange = 5,
		Red = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.ESpawnerLevel
	 */
	enum class ESpawnerLevel : uint8_t
	{
		LEVEL = 0,
		LEVEL01 = 1,
		LEVEL02 = 2,
		LEVEL03 = 3,
		LEVEL_MAX = 4
	};

	/**
	 * Enum Solarland.ESpawnerType
	 */
	enum class ESpawnerType : uint8_t
	{
		NONE = 0,
		NORMAL = 1,
		TREASUREBOX = 2,
		AIRDROP = 3,
		VEHICLE = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.OnLSDestroyStrategy
	 */
	enum class EOnLSDestroyStrategy : uint8_t
	{
		OnLSDestroyStrategyCustom = 0,
		OnLSDestroyStrategySelfDestroy = 1,
		OnLSDestroyStrategyFreeFall = 2,
		OnLSDestroyStrategyOnLSDestroyStrategy_MAX = 3
	};

	/**
	 * Enum Solarland.OnLSModifiedStrategy
	 */
	enum class EOnLSModifiedStrategy : uint8_t
	{
		OnLSModifiedStrategyCustom = 0,
		OnLSModifiedStrategyUpdateHeight = 1,
		OnLSModifiedStrategyOnLSModifiedStrategy_MAX = 2
	};

	/**
	 * Enum Solarland.ELayoutDataType
	 */
	enum class ELayoutDataType : uint8_t
	{
		Invalid = 0,
		Mobile = 1,
		Desktop = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWalkingDirection
	 */
	enum class EWalkingDirection : uint8_t
	{
		None = 0,
		Forward = 1,
		Backward = 2,
		Left = 3,
		Right = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EVehicleShrinkCapsuleExtent
	 */
	enum class EVehicleShrinkCapsuleExtent : uint8_t
	{
		SHRINK_None = 0,
		SHRINK_RadiusCustom = 1,
		SHRINK_HeightCustom = 2,
		SHRINK_AllCustom = 3,
		SHRINK_MAX = 4
	};

	/**
	 * Enum Solarland.EVehicleLocomotionState
	 */
	enum class EVehicleLocomotionState : uint8_t
	{
		Walk = 0,
		Run = 1,
		Sprint = 2,
		Max = 3
	};

	/**
	 * Enum Solarland.ESolarBuildConfiguration
	 */
	enum class ESolarBuildConfiguration : uint8_t
	{
		Unknown = 0,
		Debug = 1,
		Development = 2,
		Shipping = 3,
		Test = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EElementVisibilityType
	 */
	enum class EElementVisibilityType : uint8_t
	{
		Visible = 0,
		Hidden = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EElementStateType
	 */
	enum class EElementStateType : uint8_t
	{
		Normal = 0,
		Suspend = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarMapElementPropertyType
	 */
	enum class ESolarMapElementPropertyType : uint8_t
	{
		String = 0,
		Float = 1,
		Int = 2,
		Bool = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESGameMode_ElementType
	 */
	enum class ESGameMode_ElementType : uint8_t
	{
		PlayerStart = 0,
		ItemSpawner = 1,
		AirDrop = 2,
		ChargingPile = 3,
		JumpPad = 4,
		CarPad = 5,
		Vehicle = 6,
		Poison = 7,
		Custom = 8,
		ESGameMode_MAX = 9
	};

	/**
	 * Enum Solarland.EMapDarkDataType
	 */
	enum class EMapDarkDataType : uint8_t
	{
		POISONCIRCLE = 0,
		MAX = 1
	};

	/**
	 * Enum Solarland.EMapAirlineType
	 */
	enum class EMapAirlineType : uint8_t
	{
		Default = 0,
		Capsule = 1,
		Airdrop = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EDirection
	 */
	enum class EDirection : uint8_t
	{
		TOP = 0,
		BOTTOM = 1,
		LEFT = 2,
		RIGHT = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EBattlePromptType
	 */
	enum class EBattlePromptType : uint8_t
	{
		None = 0,
		Player = 1,
		Vehicle = 2,
		Move = 3,
		Fire = 4,
		HeavyWeapon = 5,
		Crouch = 6,
		Skydive = 7,
		PlayerStep = 8,
		VehicleMove = 9,
		PlayerCrouchMove = 10,
		PlayerSkydive = 11,
		PlayerFire = 12,
		VehicleFire = 13,
		PlayerHeavyFire = 14,
		VehicleHeavyFire = 15,
		MAX = 16
	};

	/**
	 * Enum Solarland.EMarkerType
	 */
	enum class EMarkerType : uint8_t
	{
		NONE = 0,
		ENEMYSTEP = 1,
		ENEMYFIGHT = 2,
		AIRDROPBOX = 3,
		REDZONE = 4,
		VEHICLEVOICE = 5,
		VEHICLEMARK = 6,
		ENEMYLAUNCH = 7,
		VEHICLELAUNCH = 8,
		SKILLBUFFMARK = 9,
		RADARCharacter = 10,
		RADARCharacterWithAngle = 11,
		RADARVehicle = 12,
		RADARTreasureBox = 13,
		RADARChargingPile = 14,
		RADAR = 15,
		ELECTRICSHOP = 16,
		PARACHUTE = 17,
		RESPAWN = 18,
		SHIELDUPGRADEITEMSHOP = 19,
		ReviveTeammate = 20,
		BLUECIRCLE = 21,
		MAX = 22
	};

	/**
	 * Enum Solarland.EMovablePadLimitationFlag
	 */
	enum class EMovablePadLimitationFlag : uint8_t
	{
		None = 0,
		NoPress = 1,
		NoRelease = 2,
		NoMove = 3,
		NoPressAndRelease = 4,
		NoPressAndMove = 5,
		NoReleaseAndMove = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.ENavLinkType
	 */
	enum class ENavLinkType : uint8_t
	{
		Jet = 0,
		Vault = 1,
		None = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EOwnerType
	 */
	enum class EOwnerType : uint8_t
	{
		None = 0,
		Vehicle = 1,
		TreasureBox = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ERestState
	 */
	enum class ERestState : uint8_t
	{
		AT_REST = 0,
		JUST_STARTED_MOVING = 1,
		MOVING = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EExtrapolationMode
	 */
	enum class EExtrapolationMode : uint8_t
	{
		UNLIMITED = 0,
		LIMITED = 1,
		NONE = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESyncMode
	 */
	enum class ESyncMode : uint8_t
	{
		NONE = 0,
		X = 1,
		Y = 2,
		Z = 3,
		XY = 4,
		XZ = 5,
		YZ = 6,
		XYZ = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.ENightComesState
	 */
	enum class ENightComesState : uint8_t
	{
		None = 0,
		Begin = 1,
		Ongoing = 2,
		End = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EPerceivableEffectAreaTendency
	 */
	enum class EPerceivableEffectAreaTendency : uint8_t
	{
		Hostile = 0,
		Neutral = 1,
		Friendly = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EPerceivableEffectAreaType
	 */
	enum class EPerceivableEffectAreaType : uint8_t
	{
		Unknow = 0,
		SmokeGrenade = 1,
		NightCome = 2,
		AutomaticTurret = 3,
		BlackHole = 4,
		Incendiary = 5,
		EnergyBubble = 6,
		SummonWall = 7,
		UAVShield = 8,
		UAVRescue = 9,
		HealPile = 10,
		MAX = 11
	};

	/**
	 * Enum Solarland.EPickupListItemType
	 */
	enum class EPickupListItemType : uint8_t
	{
		None = 0,
		Single = 1,
		Merge = 2,
		Customize = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EPickupListChangeReason
	 */
	enum class EPickupListChangeReason : uint8_t
	{
		Default = 0,
		Backpack = 1,
		Skill = 2,
		Weapon = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarPileType
	 */
	enum class ESolarPileType : uint8_t
	{
		ChargingPile = 0,
		HealPile = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EChargingChannel
	 */
	enum class EChargingChannel : uint8_t
	{
		MAIN = 0,
		EXTRA = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EPileHealingType
	 */
	enum class EPileHealingType : uint8_t
	{
		None = 0,
		Health = 1,
		Armor = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ELevelTickType
	 */
	enum class ELevelTickType : uint8_t
	{
		LEVELTICK_TimeOnly = 0,
		LEVELTICK_ViewportsOnly = 1,
		LEVELTICK_All = 2,
		LEVELTICK_PauseTick = 3,
		LEVELTICK_MAX = 4
	};

	/**
	 * Enum Solarland.EInteractiveFlag
	 */
	enum class EInteractiveFlag : uint8_t
	{
		None = 0,
		DanceLearder = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarPlayerSensitivitysType
	 */
	enum class ESolarPlayerSensitivitysType : uint8_t
	{
		None = 0,
		HoldWeaponSensitivity = 1,
		WeaponShootSensitivity = 2,
		WeaponShoulderNoShotSensitivity = 3,
		WeaponShoulderShotSensitivity = 4,
		WeaponSkillSensitivity = 5,
		SightSensitivity = 6,
		ScopeSensitivity = 7,
		ScopeShootSensitivity = 8,
		VehicleDriverSensitivity = 9,
		VehicleFireSensitivity = 10,
		SuperSkillSensitivity = 11,
		TacticalSkillSensitivity = 12,
		MAX = 13
	};

	/**
	 * Enum Solarland.ECharacterOwnerType
	 */
	enum class ECharacterOwnerType : uint8_t
	{
		CSITNone = 0,
		CSITOwn = 1,
		CSITExperience = 2,
		CSITLimit = 3,
		CSITPrivilege = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EWeaponAttachState
	 */
	enum class EWeaponAttachState : uint8_t
	{
		NONE = 0,
		AttachOnHand = 1,
		AttachOnBackpack = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWeaponRVCmd
	 */
	enum class EWeaponRVCmd : uint8_t
	{
		Cmd_None = 0,
		LocalHold = 1,
		OtherHold = 2,
		Dropped = 3,
		ReplacePart = 4,
		SkinRefresh = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EPreservedBotType
	 */
	enum class EPreservedBotType : uint8_t
	{
		PendingInit = 0,
		OnCall = 1,
		WaitingForSend = 2,
		Killer = 3,
		WaitingToDie = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarProjBulletCollisionType
	 */
	enum class ESolarProjBulletCollisionType : uint8_t
	{
		Shape = 0,
		Box = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ERadarType
	 */
	enum class ERadarType : uint8_t
	{
		ERT_WholeMap = 0,
		ERT_FollowSpawner = 1,
		ERT_FixedRound = 2,
		ERT_UAV = 3,
		ERT_OneTimeScan = 4,
		ERT_MAX = 5
	};

	/**
	 * Enum Solarland.ERedHintPath
	 */
	enum class ERedHintPath : uint8_t
	{
		None = 0,
		Root = 1,
		Social = 2,
		Arsenal = 3,
		Arsenal_Weapon = 4,
		Arsenal_Skin = 5,
		Arsenal_Part = 6,
		Shop = 7,
		Mail = 8,
		Capsulers = 9,
		Capsulers_Detail = 10,
		Capsulers_Story = 11,
		Capsulers_Skin = 12,
		Capsulers_LevelUp = 13,
		Capsulers_Pose = 14,
		Capsulers_PoseTab = 15,
		Capsulers_BG = 16,
		Capsulers_BGTab = 17,
		Capsulers_BGFrame = 18,
		Capsulers_BGFrameTab = 19,
		Capsulers_DeathBox = 20,
		Capsulers_DeathBoxTab = 21,
		Capsulers_Voice = 22,
		Capsulers_VoiceKillVoice = 23,
		Capsulers_VoiceTeamDie = 24,
		Capsulers_VoiceTopKill = 25,
		Capsulers_VoiceParachute = 26,
		Capsulers_VoiceBattleTab = 27,
		Capsulers_VoicePersonalityTab = 28,
		Capsulers_VoiceTab = 29,
		WareHouse = 30,
		Task = 31,
		Activity = 32,
		RankFight = 33,
		Achievement = 34,
		EditBusinessCard = 35,
		PlayerInfo = 36,
		GameMode = 37,
		Raffle = 38,
		Vehicle = 39,
		Vehicle_Skin = 40,
		Clan = 41,
		ClanPermission = 42,
		Collection = 43,
		Tournament = 44,
		VipCard = 45,
		ClanMember = 46,
		Max = 47
	};

	/**
	 * Enum Solarland.ERedHintValueType
	 */
	enum class ERedHintValueType : uint8_t
	{
		Single = 0,
		MultiValue = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ECharacterSkydivingState
	 */
	enum class ECharacterSkydivingState : uint8_t
	{
		EveryBattle = 0,
		Flying = 1,
		Skydiving = 2,
		Landing = 3,
		Num = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EReplayDamageSourceType
	 */
	enum class EReplayDamageSourceType : uint8_t
	{
		None = 0,
		Weapon = 1,
		Vehicle = 2,
		Skill = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ENarrateActivityType
	 */
	enum class ENarrateActivityType : uint8_t
	{
		None = 0,
		OnEngage = 1,
		OnScramble = 2,
		WeaponKnockdown = 3,
		VehicleKnockdown = 4,
		AbilityKnockdown = 5,
		OnKilled = 6,
		OnPickUpItem = 7,
		OnDriveVehicle = 8,
		OnGameStart = 9,
		OnChangeScene = 10,
		OnTeamEliminate = 11,
		OnReaperKilled = 12,
		OnVictory = 13,
		OnMultiKill = 14,
		OnChatInformative = 15,
		OnGameEnd = 16,
		OnInterrupt = 17,
		OnCheatKickOut = 18,
		MAX = 19
	};

	/**
	 * Enum Solarland.EAutoDirectorActivityType
	 */
	enum class EAutoDirectorActivityType : uint8_t
	{
		None = 0,
		PlayerWeaponHit = 1,
		PlayerWeaponDown = 2,
		PlayerWeaponKill = 3,
		PickupItem = 4,
		DriveVehicle = 5,
		VehicleWeaponHit = 6,
		VehicleWeaponDown = 7,
		VehicleWeaponKill = 8,
		BandagePlayer = 9,
		RevivePlayer = 10,
		UseTacticalAbility = 11,
		UseUltimateAbility = 12,
		AbilityDown = 13,
		AbilityKill = 14,
		StartSkydive = 15,
		MAX = 16
	};

	/**
	 * Enum Solarland.EAutoDirectorCameraMode
	 */
	enum class EAutoDirectorCameraMode : uint8_t
	{
		Free = 0,
		Follow = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EReplayFindSpectateTargetApproach
	 */
	enum class EReplayFindSpectateTargetApproach : uint8_t
	{
		None = 0,
		SuggestTarget = 1,
		LastTarget = 2,
		ClosestToCamera = 3,
		FirstInPlayerList = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EPlayerHighlightMarkType
	 */
	enum class EPlayerHighlightMarkType : uint8_t
	{
		B = 0,
		A = 1,
		S = 2,
		Ex = 3,
		Max = 4
	};

	/**
	 * Enum Solarland.EClassRepNodeMapping
	 */
	enum class EClassRepNodeMapping : uint8_t
	{
		Missing = 0,
		NotRouted = 1,
		CustomRelevancy = 2,
		RelevantAllConnections = 3,
		Spatialize_Static = 4,
		Spatialize_Dynamic = 5,
		Spatialize_Dormancy = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EIncreaseAndDecreaseTransitionMode
	 */
	enum class EIncreaseAndDecreaseTransitionMode : uint8_t
	{
		Continuously = 0,
		BreakAndKeepLast = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EActorInSafeAreaStatus
	 */
	enum class EActorInSafeAreaStatus : uint8_t
	{
		InSafeArea = 0,
		NotInSafeArea = 1,
		InTargetSafeArea = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESafeAreaStatus
	 */
	enum class ESafeAreaStatus : uint8_t
	{
		None = 0,
		WaitingForStart = 1,
		WaitingForShrink = 2,
		Shrink = 3,
		ShrinkEnd = 4,
		Pause = 5,
		End = 6,
		NoEffect = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.ENeverShowDuration
	 */
	enum class ENeverShowDuration : uint8_t
	{
		Day = 0,
		Week = 1,
		Month = 2,
		Year = 3,
		Never = 4,
		None = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EShieldUpgradeItemShopState
	 */
	enum class EShieldUpgradeItemShopState : uint8_t
	{
		None = 0,
		Upgrading = 1,
		Done = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EParticleOptimization
	 */
	enum class EParticleOptimization : uint8_t
	{
		Origin = 0,
		LowPriorityOptimization = 1,
		MidPriorityOptimization = 2,
		HighPriorityOptimization = 3,
		UltraHighPriorityOptimization = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarEMPParticleType
	 */
	enum class ESolarEMPParticleType : uint8_t
	{
		FadeIn = 0,
		FadeOut = 1,
		Loop = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarEMPForceFieldState
	 */
	enum class ESolarEMPForceFieldState : uint8_t
	{
		None = 0,
		Ready = 1,
		Active = 2,
		End = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarDamageShapeType
	 */
	enum class ESolarDamageShapeType : uint8_t
	{
		Capsule = 0,
		Sphere = 1,
		Box = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarSurroundLightningApplyType
	 */
	enum class ESolarSurroundLightningApplyType : uint8_t
	{
		SurroundLightningApplyType_Character = 0,
		SurroundLightningApplyType_Vehicle = 1,
		SurroundLightningApplyType_Other = 2,
		SurroundLightningApplyType_MAX = 3
	};

	/**
	 * Enum Solarland.ESpectatorMode
	 */
	enum class ESpectatorMode : uint8_t
	{
		DeathWatch = 0,
		Replay = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarSummonItemType
	 */
	enum class ESolarSummonItemType : uint8_t
	{
		Default = 0,
		Skill_Tower = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ETabControlListStyle
	 */
	enum class ETabControlListStyle : uint8_t
	{
		None = 0,
		Text = 1,
		Icon = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ETabControlListSlotType
	 */
	enum class ETabControlListSlotType : uint8_t
	{
		Leaf = 0,
		Compound = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_CalculatingSign
	 */
	enum class ESolarTablesEnum_CalculatingSign : uint8_t
	{
		Plus = 0,
		Multiplication = 1,
		Equal = 2,
		_Count = 3,
		ESolarTablesEnum_MAX = 4
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_PartsType
	 */
	enum class ESolarTablesEnum_PartsType : uint8_t
	{
		Muzzle = 0,
		Scope = 1,
		Clip = 2,
		Runes = 3,
		Grip = 4,
		GunStock = 5,
		Scope2x = 6,
		Scope4x = 7,
		Scope8x = 8,
		_Count = 9,
		ESolarTablesEnum_MAX = 10
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_AccessoryType
	 */
	enum class ESolarTablesEnum_AccessoryType : uint8_t
	{
		WeaponParts = 0,
		WeaponAmmo = 1,
		_Count = 2,
		ESolarTablesEnum_MAX = 3
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_FireCostType
	 */
	enum class ESolarTablesEnum_FireCostType : uint8_t
	{
		Descrete = 0,
		Continuous = 1,
		_Count = 2,
		ESolarTablesEnum_MAX = 3
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_TriggerType
	 */
	enum class ESolarTablesEnum_TriggerType : uint8_t
	{
		KeyDown = 0,
		KeyUp = 1,
		KeyHold = 2,
		_Count = 3,
		ESolarTablesEnum_MAX = 4
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_TrajectoryType
	 */
	enum class ESolarTablesEnum_TrajectoryType : uint8_t
	{
		Line = 0,
		LineGravity = 1,
		Curve = 2,
		Canister = 3,
		Beam = 4,
		Rocket = 5,
		VirtualBullet = 6,
		_Count = 7,
		ESolarTablesEnum_MAX = 8
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_FireMethodType
	 */
	enum class ESolarTablesEnum_FireMethodType : uint8_t
	{
		Bullet = 0,
		Skill = 1,
		SummonBullet = 2,
		_Count = 3,
		ESolarTablesEnum_MAX = 4
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_WeaponType
	 */
	enum class ESolarTablesEnum_WeaponType : uint8_t
	{
		AssualtRifle = 0,
		Submachinegun = 1,
		Shotgun = 2,
		Sniper = 3,
		Vehicle = 4,
		ItemWeapon = 5,
		SummonWeapon = 6,
		AntiVehicle = 7,
		_Count = 8,
		ESolarTablesEnum_MAX = 9
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_TrigerType
	 */
	enum class ESolarTablesEnum_TrigerType : uint8_t
	{
		GameTime = 0,
		AliveCount = 1,
		RealTime = 2,
		MatchRoundTime = 3,
		GameWorldTime = 4,
		_Count = 5,
		ESolarTablesEnum_MAX = 6
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_CategoryType
	 */
	enum class ESolarTablesEnum_CategoryType : uint8_t
	{
		CategoryType_None = 0,
		CategoryType_Reco = 1,
		CategoryType_Character = 2,
		CategoryType_CharacterSkin = 3,
		CategoryType_WeaponSkin = 4,
		CategoryType_Capsule = 5,
		CategoryType_Bag = 6,
		CategoryType_Tail = 7,
		CategoryType_Home = 8,
		CategoryType_Others = 9,
		_Count = 10,
		ESolarTablesEnum_MAX = 11
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_ShareType
	 */
	enum class ESolarTablesEnum_ShareType : uint8_t
	{
		ActionType_None = 0,
		ShareType_RankShare = 1,
		ShareType_BattlePassShare = 2,
		ShareType_AchieveItemShare = 3,
		ShareType_ScoreShare = 4,
		ShareType_LoginActivityShare = 5,
		ShareType_MedalShare = 6,
		ShareType_UserGrowthShare = 7,
		ShareType_FollowCommunity = 8,
		ShareType_PersonalHistory = 9,
		ShareType_IdolShare = 10,
		_Count = 11,
		ESolarTablesEnum_MAX = 12
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_LobbyMatchEnterType
	 */
	enum class ESolarTablesEnum_LobbyMatchEnterType : uint8_t
	{
		CanClick = 0,
		PartialClick = 1,
		ForbidClick = 2,
		_Count = 3,
		ESolarTablesEnum_MAX = 4
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_StackType
	 */
	enum class ESolarTablesEnum_StackType : uint8_t
	{
		StackByQTY = 0,
		StackByTime = 1,
		_Count = 2,
		ESolarTablesEnum_MAX = 3
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_InputRelatedType
	 */
	enum class ESolarTablesEnum_InputRelatedType : uint8_t
	{
		InputRelatedNone = 0,
		Input_F = 1,
		InputRelated2 = 2,
		InputRelated3 = 3,
		InputRelated4 = 4,
		InputRelated5 = 5,
		InputRelated6 = 6,
		InputRelated7 = 7,
		InputRelated8 = 8,
		InputRelated9 = 9,
		InputRelated10 = 10,
		Input_J = 11,
		_Count = 12,
		ESolarTablesEnum_MAX = 13
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_InputContextType
	 */
	enum class ESolarTablesEnum_InputContextType : uint8_t
	{
		InputCommon = 0,
		InputPlayer = 1,
		InputVehicle = 2,
		InputOB = 3,
		InputPlayerSkill = 4,
		InputActionWheel = 5,
		_Count = 6,
		ESolarTablesEnum_MAX = 7
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_InputTabType
	 */
	enum class ESolarTablesEnum_InputTabType : uint8_t
	{
		InputTabPlayer = 0,
		InputTabVehicle = 1,
		InputTabOB = 2,
		InputTabMisc = 3,
		_Count = 4,
		ESolarTablesEnum_MAX = 5
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_InputCtrlType
	 */
	enum class ESolarTablesEnum_InputCtrlType : uint8_t
	{
		InputCtrlHide = 0,
		InputCtrlShow = 1,
		InputCtrlCustom = 2,
		_Count = 3,
		ESolarTablesEnum_MAX = 4
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_InputGroupType
	 */
	enum class ESolarTablesEnum_InputGroupType : uint8_t
	{
		InputNone = 0,
		InputKeyF = 1,
		InputKeyG = 2,
		InputKeyP = 3,
		_Count = 4,
		ESolarTablesEnum_MAX = 5
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_GamepadCtrlType
	 */
	enum class ESolarTablesEnum_GamepadCtrlType : uint8_t
	{
		GamepadCtrlHide = 0,
		GamepadCtrlShowOnly = 1,
		GamepadCtrlCustom = 2,
		GamepadCtrlCustomAndCom = 3,
		_Count = 4,
		ESolarTablesEnum_MAX = 5
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_InputGamepadType
	 */
	enum class ESolarTablesEnum_InputGamepadType : uint8_t
	{
		InputGamepadOneKey = 0,
		InputGamepadComKey = 1,
		InputGamepadFreeComKey = 2,
		_Count = 3,
		ESolarTablesEnum_MAX = 4
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_ClassModeType
	 */
	enum class ESolarTablesEnum_ClassModeType : uint8_t
	{
		CLASS_MODE_NONE = 0,
		CLASS_MODE_V13 = 1,
		CLASS_MODE_UniqueSkill = 2,
		CLASS_MODE_RoleGrow = 3,
		_Count = 4,
		ESolarTablesEnum_MAX = 5
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_ExcuterType
	 */
	enum class ESolarTablesEnum_ExcuterType : uint8_t
	{
		AirDrop = 0,
		GasCircle = 1,
		Bomb = 2,
		_Count = 3,
		ESolarTablesEnum_MAX = 4
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_DisplayType
	 */
	enum class ESolarTablesEnum_DisplayType : uint8_t
	{
		None = 0,
		Tips = 1,
		Window = 2,
		_Count = 3,
		ESolarTablesEnum_MAX = 4
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_ChestType
	 */
	enum class ESolarTablesEnum_ChestType : uint8_t
	{
		AirDrop = 0,
		ElecChest = 1,
		_Count = 2,
		ESolarTablesEnum_MAX = 3
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_Duration
	 */
	enum class ESolarTablesEnum_Duration : uint8_t
	{
		Day = 0,
		Week = 1,
		Month = 2,
		Year = 3,
		Never = 4,
		None = 5,
		_Count = 6,
		ESolarTablesEnum_MAX = 7
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_CharacterLevelUpType
	 */
	enum class ESolarTablesEnum_CharacterLevelUpType : uint8_t
	{
		Health = 0,
		Damage = 1,
		Movement = 2,
		FlyCooldown = 3,
		_Count = 4,
		ESolarTablesEnum_MAX = 5
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_CharacterType
	 */
	enum class ESolarTablesEnum_CharacterType : uint8_t
	{
		None = 0,
		Assault = 1,
		Defence = 2,
		Support = 3,
		Scout = 4,
		_Count = 5,
		ESolarTablesEnum_MAX = 6
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_BehaviorType
	 */
	enum class ESolarTablesEnum_BehaviorType : uint8_t
	{
		SurvivalTime = 0,
		Kills = 1,
		Assists = 2,
		Selfhealing = 3,
		TeammateHealing = 4,
		Unpacking = 5,
		CollectElectricity = 6,
		PickExpPack = 7,
		EveryDamageDealt = 8,
		NpcKills = 9,
		NpcAssists = 10,
		_Count = 11,
		ESolarTablesEnum_MAX = 12
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_Enum_Behavior
	 */
	enum class ESolarTablesEnum_Enum_Behavior : uint8_t
	{
		Behavior1 = 0,
		Behavior2 = 1,
		Behavior3 = 2,
		Behavior4 = 3,
		Behavior5 = 4,
		Behavior6 = 5,
		Behavior7 = 6,
		Behavior8 = 7,
		Behavior9 = 8,
		Behavior10 = 9,
		Behavior11 = 10,
		_Count = 11,
		ESolarTablesEnum_Enum_MAX = 12
	};

	/**
	 * Enum Solarland.ESolarTablesEnum_ActionType
	 */
	enum class ESolarTablesEnum_ActionType : uint8_t
	{
		ActionType_None = 0,
		ActionType_OpenGift = 1,
		ActionType_Charge = 2,
		ActionType_Battle = 3,
		ActionType_Mail = 4,
		ActionType_ShopBuy = 5,
		ActionType_DailyTask = 6,
		ActionType_Activity = 7,
		ActionType_Guid = 8,
		ActionType_GM = 9,
		ActionType_BattleBag = 10,
		ActionType_ItemUse = 11,
		ActionType_Refund = 12,
		ActionType_BattleDouble = 13,
		ActionType_UnitProf = 14,
		ActionType_SanctuaryBuild = 15,
		ActionType_SanctuaryFacility = 16,
		ActionType_Weapon_Upgrade = 17,
		ActionType_Activereward = 18,
		ActionType_ComposeItem = 19,
		ActionType_LoginReward = 20,
		ActionType_NewUserLogin = 21,
		ActionType_HomeDailyTask = 22,
		ActionType_BattlePass = 23,
		ActionType_LevelReward = 24,
		ActionType_HomeUpgrade = 25,
		ActionType_BattlePassRepeat = 26,
		ActionType_TopUP = 27,
		ActionType_Achievement = 28,
		ActionType_LuckDraw = 29,
		ActionType_BattlePassShare = 30,
		ActionType_CDKey = 31,
		ActionType_HalfMonthLogin = 32,
		ActionType_MonthlyEvent = 33,
		ActionType_FriendEvent = 34,
		ActionType_WeekChanllenge = 35,
		ActionType_RoomCard = 36,
		ActionType_BindAccount = 37,
		ActionType_UserGrowthEvent = 38,
		ActionType_SendGift = 39,
		ActionType_SellItem = 40,
		ActionType_CollectRedeem = 41,
		ActionType_RandomPack = 42,
		ActionType_Clan = 43,
		ActionType_Bet = 44,
		ActionType_BetBonus = 45,
		ActionType_BetReturn = 46,
		ActionType_CarouselDraw = 47,
		ActionType_WeekFree = 48,
		ActionType_TutorialLevelReward = 49,
		ActionType_TournamentMiss = 50,
		ActionType_TournamentReward = 51,
		ActionType_RankingCard = 52,
		ActionType_BattleSupplyBox = 53,
		ActionType_BattlePassMission = 54,
		ActionType_SupplyBox = 55,
		ActionType_VipcardReceive = 56,
		ActionType_VipcardSign = 57,
		ActionType_Vipcard = 58,
		ActionType_Signcard = 59,
		ActionType_ChangeName = 60,
		ActionType_ServerCard = 61,
		ActionType_ExResourceDownload = 62,
		ActionType_CustomServer_Renewal = 63,
		_Count = 64,
		ESolarTablesEnum_MAX = 65
	};

	/**
	 * Enum Solarland.ETaskStatus
	 */
	enum class ETaskStatus : uint8_t
	{
		Runing = 0,
		Completed = 1,
		ReceiveAward = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ECostType
	 */
	enum class ECostType : uint8_t
	{
		NONE = 0,
		ELECTRONIC = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ETreasureBoxSpawnType
	 */
	enum class ETreasureBoxSpawnType : uint8_t
	{
		SingleRandom = 0,
		Group = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ETutorialUIType
	 */
	enum class ETutorialUIType : uint8_t
	{
		None = 0,
		Common = 1,
		Special = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ELevelRewardStatus
	 */
	enum class ELevelRewardStatus : uint8_t
	{
		NotClaimed = 0,
		Claimed = 1,
		Disable = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWidgetPlayAnimationFlag
	 */
	enum class EWidgetPlayAnimationFlag : uint8_t
	{
		None = 0,
		Finish = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EWidgetInteractionFlag
	 */
	enum class EWidgetInteractionFlag : uint8_t
	{
		None = 0,
		Pressed = 1,
		Released = 2,
		Clicked = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ETutorialStage
	 */
	enum class ETutorialStage : uint8_t
	{
		None = 0,
		Lobby = 1,
		BattleField = 2,
		Home = 3,
		TutorialLevel = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ETutorialUIParent
	 */
	enum class ETutorialUIParent : uint8_t
	{
		Parent = 0,
		UnderBattleRoot = 1,
		BattleRoot = 2,
		BattleRootGuide = 3,
		MiddleRoot = 4,
		CommonRoot = 5,
		Map = 6,
		BattleNoticeRoot = 7,
		Guide = 8,
		PopRoot = 9,
		TipsRoot = 10,
		NoticeRoot = 11,
		Loading = 12,
		Reconnecting = 13,
		ExternalToolsRoot = 14,
		MAX = 15
	};

	/**
	 * Enum Solarland.ETutorialConditionType
	 */
	enum class ETutorialConditionType : uint8_t
	{
		None = 0,
		Trigger = 1,
		Interrupt = 2,
		Finish = 3,
		ForeverClose = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ETutorialType
	 */
	enum class ETutorialType : uint8_t
	{
		TEvent = 0,
		TTick = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ETutorialTriggerType
	 */
	enum class ETutorialTriggerType : uint8_t
	{
		TickActivateTutorials = 0,
		AlreadyTriggeredMaxCount = 1,
		HasSpecifiedItem = 2,
		HasTakenDamage = 3,
		PlayerAcountLevel = 4,
		SprintingContinuously = 5,
		JumpBegin = 6,
		ShieldNotFull = 7,
		WidgetClicked = 8,
		CanUseSpecifiedVehicleAbility = 9,
		CanUseSpecifiedVehicleWeapon = 10,
		AirDropBoxLanded = 11,
		NearAirDropBox = 12,
		OpenBigMapUMG = 13,
		CanUseSpecifiedWeaponAbility = 14,
		CanOpenTreasureBox = 15,
		PlayerInTargetStage = 16,
		EquipSpecifiedWeapon = 17,
		FeatureUnlock = 18,
		ApproachTreasureBox = 19,
		BotAIDying = 20,
		RunningStep = 21,
		HasSpecifiedEquipmentByType = 22,
		TutorialLevelDone = 23,
		WeaponSlotHasSpecifiedItem = 24,
		HasUIPanelOpened = 25,
		SpecifiedPlayerProficiency = 26,
		PlayerUpgradeBattleLevel = 27,
		MAX = 28
	};

	/**
	 * Enum Solarland.EPlayerProficiency
	 */
	enum class EPlayerProficiency : uint8_t
	{
		None = 0,
		Rookie = 1,
		FPS = 2,
		Veteran = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EUAVRescueState
	 */
	enum class EUAVRescueState : uint8_t
	{
		None = 0,
		Idle = 1,
		Heal = 2,
		Navigate = 3,
		Rescue = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EWidgetPassiveMode
	 */
	enum class EWidgetPassiveMode : uint8_t
	{
		Normal = 0,
		Passive_Buff = 1,
		Passive_Debuff = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EVehicleRotateAnimationType
	 */
	enum class EVehicleRotateAnimationType : uint8_t
	{
		None = 0,
		Right = 1,
		Right01 = 2,
		Left = 3,
		Left01 = 4,
		Right02 = 5,
		Left02 = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EIronManHandPart
	 */
	enum class EIronManHandPart : uint8_t
	{
		LeftHand = 0,
		RightHand = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EIronManSoundEvent
	 */
	enum class EIronManSoundEvent : uint8_t
	{
		LaserHit = 0,
		MAX = 1
	};

	/**
	 * Enum Solarland.EPlayerInputMask
	 */
	enum class EPlayerInputMask : uint8_t
	{
		Invalidated = 0,
		VehicleBraking = 1,
		VehicleTrumpet = 2,
		VehicleAutoMove = 3,
		All = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EAssistLockState
	 */
	enum class EAssistLockState : uint8_t
	{
		None = 0,
		PreEnterAssistLock = 1,
		EnterAssistLock = 2,
		HoldAssistLock = 3,
		LeaveAssistLock = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EHoverVehicleVFXType
	 */
	enum class EHoverVehicleVFXType : uint8_t
	{
		Forward = 0,
		Backward = 1,
		Right = 2,
		Left = 3,
		Max = 4
	};

	/**
	 * Enum Solarland.EEnterWaterVFX
	 */
	enum class EEnterWaterVFX : uint8_t
	{
		HorizontalLightEffect = 0,
		HorizontalHeavyEffect = 1,
		VerticalLightEffect = 2,
		VerticalHeavyEffect = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EVehicleSpawnSourceType
	 */
	enum class EVehicleSpawnSourceType : uint8_t
	{
		CommonSpawn = 0,
		VehicleSummonWeapon = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EVehicleControlUIType
	 */
	enum class EVehicleControlUIType : uint8_t
	{
		Vehicle = 0,
		Character = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EVehicleRotateCondition
	 */
	enum class EVehicleRotateCondition : uint8_t
	{
		None = 0,
		Forward = 1,
		Backward = 2,
		Right = 3,
		Left = 4,
		All = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EVehicleOpenTips
	 */
	enum class EVehicleOpenTips : uint8_t
	{
		FloorCanNotOpen = 0,
		SpeedCanNotOpen = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESiegeVehicleAnimation
	 */
	enum class ESiegeVehicleAnimation : uint8_t
	{
		CloseIdle = 0,
		OpenIdle = 1,
		Fire = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EVehicleDamageStatus
	 */
	enum class EVehicleDamageStatus : uint8_t
	{
		Normal = 0,
		Damaged = 1,
		SeriouslyDamaged = 2,
		BrokenDanger = 3,
		Broken = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EVehicleAnimationState
	 */
	enum class EVehicleAnimationState : uint8_t
	{
		None = 0,
		Jump = 1,
		Dash = 2,
		TakingOff = 3,
		Cruising = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ERocketFireMode
	 */
	enum class ERocketFireMode : uint8_t
	{
		NomalFire = 0,
		PrecisionFire = 1,
		Max = 2
	};

	/**
	 * Enum Solarland.EVehiclePageType
	 */
	enum class EVehiclePageType : uint8_t
	{
		Lobby = 0,
		VehicleBag = 1,
		BattlePass = 2,
		LuckDraw = 3,
		GetReward = 4,
		GrowTask = 5,
		Shop = 6,
		CarouselDraw = 7,
		SupplyBoxDetail = 8,
		SupplyBoxRaffle = 9,
		Max = 10
	};

	/**
	 * Enum Solarland.EVehicleSpawnType
	 */
	enum class EVehicleSpawnType : uint8_t
	{
		SingleRandom = 0,
		Group = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EVehicleState
	 */
	enum class EVehicleState : uint8_t
	{
		None = 0,
		Ground = 1,
		Air = 2,
		Sliding = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarWeaponSpreadState
	 */
	enum class ESolarWeaponSpreadState : uint8_t
	{
		Standby = 0,
		Approach = 1,
		Recover = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESolarBlackHoleParticle
	 */
	enum class ESolarBlackHoleParticle : uint8_t
	{
		ForceField = 0,
		CoreFadeIn = 1,
		CoreFadeOut = 2,
		CoreLoop = 3,
		CoreHit = 4,
		Explode = 5,
		CharacterDebuff = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.ESolarBlackHoleState
	 */
	enum class ESolarBlackHoleState : uint8_t
	{
		None = 0,
		Startup = 1,
		Ready = 2,
		Active = 3,
		End = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EWeaponOverloadState
	 */
	enum class EWeaponOverloadState : uint8_t
	{
		NormalDecrease = 0,
		FireSuspend = 1,
		ForceOverload = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWeaponFireModeType
	 */
	enum class EWeaponFireModeType : uint8_t
	{
		UnArm = 0,
		Primary = 1,
		Secondary = 2,
		Tertiary = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EWeaponScopeType
	 */
	enum class EWeaponScopeType : uint8_t
	{
		None = 0,
		ScopeX0 = 1,
		ScopeX1 = 2,
		ScopeX2 = 3,
		ScopeX3 = 4,
		ScopeX4 = 5,
		ScopeX6 = 6,
		ScopeX8 = 7,
		Count = 8,
		MAX = 9
	};

	/**
	 * Enum Solarland.EGearState
	 */
	enum class EGearState : uint8_t
	{
		Reverse = 0,
		Neutral = 1,
		Forward = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EUIRoot
	 */
	enum class EUIRoot : uint8_t
	{
		None = 0,
		UnderBattleRoot = 1,
		BattleRoot = 2,
		BattleRootGuide = 3,
		MiddleRoot = 4,
		CommonRoot = 5,
		Map = 6,
		BattleNoticeRoot = 7,
		Guide = 8,
		PopRoot = 9,
		TipsRoot = 10,
		NoticeRoot = 11,
		Loading = 12,
		Reconnecting = 13,
		ExternalToolsRoot = 14,
		MAX = 15
	};

	/**
	 * Enum Solarland.EInputEventHandleType
	 */
	enum class EInputEventHandleType : uint8_t
	{
		Unhandle = 0,
		SimulateKey = 1,
		BroadcastEvent = 2,
		SimulateTouch = 3,
		NoKeyOnly = 4,
		NoEventOnly = 5,
		NoTouchOnly = 6,
		HandleAll = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.ETouchMovePriority
	 */
	enum class ETouchMovePriority : uint8_t
	{
		Highest = 0,
		Higher = 1,
		Normal = 2,
		Lower = 3,
		Lowest = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EZiplineSide
	 */
	enum class EZiplineSide : uint8_t
	{
		None = 0,
		Cable = 1,
		A = 2,
		B = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EZiplineType
	 */
	enum class EZiplineType : uint8_t
	{
		Horizontal = 0,
		Vertical = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESoundPoolSimpleRule
	 */
	enum class ESoundPoolSimpleRule : uint8_t
	{
		Random = 0,
		RandomNoRepeat = 1,
		Sequential = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESoundGroupPlayContextEnum
	 */
	enum class ESoundGroupPlayContextEnum : uint8_t
	{
		None = 0,
		IsSelf = 1,
		IsTeammate = 2,
		IsAttackingOther = 3,
		IsAttachedByOther = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarImageProgressHalfCirclePrivotType
	 */
	enum class ESolarImageProgressHalfCirclePrivotType : uint8_t
	{
		MidLeft = 0,
		MidRight = 1,
		MidBottom = 2,
		MidTop = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarImageProgressQuaterCirclePrivotType
	 */
	enum class ESolarImageProgressQuaterCirclePrivotType : uint8_t
	{
		LeftBottom = 0,
		RightBottom = 1,
		LeftTop = 2,
		RightTop = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESolarImageProgressLineDirType
	 */
	enum class ESolarImageProgressLineDirType : uint8_t
	{
		Horizantal = 0,
		Vertical = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarImageProgressType
	 */
	enum class ESolarImageProgressType : uint8_t
	{
		None = 0,
		Line = 1,
		QuarterCircle = 2,
		HalfCircle = 3,
		Circle = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.ESolarImageFillType
	 */
	enum class ESolarImageFillType : uint8_t
	{
		Normal = 0,
		Mirror = 1,
		Quarter = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.ESummonItemType
	 */
	enum class ESummonItemType : uint8_t
	{
		SolidSummonItem = 0,
		VirtualSummonItem = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarSummonSoundType
	 */
	enum class ESolarSummonSoundType : uint8_t
	{
		SummonSoundType_1P = 0,
		SummonSoundType_3P = 1,
		SummonSoundType_3P_Enemy = 2,
		SummonSoundType_MAX = 3
	};

	/**
	 * Enum Solarland.ERefreshCause
	 */
	enum class ERefreshCause : uint8_t
	{
		ECause_None = 0,
		ECause_OutOrIntoScreen = 1,
		ECause_RescueStateChange = 2,
		ECause_MAX = 3
	};

	/**
	 * Enum Solarland.ESplineMeshType
	 */
	enum class ESplineMeshType : uint8_t
	{
		DEFAULT = 0,
		START = 1,
		END = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EBackpackInfoPageType
	 */
	enum class EBackpackInfoPageType : uint8_t
	{
		Level = 0,
		Skill = 1,
		Max = 2
	};

	/**
	 * Enum Solarland.ETweenInterpolationType
	 */
	enum class ETweenInterpolationType : uint8_t
	{
		Easing = 0,
		Curve = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EDefenderTeamType
	 */
	enum class EDefenderTeamType : uint8_t
	{
		MyTeam = 0,
		DefenderTeam = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EPlayerWidgetState
	 */
	enum class EPlayerWidgetState : uint8_t
	{
		NORMAL = 0,
		DRIVER = 1,
		PASSGNER = 2,
		EQUIPVEHICLEWEAPON = 3,
		CRUISING = 4,
		PATACHUTING = 5,
		SWIMMING = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.ELocalNoticeType
	 */
	enum class ELocalNoticeType : uint8_t
	{
		Revenge = 0,
		KillDown = 1,
		ClearTeam = 2,
		ShutDown = 3,
		KillDefender = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EUIWeaponPartState
	 */
	enum class EUIWeaponPartState : uint8_t
	{
		NotEquip = 0,
		Equipped = 1,
		CantEquip = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWidgetVisibilityFlags
	 */
	enum class EWidgetVisibilityFlags : uint8_t
	{
		None = 0,
		ChatSwitch = 1,
		ChatMsgSending = 2,
		ConnectionState = 3,
		TalentState = 4,
		TalentValidation = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EStealthParamType
	 */
	enum class EStealthParamType : uint8_t
	{
		None = 0,
		Type_1P = 1,
		Type_3P = 2,
		Type_3P_Enemy = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EWholeShieldState
	 */
	enum class EWholeShieldState : uint8_t
	{
		Begin = 0,
		InProgress = 1,
		End = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EVisualSoundDetectionRule
	 */
	enum class EVisualSoundDetectionRule : uint8_t
	{
		XYZ = 0,
		XY = 1,
		XY_FiniteZ = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWeaponAnimState
	 */
	enum class EWeaponAnimState : uint8_t
	{
		Idle = 0,
		Fire = 1,
		AltFire = 2,
		Reload = 3,
		Overload = 4,
		OpenScope = 5,
		CloseScope = 6,
		Bolt = 7,
		Preview = 8,
		Summon = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.ESolarWeaponLODState
	 */
	enum class ESolarWeaponLODState : uint8_t
	{
		Hold = 0,
		OpenScope = 1,
		Discard = 2,
		AttachedOnBackpack = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.EWeaponSkinType
	 */
	enum class EWeaponSkinType : uint8_t
	{
		Material = 0,
		Mesh = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EWeaponMechanicalSideFlag
	 */
	enum class EWeaponMechanicalSideFlag : uint8_t
	{
		None = 0,
		OnGround = 1,
		Unequip = 2,
		OpenScope = 3,
		ForceFiring = 4,
		ChargedFire = 5,
		NeedBolt = 6,
		GatlingRolling = 7,
		DetectedWall = 8,
		NeedRechamber = 9,
		NoAmmoReserved = 10,
		MAX = 11
	};

	/**
	 * Enum Solarland.EWeaponMechanicalUniqueState
	 */
	enum class EWeaponMechanicalUniqueState : uint8_t
	{
		None = 0,
		Idle = 1,
		PreFire = 2,
		RealFire = 3,
		Rechamber = 4,
		Reloading = 5,
		Bolting = 6,
		Charging = 7,
		Overloading = 8,
		KeyUPHolding = 9,
		MAX = 10
	};

	/**
	 * Enum Solarland.EWeaponUpgradeType
	 */
	enum class EWeaponUpgradeType : uint8_t
	{
		Part = 0,
		SecondaryAmmo = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EWeaponNetToClientProto
	 */
	enum class EWeaponNetToClientProto : uint8_t
	{
		CSkin_RefreshSkin = 0,
		CUpgrade_UpLevel = 1,
		CUpgrade_ExpRefresh = 2,
		CUpgrade_ReplaceUpgradeRoute = 3,
		CParts_ReplacePart = 4,
		CParts_ReplaceAmmo = 5,
		CParts_InitFinish = 6,
		CAnimation_RefreshState = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.EWeaponNetToServerProto
	 */
	enum class EWeaponNetToServerProto : uint8_t
	{
		SUpgrade_AddExp = 0,
		SParts_Hold = 1,
		SAnimation_RefreshState = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EWeaponPartVisibilityChangeFlag
	 */
	enum class EWeaponPartVisibilityChangeFlag : uint8_t
	{
		Default = 0,
		BySignificance = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EFixedValueMode
	 */
	enum class EFixedValueMode : uint8_t
	{
		Raw = 0,
		Increment = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EWeaponSkewAdjustmentType
	 */
	enum class EWeaponSkewAdjustmentType : uint8_t
	{
		Pitch = 0,
		Yaw = 1,
		Roll = 2,
		XOffset = 3,
		YOffset = 4,
		ZOffset = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EWeaponSkewInputType
	 */
	enum class EWeaponSkewInputType : uint8_t
	{
		PitchSpeed = 0,
		YawSpeed = 1,
		HorizontalSpeed = 2,
		VerticalSpeed = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESprayingRecoveryMode
	 */
	enum class ESprayingRecoveryMode : uint8_t
	{
		SyncWithRecoil = 0,
		RecoverByCurve = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EWeaponAttributeParamType
	 */
	enum class EWeaponAttributeParamType : uint8_t
	{
		ParamA = 0,
		ParamB = 1,
		ParamC = 2,
		ParamD = 3,
		MAX = 4
	};

	/**
	 * Enum Solarland.ESpreadScaleDecreaseMode
	 */
	enum class ESpreadScaleDecreaseMode : uint8_t
	{
		DecreaseByFixedSpeed = 0,
		DecreaseByFixedTime = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ESolarWeaponFireInputButtonState
	 */
	enum class ESolarWeaponFireInputButtonState : uint8_t
	{
		FireWaiting = 0,
		FirePressed = 1,
		CancelWaiting = 2,
		CancelPressed = 3,
		Invalid = 4,
		MAX = 5
	};

	/**
	 * Enum Solarland.EWSCurWeaponUpdateType
	 */
	enum class EWSCurWeaponUpdateType : uint8_t
	{
		Switch = 0,
		PartUpdate = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.ECheckFireResultType
	 */
	enum class ECheckFireResultType : uint8_t
	{
		None = 0,
		Fire = 1,
		Reload = 2,
		OpenScope = 3,
		CloseScope = 4,
		Charge = 5,
		EndCharge = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EOperateScopeStateReason
	 */
	enum class EOperateScopeStateReason : uint8_t
	{
		None = 0,
		OpenScopeButton = 1,
		OpenQuickAds = 2,
		Open = 3,
		CloseReload = 4,
		CloseBolt = 5,
		Close = 6,
		AllFlag = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.EBehaviorExpID
	 */
	enum class EBehaviorExpID : uint8_t
	{
		Default = 0,
		KillPlayer = 1,
		AssistPlayer = 2,
		DamageExp = 3,
		KillNpc = 4,
		AssistNpc = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EClientRecieveProto
	 */
	enum class EClientRecieveProto : uint8_t
	{
		PickUpWeapon = 0,
		DropWeapon = 1,
		SwitchWeaponFinish = 2,
		ReplaceWeapon = 3,
		WeaponDataUpdate = 4,
		AddExpMsg = 5,
		ClearWeapons = 6,
		ReloadCompleted = 7,
		MAX = 8
	};

	/**
	 * Enum Solarland.EServerRecieveProto
	 */
	enum class EServerRecieveProto : uint8_t
	{
		SwitchWeapon = 0,
		Reload = 1,
		ShowOrHideCurrent = 2,
		GameStaticsWeaponSkill = 3,
		DropItemWeapon = 4,
		ReplaceUpgradeRoute = 5,
		SwapWeapon = 6,
		MAX = 7
	};

	/**
	 * Enum Solarland.EAIPlayerServerRecieveProto
	 */
	enum class EAIPlayerServerRecieveProto : uint8_t
	{
		PickUpWeapon = 0,
		MAX = 1
	};

	/**
	 * Enum Solarland.EAIPlayerClientRecieveProto
	 */
	enum class EAIPlayerClientRecieveProto : uint8_t
	{
		PickUpWeapon = 0,
		SwitchWeapon = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EVehicleWeaponServerRecieveProto
	 */
	enum class EVehicleWeaponServerRecieveProto : uint8_t
	{
		Reload = 0,
		StartReload = 1,
		MAX = 2
	};

	/**
	 * Enum Solarland.EWeaponSystemVehicleState
	 */
	enum class EWeaponSystemVehicleState : uint8_t
	{
		PreCharging = 0,
		PreFire = 1,
		PreReload = 2,
		PreOpenScope = 3,
		PreCloseScope = 4,
		PreFireOverload = 5,
		MAX = 6
	};

	/**
	 * Enum Solarland.EWeaponSystemVehicleProto
	 */
	enum class EWeaponSystemVehicleProto : uint8_t
	{
		Equip = 0,
		UnEquip = 1,
		StartReload = 2,
		MAX = 3
	};

	/**
	 * Enum Solarland.EMarkButtonState
	 */
	enum class EMarkButtonState : uint8_t
	{
		Normal = 0,
		Pressed = 1,
		Selecting = 2,
		Canceled = 3,
		Respond = 4,
		MAX = 5
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct Solarland.PlayAnimationParams
	 * Size -> 0x0040
	 */
	struct FPlayAnimationParams
	{
	public:
		unsigned char                                              UnknownData_7UZY[0x40];                                  // 0x0000(0x0040) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.WrappedLocalTextID
	 * Size -> 0x0004
	 */
	struct FWrappedLocalTextID
	{
	public:
		int32_t                                                    LocalTextId;                                             // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ActionWheelStyle
	 * Size -> 0x0070
	 */
	struct FActionWheelStyle
	{
	public:
		struct FLinearColor                                        BlackgroundColor;                                        // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        InnerCircleColor;                                        // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        BlackgroundSelectedColor;                                // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        InnerCircleSelectedColor;                                // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        WheelGradientColor;                                      // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        WheelSelectedGradientColor;                              // 0x0050(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           IconSize;                                                // 0x0060(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      IconOffset;                                              // 0x0068(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SelectedIconOffset;                                      // 0x006C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ActionWheelCommand
	 * Size -> 0x0038
	 */
	struct FActionWheelCommand
	{
	public:
		EActionWheelCommandType                                    CommandType;                                             // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SWFB[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              ConfigKey;                                               // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FWrappedLocalTextID                                 DisplayName;                                             // 0x0018(0x0004) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0QKP[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSoftObjectPath                                     Icon;                                                    // 0x0020(0x0018) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ActionWheelConfig
	 * Size -> 0x00D8 (FullSize[0x00E0] - InheritedSize[0x0008])
	 */
	struct FActionWheelConfig : public FTableRowBase
	{
	public:
		int32_t                                                    groupid;                                                 // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FWrappedLocalTextID                                 Title;                                                   // 0x000C(0x0004) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    StyleID;                                                 // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RHG4[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              WheelDes;                                                // 0x0018(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DisplayDelay;                                            // 0x0028(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DisplayDelay_Gamepad;                                    // 0x002C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PointMoveSensitivity;                                    // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PointMoveSensitivity_Gamepad;                            // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           Offset;                                                  // 0x0038(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass* WheelFunctionBP;                                         // 0x0040(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              InputActionName;                                         // 0x0048(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EActionWheelOperateType                                    OperateType;                                             // 0x0058(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PPNF[0x3];                                   // 0x0059(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FActionWheelStyle                                   ActionWheelStyle;                                        // 0x005C(0x0070) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3QCA[0x4];                                   // 0x00CC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FActionWheelCommand>                         ActionWheelCommands;                                     // 0x00D0(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ActorEffectPool
	 * Size -> 0x0010
	 */
	struct FActorEffectPool
	{
	public:
		TArray<class UActorEffect*>                                EffectInstances;                                         // 0x0000(0x0010) ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct Solarland.ActorEffectControllerPool
	 * Size -> 0x0010
	 */
	struct FActorEffectControllerPool
	{
	public:
		TArray<class UActorEffectController*>                      ControllerInstances;                                     // 0x0000(0x0010) ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct Solarland.MaterialChangePriorityGroup
	 * Size -> 0x0010
	 */
	struct FMaterialChangePriorityGroup
	{
	public:
		TArray<struct FGameplayTag>                                Tags;                                                    // 0x0000(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ForceChangeMaterialInfos
	 * Size -> 0x0070
	 */
	struct FForceChangeMaterialInfos
	{
	public:
		struct FGameplayTagContainer                               MaterialPriorityTags;                                    // 0x0000(0x0020) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		unsigned char                                              MaterialPaths[0x50];                                     // 0x0020(0x0050) UNKNOWN PROPERTY: SetProperty
	};

	/**
	 * ScriptStruct Solarland.MaterialChangeHandle
	 * Size -> 0x0008
	 */
	struct FMaterialChangeHandle
	{
	public:
		unsigned char                                              UnknownData_6C0A[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.AddMaterialChangeParams
	 * Size -> 0x0028
	 */
	struct FAddMaterialChangeParams
	{
	public:
		unsigned char                                              UnknownData_O11W[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGameplayTag                                        PriorityTag;                                             // 0x0008(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EMaterialChangeConflictResolveStrategy                     ResolveStrategy;                                         // 0x0010(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EMaterialChangeTextureOverrideMode                         TextureOverrideMode;                                     // 0x0011(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_H998[0x6];                                   // 0x0012(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FName>                                        TextureParameterNamesToOverride;                         // 0x0018(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AddMultiplePassMaterialChangeParams
	 * Size -> 0x0040
	 */
	struct FAddMultiplePassMaterialChangeParams
	{
	public:
		struct FGameplayTag                                        PriorityTag;                                             // 0x0000(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EMaterialChangeConflictResolveStrategy                     ResolveStrategy;                                         // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EMultiplePassMaterialChangeCompatibilityMode               CompatibilityMode;                                       // 0x0009(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_62JM[0x6];                                   // 0x000A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGameplayTagContainer                               SpecifiedPriorityTags;                                   // 0x0010(0x0020) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		bool                                                       bNeedMultiplePass : 1;                                   // 0x0030(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bForceFrontFaceCull : 1;                                 // 0x0030(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIgnoreTranslucentSection : 1;                           // 0x0030(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIgnoreMaskedSection : 1;                                // 0x0030(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bTreatAsBackgroundForOcclusion : 1;                      // 0x0030(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUseAsOccluder : 1;                                      // 0x0030(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIgnoreOcclusionCull : 1;                                // 0x0030(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRenderMainPassStencil : 1;                              // 0x0030(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSetTranslucencySortPriorityOnly : 1;                    // 0x0031(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRenderCustomDepth : 1;                                  // 0x0031(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7XQM[0x2];                                   // 0x0032(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    MainPassDepthStencilValue;                               // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    TranslucencySortPriority;                                // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CustomDepthStencilValue;                                 // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.LimitedMeshContainer
	 * Size -> 0x0010
	 */
	struct FLimitedMeshContainer
	{
	public:
		TArray<class UMeshComponent*>                              Meshes;                                                  // 0x0000(0x0010) ExportObject, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.MaterialChange
	 * Size -> 0x0038
	 */
	struct FMaterialChange
	{
	public:
		unsigned char                                              UnknownData_MHQA[0x28];                                  // 0x0000(0x0028) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UMaterialInterface*>                          Materials;                                               // 0x0028(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.MeshMaterialInfo
	 * Size -> 0x0050
	 */
	struct FMeshMaterialInfo
	{
	public:
		unsigned char                                              UnknownData_CP2R[0x18];                                  // 0x0000(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FMaterialChange>                             NormalMaterialChanges;                                   // 0x0018(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E2DT[0x18];                                  // 0x0028(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FMaterialChange>                             MultiplePassMaterialChanges;                             // 0x0040(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ActorMaterialInfo
	 * Size -> 0x0170
	 */
	struct FActorMaterialInfo
	{
	public:
		unsigned char                                              UnknownData_S1MF[0x20];                                  // 0x0000(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<struct FMaterialChangeHandle, class UMaterialInterface*> SourceMaterials;                                         // 0x0020(0x0050) NativeAccessSpecifierPublic
		TMap<struct FMaterialChangeHandle, struct FAddMaterialChangeParams> NormalParams;                                            // 0x0070(0x0050) NativeAccessSpecifierPublic
		TMap<struct FMaterialChangeHandle, struct FAddMultiplePassMaterialChangeParams> MultiplePassParams;                                      // 0x00C0(0x0050) NativeAccessSpecifierPublic
		TMap<struct FMaterialChangeHandle, struct FLimitedMeshContainer> LimitedMeshes;                                           // 0x0110(0x0050) ContainsInstancedReference, NativeAccessSpecifierPublic
		TArray<struct FMeshMaterialInfo>                           MeshMaterials;                                           // 0x0160(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ActorParticleEffectSpawnInfo
	 * Size -> 0x0070
	 */
	struct FActorParticleEffectSpawnInfo
	{
	public:
		unsigned char                                              ParticleSystem[0x28];                                    // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		EActorParticleEffectAttachOption                           AttachOption;                                            // 0x0028(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_F4SI[0x3];                                   // 0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                AttachPointName;                                         // 0x002C(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAttachLocation                                            LocationType;                                            // 0x0034(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_O3EU[0x3];                                   // 0x0035(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             Location;                                                // 0x0038(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            Rotation;                                                // 0x0044(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FVector                                             Scale;                                                   // 0x0050(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAutoActivate;                                           // 0x005C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAutoDestroy;                                            // 0x005D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEnablePooling;                                          // 0x005E(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAbsoluteRotation;                                       // 0x005F(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class FName>                                        ComponentTags;                                           // 0x0060(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AirDropSkillData
	 * Size -> 0x0008
	 */
	struct FAirDropSkillData
	{
	public:
		float                                                      GameSeconds;                                             // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    OutcomeID;                                               // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AirDropSkillDatas
	 * Size -> 0x0010
	 */
	struct FAirDropSkillDatas
	{
	public:
		TArray<struct FAirDropSkillData>                           OutcomeSetting;                                          // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.WrappedLevelToIdMap
	 * Size -> 0x0050
	 */
	struct FWrappedLevelToIdMap
	{
	public:
		TMap<int32_t, int32_t>                                     LevelToId;                                               // 0x0000(0x0050) Edit, BlueprintVisible, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.WrappedIdCount
	 * Size -> 0x0008
	 */
	struct FWrappedIdCount
	{
	public:
		int32_t                                                    ID;                                                      // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    count;                                                   // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AirDropShieldOutcomeConfig
	 * Size -> 0x0018
	 */
	struct FAirDropShieldOutcomeConfig
	{
	public:
		int32_t                                                    MinLevel;                                                // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxLevel;                                                // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FWrappedIdCount>                             CompensationOutcomes;                                    // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AirDropWeaponPartOutcomeConfig
	 * Size -> 0x0020
	 */
	struct FAirDropWeaponPartOutcomeConfig
	{
	public:
		int32_t                                                    count;                                                   // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MinLevel;                                                // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ScopeMinLevel;                                           // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxLevel;                                                // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FWrappedIdCount>                             CompensationOutcomes;                                    // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AirDropSupplyOutcomeConfig
	 * Size -> 0x0018
	 */
	struct FAirDropSupplyOutcomeConfig
	{
	public:
		int32_t                                                    count;                                                   // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ASOX[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FWrappedIdCount>                             CompensationItems;                                       // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AirDropAllOutcomeConfig
	 * Size -> 0x0068
	 */
	struct FAirDropAllOutcomeConfig
	{
	public:
		float                                                      GameSeconds;                                             // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PV5X[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAirDropShieldOutcomeConfig                         ShieldOutcome;                                           // 0x0008(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		struct FAirDropWeaponPartOutcomeConfig                     WeaponPartOutcome;                                       // 0x0020(0x0020) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		struct FAirDropSupplyOutcomeConfig                         SupplyOutcome;                                           // 0x0040(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		TArray<struct FWrappedIdCount>                             GeneralOutcome;                                          // 0x0058(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AirDropAllOutcomeConfigArray
	 * Size -> 0x0010
	 */
	struct FAirDropAllOutcomeConfigArray
	{
	public:
		TArray<struct FAirDropAllOutcomeConfig>                    OutcomesOverTime;                                        // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.SolarItemData
	 * Size -> 0x00AC (FullSize[0x00B8] - InheritedSize[0x000C])
	 */
	struct FSolarItemData : public FFastArraySerializerItem
	{
	public:
		int32_t                                                    ItemID;                                                  // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int64_t                                                    ThisID;                                                  // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Name;                                                    // 0x0018(0x0010) Edit, BlueprintVisible, ZeroConstructor, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Icon;                                                    // 0x0028(0x0010) Edit, BlueprintVisible, ZeroConstructor, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Info;                                                    // 0x0038(0x0010) Edit, BlueprintVisible, ZeroConstructor, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    count;                                                   // 0x0048(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemType                                                  ItemType;                                                // 0x004C(0x0001) ELEMENT_SIZE_MISMATCH Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ES0U[0x3];                                   // 0x004D(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		int32_t                                                    Quality;                                                 // 0x0050(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxPile;                                                 // 0x0054(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IfReplace;                                               // 0x0058(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_F25U[0x7];                                   // 0x0059(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              AbilityBP;                                               // 0x0060(0x0010) Edit, BlueprintVisible, ZeroConstructor, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              ItemBP;                                                  // 0x0070(0x0010) Edit, BlueprintVisible, ZeroConstructor, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    DropTime;                                                // 0x0080(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    UnPickupTime;                                            // 0x0084(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsRecommend;                                             // 0x0088(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bDirty;                                                  // 0x0089(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsPickupLock;                                            // 0x008A(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0C9E[0x5];                                   // 0x008B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int64_t                                                    UserId;                                                  // 0x0090(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Level;                                                   // 0x0098(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Prize;                                                   // 0x009C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CurValue;                                                // 0x00A0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       UseOnPickup;                                             // 0x00A4(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemAppearanceType                                        AppearanceType;                                          // 0x00A5(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUpdateOverlap;                                          // 0x00A6(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Z79L[0x1];                                   // 0x00A7(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    SourceType;                                              // 0x00A8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KQ19[0xC];                                   // 0x00AC(0x000C) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.SolarLandscapeListenerConfig
	 * Size -> 0x0010
	 */
	struct FSolarLandscapeListenerConfig
	{
	public:
		bool                                                       bListenLandscape;                                        // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EOnLSModifiedStrategy                                      LSModifiedStrategy;                                      // 0x0001(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAdjustRotate;                                           // 0x0002(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EOnLSDestroyStrategy                                       LSDestroyStrategy;                                       // 0x0003(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             FreeFallBoxExtent;                                       // 0x0004(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.SolarItemDataArray
	 * Size -> 0x0010 (FullSize[0x0118] - InheritedSize[0x0108])
	 */
	struct FSolarItemDataArray : public FFastArraySerializer
	{
	public:
		TArray<struct FSolarItemData>                              ItemDatas;                                               // 0x0108(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.SolarDamageInfo
	 * Size -> 0x0040
	 */
	struct FSolarDamageInfo
	{
	public:
		class AActor* TargetActor;                                             // 0x0000(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor* SourceActor;                                             // 0x0008(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor* DamageCauserActor;                                       // 0x0010(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      OriginalDamage;                                          // 0x0018(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      OriginalDamageForVehicle;                                // 0x001C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SXZK[0x4];                                   // 0x0020(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		ESCMDamageType                                             DamageType;                                              // 0x0024(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BK7X[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DamageRadial;                                            // 0x0028(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRadialIgnoreCollision : 1;                              // 0x002C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRadialIgnoreVehicle : 1;                                // 0x002C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEnableSelfDamage : 1;                                   // 0x002C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCheckSourceToTargetCollision : 1;                       // 0x002C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bApplyToSource : 1;                                      // 0x002C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bJustForShield : 1;                                      // 0x002C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V0OX[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ExplosionMinDistance;                                    // 0x0030(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExplosionMaxDistance;                                    // 0x0034(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat* ExplosionDistanceScaleCurve;                             // 0x0038(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AirlineData
	 * Size -> 0x0028
	 */
	struct FAirlineData
	{
	public:
		float                                                      AirlineHeight;                                           // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AirlineSpeed;                                            // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           StartPoint;                                              // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           EndPoint;                                                // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           RealStartPoint;                                          // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           RealEndPoint;                                            // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.VehicleVFX
	 * Size -> 0x0090
	 */
	struct FVehicleVFX
	{
	public:
		unsigned char                                              Particle[0x28];                                          // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		class FName                                                AttachedSocket;                                          // 0x0028(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTransform                                          OffsetTransform;                                         // 0x0030(0x0030) Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		class UCurveFloat* ActivateCurve;                                           // 0x0060(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                ParameterName;                                           // 0x0068(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3N3P[0x20];                                  // 0x0070(0x0020) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.FireChargeData
	 * Size -> 0x00C0
	 */
	struct FFireChargeData
	{
	public:
		bool                                                       IfContinuousCharge;                                      // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VSNX[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ChargeTime;                                              // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat* ChargeDamageRadiusCurve;                                 // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat* ChargeDamageMagnificationCurve;                          // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IfPenetrable;                                            // 0x0018(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7G6E[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAmmoConfig* OverrideAmmo;                                            // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    OverrideAmmoID;                                          // 0x0028(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RHCC[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              ChargeSoundName;                                         // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              ChargeSoundEnemyName;                                    // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              FireSoundName;                                           // 0x0050(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              FireSoundEnemyName;                                      // 0x0060(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IfBurst;                                                 // 0x0070(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GJ39[0x7];                                   // 0x0071(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat* BulletBurstCountCurve;                                   // 0x0078(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IfCostToChargeScale;                                     // 0x0080(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ICUM[0x3];                                   // 0x0081(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    FireCostFullShot;                                        // 0x0084(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IfForceFullShotCost;                                     // 0x0088(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bNeedPlayCameraShake;                                    // 0x0089(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0AC8[0x6];                                   // 0x008A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat* AmmoSpeedScaleCurve;                                     // 0x0090(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat* AmmoEffectXScaleCurve;                                   // 0x0098(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat* AmmoEffectYZScaleCurve;                                  // 0x00A0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat* OverloadCurve;                                           // 0x00A8(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ChargeAnimationRate;                                     // 0x00B0(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V04R[0x4];                                   // 0x00B4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat* DeflectionAngleCurve;                                    // 0x00B8(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.WeaponFireTPPAnimConfig
	 * Size -> 0x0028
	 */
	struct FWeaponFireTPPAnimConfig
	{
	public:
		float                                                      SingleFirePulse;                                         // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SingleStiffnessCoefficient;                              // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LoopFirePulse;                                           // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LoopStiffnessCoefficient;                                // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RecoverSpeed;                                            // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BlendSpaceScale;                                         // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UBlendSpace* BlendSpace;                                              // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_N346[0x8];                                   // 0x0020(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.WeaponFireFPPAnimConfig
	 * Size -> 0x0070
	 */
	struct FWeaponFireFPPAnimConfig
	{
	public:
		float                                                      SingleFireStraightPulse;                                 // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SingleStiffnessCoefficient;                              // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SingleFireBackwardOffset;                                // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LoopFireStraightPulse;                                   // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LoopStiffnessCoefficient;                                // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LoopFireBackwardOffset;                                  // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat* StraightStiffnessCurve;                                  // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StraightRecoverSpeed;                                    // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             ShakePivotOffset;                                        // 0x0024(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FVector2D>                                   ShakeOffsets;                                            // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FRotator>                                    ShakeRotations;                                          // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bNeedEndShake;                                           // 0x0050(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YWVH[0x7];                                   // 0x0051(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveVector* EndShakeOffsetCurve;                                     // 0x0058(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveVector* EndShakeRotateCurve;                                     // 0x0060(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TUPZ[0x8];                                   // 0x0068(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.AmmonRecoilStruct
	 * Size -> 0x0028
	 */
	struct FAmmonRecoilStruct
	{
	public:
		float                                                      CostTime;                                                // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1DKZ[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat* RecoilRangeCurve;                                        // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    APointCurveKeyIndex;                                     // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      APointMin;                                               // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      APointMax;                                               // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    BPointCurveKeyIndex;                                     // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BPointMin;                                               // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BPointMax;                                               // 0x0024(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AmmonVerticalRecoilStruct
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	struct FAmmonVerticalRecoilStruct : public FAmmonRecoilStruct
	{
	public:
		class UCurveFloat* ContinuousFireWeightCurve;                               // 0x0028(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AmmonHorizontalRecoilStruct
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	struct FAmmonHorizontalRecoilStruct : public FAmmonRecoilStruct
	{
	public:
		class UCurveVector* ContinuousFireInfoCurve;                                 // 0x0028(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AmmonRecoilRollStruct
	 * Size -> 0x0018 (FullSize[0x0040] - InheritedSize[0x0028])
	 */
	struct FAmmonRecoilRollStruct : public FAmmonRecoilStruct
	{
	public:
		class UCurveFloat* RollProbabilityCurve;                                    // 0x0028(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ADSRollCOP;                                              // 0x0030(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_J0Z9[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat* ContinuousFireWeightCurve;                               // 0x0038(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AmmonRecoilCrossHair
	 * Size -> 0x0024
	 */
	struct FAmmonRecoilCrossHair
	{
	public:
		float                                                      VMaxDistanceOffSetScale;                                 // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      VVibrationDurationScale;                                 // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      VSingleOffSetScale;                                      // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      VContinuousOffSetScale;                                  // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HMaxDistanceOffSetScale;                                 // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HVibrationDurationScale;                                 // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HSingleOffSetScale;                                      // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HContinuousOffSetScale;                                  // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HOffSetProbabilityScale;                                 // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AmmonRecoilScopeRoll
	 * Size -> 0x0010 (FullSize[0x0038] - InheritedSize[0x0028])
	 */
	struct FAmmonRecoilScopeRoll : public FAmmonRecoilStruct
	{
	public:
		class UCurveFloat* RollProbabilityCurve;                                    // 0x0028(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat* ContinuousFireWeightCurve;                               // 0x0030(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AmmonRecoilScope
	 * Size -> 0x00B8
	 */
	struct FAmmonRecoilScope
	{
	public:
		bool                                                       EnableScopeVibration;                                    // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       EnableCrossHairVibration;                                // 0x0001(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       EnableScopeRoll;                                         // 0x0002(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_M4VO[0x1];                                   // 0x0003(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ScopeVMaxDistanceOffSet;                                 // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ScopeVVibrationDuration;                                 // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WVN5[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat* ScopeVSingleOffSetCurve;                                 // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat* ScopeVContinuousOffSetCurve;                             // 0x0018(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ScopeVContinuousFallingDuration;                         // 0x0020(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7MC6[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat* ScopeVContinuousFallingCurve;                            // 0x0028(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ScopeVContinuousFallingPointIndex;                       // 0x0030(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ScopeHMaxDistanceOffSet;                                 // 0x0034(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ScopeHVibrationDuration;                                 // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Z5LW[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat* ScopeHSingleOffSetCurve;                                 // 0x0040(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat* ScopeHContinuousOffSetCurve;                             // 0x0048(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat* ScopeHOffSetProbabilityCurve;                            // 0x0050(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAmmonRecoilCrossHair                               CrossHairScaleSettings;                                  // 0x0058(0x0024) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DD9V[0x4];                                   // 0x007C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAmmonRecoilScopeRoll                               ScopeRollSettings;                                       // 0x0080(0x0038) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.TracerBulletData
	 * Size -> 0x0040
	 */
	struct FTracerBulletData
	{
	public:
		float                                                      DeflectionAnglePerSec;                                   // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaximumDetectionAngle;                                   // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HomingRange;                                             // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bTraceTargetOnly;                                        // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JS5N[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              TracingTargetWarningSound;                               // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              TracingTargetWarningRTPC;                                // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              TracingAuthorPromptSound;                                // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.FootEffect
	 * Size -> 0x0040
	 */
	struct FFootEffect
	{
	public:
		EFootEffectType                                            Type;                                                    // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CY0A[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UParticleSystem* PSTemplate;                                              // 0x0008(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PSTemplateSoft[0x28];                                    // 0x0010(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		class FName                                                SocketName;                                              // 0x0038(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.CharacterSound
	 * Size -> 0x0030
	 */
	struct FCharacterSound
	{
	public:
		class FString                                              SoundOptPlayer;                                          // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              SoundOptTeammate;                                        // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              SoundOptEnemy;                                           // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.SolarSkinnedAsset
	 * Size -> 0x0008
	 */
	struct FSolarSkinnedAsset
	{
	public:
		unsigned char                                              UnknownData_97LL[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.SolarSkinnedParticleSystem
	 * Size -> 0x0068 (FullSize[0x0070] - InheritedSize[0x0008])
	 */
	struct FSolarSkinnedParticleSystem : public FSolarSkinnedAsset
	{
	public:
		struct FSoftObjectPath                                     DefaultSkinnedParticle;                                  // 0x0008(0x0018) Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TMap<int32_t, struct FSoftObjectPath>                      SkinnedParticles;                                        // 0x0020(0x0050) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AttachedMeshInfo
	 * Size -> 0x0040
	 */
	struct FAttachedMeshInfo
	{
	public:
		class UStaticMesh* MeshResource;                                            // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                SocketName;                                              // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTransform                                          TransformOffset;                                         // 0x0010(0x0030) Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.MeerkatConfig
	 * Size -> 0x0014
	 */
	struct FMeerkatConfig
	{
	public:
		int32_t                                                    ID;                                                      // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Min;                                                     // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Max;                                                     // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Tolerance;                                               // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ProbeInterval;                                           // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AttributeSubSetting
	 * Size -> 0x000C
	 */
	struct FAttributeSubSetting
	{
	public:
		bool                                                       bUsingAttributeSub;                                      // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAttributeSubBehavior                                      Behavior;                                                // 0x0001(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_R4DZ[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    AttributeSubID;                                          // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Value;                                                   // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.VertexAnimInfo
	 * Size -> 0x0010
	 */
	struct FVertexAnimInfo
	{
	public:
		int32_t                                                    StartFrame;                                              // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    EndFrame;                                                // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Length;                                                  // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Loop;                                                    // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MZ2F[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.BattlegroundMapElementData
	 * Size -> 0x000C
	 */
	struct FBattlegroundMapElementData
	{
	public:
		int32_t                                                    SubModeID;                                               // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBattlegroundMapElementType                                Type;                                                    // 0x0004(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EFactionType                                               DefaultOwnerFaction;                                     // 0x0005(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDeploymentType                                            DeploymentType;                                          // 0x0006(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBattlegroundPlayerStartRegion                             PlayerStartRegion;                                       // 0x0007(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EnemyCheckDistance;                                      // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ControlPointData
	 * Size -> 0x0014
	 */
	struct FControlPointData
	{
	public:
		float                                                      OccupiedAddScorePerSec;                                  // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              MinProgress;                                             // 0x0004(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              MaxProgress;                                             // 0x0005(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DB92[0x2];                                   // 0x0006(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      OccupyingProgressPerSec;                                 // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ReOccupyingProgressPerSec;                               // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RegainTime;                                              // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.PersonalScoreData
	 * Size -> 0x0008
	 */
	struct FPersonalScoreData
	{
	public:
		EPersonalScoreType                                         ScoreType;                                               // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_II71[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    Score;                                                   // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.BattlegroundGlobalData
	 * Size -> 0x0040
	 */
	struct FBattlegroundGlobalData
	{
	public:
		int32_t                                                    MaxBattleTime;                                           // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              WaitingLandCountDownTime;                                // 0x0004(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HMMS[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BattlePrepareTime;                                       // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RebirthWaitTime;                                         // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RebirthInvincibleTime;                                   // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DeployConfirmTime;                                       // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    BatttleEndLeaveTime;                                     // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      VictoryScore;                                            // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BonusScorePerSec;                                        // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZH47[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FPersonalScoreData>                          PersonalScoreArray;                                      // 0x0028(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    AiLevel;                                                 // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LUGN[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.BattlegroundSubModeData
	 * Size -> 0x001C
	 */
	struct FBattlegroundSubModeData
	{
	public:
		int32_t                                                    SubModeID;                                               // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MapId;                                                   // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           MapCenter;                                               // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MapFOV;                                                  // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           SafeAreaCenter;                                          // 0x0014(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.PrePooledBundle
	 * Size -> 0x0010
	 */
	struct FPrePooledBundle
	{
	public:
		class FName                                                ClassPath;                                               // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Number;                                                  // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bNeedOnClient;                                           // 0x000C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bNeedOnServer;                                           // 0x000D(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BEB3[0x2];                                   // 0x000E(0x0002) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.GameStartConditionList
	 * Size -> 0x0058
	 */
	struct FGameStartConditionList
	{
	public:
		unsigned char                                              UnknownData_WJN1[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGameplayTagContainer                               ServerStartConditionList;                                // 0x0008(0x0020) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               ClientStartConditionList;                                // 0x0028(0x0020) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		class AGameStateBase* Owner;                                                   // 0x0048(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_Q1VP[0x8];                                   // 0x0050(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.TournamentData
	 * Size -> 0x0010
	 */
	struct FTournamentData
	{
	public:
		int32_t                                                    StartTime;                                               // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    DelayTime;                                               // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Turn;                                                    // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESCTournamentType                                          TournamentType;                                          // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0KXK[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.CustomServerData
	 * Size -> 0x0058
	 */
	struct FCustomServerData
	{
	public:
		class FString                                              ID;                                                      // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ConfigID;                                                // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_78NJ[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<int32_t>                                            WeaponBlacklist;                                         // 0x0018(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            WeaponTypeBlacklist;                                     // 0x0028(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            VehicleTypeBlacklist;                                    // 0x0038(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            VehicleClassBlacklist;                                   // 0x0048(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.CustomRoomData
	 * Size -> 0x00D8
	 */
	struct FCustomRoomData
	{
	public:
		class FString                                              Name;                                                    // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int64_t                                                    MinPlayerLimit;                                          // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int64_t                                                    MaxPlayerLimit;                                          // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              OwnerID;                                                 // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Passwd;                                                  // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    LevelLimit;                                              // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AU2K[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int64_t                                                    ShowID;                                                  // 0x0048(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int64_t                                                    MaxOBPlayerLimit;                                        // 0x0050(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsEnabledSwapPos;                                       // 0x0058(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsEnabledInvite;                                        // 0x0059(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsEnableTeamJoin;                                       // 0x005A(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESCRoomType                                                RoomType;                                                // 0x005B(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTournamentData                                     TournamentData;                                          // 0x005C(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		int32_t                                                    RewardPoolID;                                            // 0x006C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    RewardPoolPrizeType;                                     // 0x0070(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LKL7[0x4];                                   // 0x0074(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FCustomServerData                                   CustomServerData;                                        // 0x0078(0x0058) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		int32_t                                                    KeepMatchTime;                                           // 0x00D0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T93T[0x4];                                   // 0x00D4(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.BattlegroundScoreData
	 * Size -> 0x000C
	 */
	struct FBattlegroundScoreData
	{
	public:
		EFactionType                                               Faction;                                                 // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ILY7[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Score;                                                   // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EMatchResult                                               MatchResult;                                             // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QDLS[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.MedalInfo
	 * Size -> 0x0010
	 */
	struct FMedalInfo
	{
	public:
		int32_t                                                    MedalID;                                                 // 0x0000(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MedalType;                                               // 0x0004(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MedalPos;                                                // 0x0008(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MedalLv;                                                 // 0x000C(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.EquipVoiceData
	 * Size -> 0x0018
	 */
	struct FEquipVoiceData
	{
	public:
		int32_t                                                    Type;                                                    // 0x0000(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1DPU[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<int32_t>                                            Ids;                                                     // 0x0008(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.BattleCharacterData
	 * Size -> 0x0060
	 */
	struct FBattleCharacterData
	{
	public:
		int32_t                                                    CharacterId;                                             // 0x0000(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SkinId;                                                  // 0x0004(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CharacterLevel;                                          // 0x0008(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    TalentID;                                                // 0x000C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    UseTimes;                                                // 0x0010(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CardPose;                                                // 0x0014(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Cardbackground;                                          // 0x0018(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CharacterExp;                                            // 0x001C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Title;                                                   // 0x0020(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_60TS[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int64_t                                                    Expired;                                                 // 0x0028(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CombatScore;                                             // 0x0030(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    BagId;                                                   // 0x0034(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    TailFlameId;                                             // 0x0038(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CapsuleActorId;                                          // 0x003C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    DeathBoxId;                                              // 0x0040(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CharacterOwnerType;                                      // 0x0044(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FEquipVoiceData>                             Voice;                                                   // 0x0048(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    KillReport;                                              // 0x0058(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OVZG[0x4];                                   // 0x005C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.CharacterSkin
	 * Size -> 0x0008
	 */
	struct FCharacterSkin
	{
	public:
		int32_t                                                    SkinId;                                                  // 0x0000(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SkinOwnerType;                                           // 0x0004(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ExpRankMedalData
	 * Size -> 0x0038
	 */
	struct FExpRankMedalData
	{
	public:
		class FString                                              Area;                                                    // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Country;                                                 // 0x0010(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Rank;                                                    // 0x0020(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CharacterId;                                             // 0x0024(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CharacterType;                                           // 0x0028(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    RankScore;                                               // 0x002C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    RankType;                                                // 0x0030(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    AutoID;                                                  // 0x0034(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.LastBattleInfo
	 * Size -> 0x001C
	 */
	struct FLastBattleInfo
	{
	public:
		float                                                      MvpScore;                                                // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    KillNum;                                                 // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    HitDown;                                                 // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    AssistNum;                                               // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    RescueNum;                                               // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    AliveTime;                                               // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CauseDamage;                                             // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.SettlementParam_ExtraRewardInfo
	 * Size -> 0x0040
	 */
	struct FSettlementParam_ExtraRewardInfo
	{
	public:
		int32_t                                                    TextID;                                                  // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TP0K[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              LocVariable;                                             // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Content;                                                 // 0x0018(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              ItemList;                                                // 0x0028(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Order;                                                   // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ILDA[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.SettlementReward
	 * Size -> 0x0008
	 */
	struct FSettlementReward
	{
	public:
		int32_t                                                    ItemID;                                                  // 0x0000(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Amount;                                                  // 0x0004(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.SettlementCrateReward
	 * Size -> 0x0018
	 */
	struct FSettlementCrateReward
	{
	public:
		int64_t                                                    crateID;                                                 // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FSettlementReward>                           Items;                                                   // 0x0008(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ShieldInfo
	 * Size -> 0x0008
	 */
	struct FShieldInfo
	{
	public:
		int32_t                                                    ShieldID;                                                // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CurValue;                                                // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.EquippedEmotesData
	 * Size -> 0x0010
	 */
	struct FEquippedEmotesData
	{
	public:
		TArray<int32_t>                                            EmoteData;                                               // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.KillEnemySnapshot
	 * Size -> 0x0018
	 */
	struct FKillEnemySnapshot
	{
	public:
		unsigned char                                              UnknownData_BUBR[0x18];                                  // 0x0000(0x0018) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.SettlementTempData
	 * Size -> 0x00D8
	 */
	struct FSettlementTempData
	{
	public:
		int32_t                                                    TotalAccountExp;                                         // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    AccountLevel;                                            // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2SKL[0x50];                                  // 0x0008(0x0050) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    CurCharacterLevel;                                       // 0x0058(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    TotalCharacterExp;                                       // 0x005C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCharExpFull;                                            // 0x0060(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bHaveRankData;                                           // 0x0061(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A7I9[0x2];                                   // 0x0062(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    RankBeforeScore;                                         // 0x0064(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    RankAfterScore;                                          // 0x0068(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    RankSurviveScore;                                        // 0x006C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    RankBeforeSurviveScore;                                  // 0x0070(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    RankDefeatScore;                                         // 0x0074(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    RankBeforeDefeatScore;                                   // 0x0078(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RankDefeatRatio;                                         // 0x007C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    RankLegend;                                              // 0x0080(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              RankProtectType;                                         // 0x0084(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsRankFight;                                             // 0x0085(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6QJQ[0x2];                                   // 0x0086(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    WinninScoreID;                                           // 0x0088(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    BattlePassID;                                            // 0x008C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    BattlePassAddExp;                                        // 0x0090(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    BattlePassExp;                                           // 0x0094(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            BattlePassTaskID;                                        // 0x0098(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            BattlePassTaskWeek;                                      // 0x00A8(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            BattlePassTaskAdd;                                       // 0x00B8(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            BattlePassTaskVal;                                       // 0x00C8(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ExposeLocationMap
	 * Size -> 0x0058
	 */
	struct FExposeLocationMap
	{
	public:
		TMap<class ASolarPlayerState*, int32_t>                    InnerMap;                                                // 0x0000(0x0050) Protected, NativeAccessSpecifierProtected
		class ASolarPlayerState* Owner;                                                   // 0x0050(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
	};

	/**
	 * ScriptStruct Solarland.SolarBattleWeaponData
	 * Size -> 0x0008
	 */
	struct FSolarBattleWeaponData
	{
	public:
		int32_t                                                    weaponid;                                                // 0x0000(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SkinId;                                                  // 0x0004(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.SCMRepData
	 * Size -> 0x0038
	 */
	struct FSCMRepData
	{
	public:
		class FString                                              Name;                                                    // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESCMDataType                                               Type;                                                    // 0x0010(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESCMDataChangeType                                         DataChangeType;                                          // 0x0011(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZT15[0x2];                                   // 0x0012(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    VInt;                                                    // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      VFloat;                                                  // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantize100                              VVector;                                                 // 0x001C(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              VString;                                                 // 0x0028(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.SCMRepDataArray
	 * Size -> 0x0078
	 */
	struct FSCMRepDataArray
	{
	public:
		class FString                                              Name;                                                    // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESCMDataType                                               Type;                                                    // 0x0010(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_523B[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<ESCMDataChangeType>                                 ChangeTypeArray;                                         // 0x0018(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<uint32_t>                                           ChangeIndexArray;                                        // 0x0028(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            VInt;                                                    // 0x0038(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<float>                                              VFloat;                                                  // 0x0048(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FVector_NetQuantize100>                      VVector;                                                 // 0x0058(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class FString>                                      VString;                                                 // 0x0068(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.SCMRepDataMap
	 * Size -> 0x0078
	 */
	struct FSCMRepDataMap
	{
	public:
		class FString                                              Name;                                                    // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESCMDataType                                               Type;                                                    // 0x0010(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GK9K[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<ESCMDataChangeType>                                 ChangeTypeArray;                                         // 0x0018(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class FString>                                      KeyArray;                                                // 0x0028(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            VInt;                                                    // 0x0038(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<float>                                              VFloat;                                                  // 0x0048(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FVector_NetQuantize100>                      VVector;                                                 // 0x0058(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class FString>                                      VString;                                                 // 0x0068(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.SCMReplicateHostData
	 * Size -> 0x0048
	 */
	struct FSCMReplicateHostData
	{
	public:
		ESCMHostType                                               HostType;                                                // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CQQ4[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              HostID;                                                  // 0x0008(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FSCMRepData>                                 RepDataArray;                                            // 0x0018(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FSCMRepDataArray>                            RepArrDataArray;                                         // 0x0028(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FSCMRepDataMap>                              RepMapDataArray;                                         // 0x0038(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.BattlePassLevelInfo
	 * Size -> 0x0018
	 */
	struct FBattlePassLevelInfo
	{
	public:
		unsigned char                                              UnknownData_H7TD[0x18];                                  // 0x0000(0x0018) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.PromptElemInfo
	 * Size -> 0x0034
	 */
	struct FPromptElemInfo
	{
	public:
		EBattlePromptType                                          Type;                                                    // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HRRJ[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector2D                                           ArrowPosition;                                           // 0x0004(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           IconPosition;                                            // 0x000C(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ArrowColorFactor;                                        // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ArrowLengthFactor;                                       // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    IconFactor;                                              // 0x001C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TransparencyFactor;                                      // 0x0020(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Distance;                                                // 0x0024(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Angle;                                                   // 0x0028(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bBlocked;                                                // 0x002C(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_U7IM[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    UVIdx;                                                   // 0x0030(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.BattleUpgradeEffectCategoryColorSet
	 * Size -> 0x0060
	 */
	struct FBattleUpgradeEffectCategoryColorSet
	{
	public:
		struct FLinearColor                                        BannerCategoryTextColor;                                 // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        BannerIconColor;                                         // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        BannerBorderColor;                                       // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        BannerBackgroundColor;                                   // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        BadgeIconColor;                                          // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        BadgeBackgroundColor;                                    // 0x0050(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.BattleUpgradeEffectCategoryConfig
	 * Size -> 0x0064
	 */
	struct FBattleUpgradeEffectCategoryConfig
	{
	public:
		int32_t                                                    TitleLocalTextID;                                        // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FBattleUpgradeEffectCategoryColorSet                ColorSet;                                                // 0x0004(0x0060) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.BlueCircleInfo
	 * Size -> 0x0014
	 */
	struct FBlueCircleInfo
	{
	public:
		struct FVector                                             CenterLocation;                                          // 0x0000(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Radius;                                                  // 0x000C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bHiddenInLevel;                                          // 0x0010(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9KN3[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.DeathBoxItemData
	 * Size -> 0x0008
	 */
	struct FDeathBoxItemData
	{
	public:
		int32_t                                                    ItemID;                                                  // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ItemNum;                                                 // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ScreenEffectWidgetCacheInfo
	 * Size -> 0x0018
	 */
	struct FScreenEffectWidgetCacheInfo
	{
	public:
		class UClass* WidgetClass;                                             // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class USolarScreenEffectWidget*>                    WidgetInstances;                                         // 0x0008(0x0010) ExportObject, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.BuffEffectActorElemList
	 * Size -> 0x0010
	 */
	struct FBuffEffectActorElemList
	{
	public:
		TArray<class UBuffEffectActorElem*>                        ElemList;                                                // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.BuffParticleEffectGroup
	 * Size -> 0x00B0
	 */
	struct FBuffParticleEffectGroup
	{
	public:
		unsigned char                                              UnknownData_4JOM[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class FName, struct FBuffEffectActorElemList>         InstantActorListMap;                                     // 0x0008(0x0050) Transient, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_13IV[0x8];                                   // 0x0058(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class FName, struct FBuffEffectActorElemList>         DurationActorListMap;                                    // 0x0060(0x0050) Transient, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.BuffParticleEffectInstance
	 * Size -> 0x0030
	 */
	struct FBuffParticleEffectInstance
	{
	public:
		unsigned char                                              UnknownData_YKP3[0x20];                                  // 0x0000(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UBuffEffectActorElem*>                        AttachElemList;                                          // 0x0020(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct Solarland.BuffEffectActorElemPool
	 * Size -> 0x0010
	 */
	struct FBuffEffectActorElemPool
	{
	public:
		TArray<class UBuffEffectActorElem*>                        PoolInstances;                                           // 0x0000(0x0010) ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct Solarland.ScreenEffectInstance
	 * Size -> 0x0098
	 */
	struct FScreenEffectInstance
	{
	public:
		unsigned char                                              UnknownData_L7AG[0x98];                                  // 0x0000(0x0098) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.ScreenEffectGroup
	 * Size -> 0x0060
	 */
	struct FScreenEffectGroup
	{
	public:
		TMap<int32_t, struct FScreenEffectInstance>                InstantScreenEffects;                                    // 0x0000(0x0050) NativeAccessSpecifierPublic
		TArray<struct FScreenEffectInstance>                       DurationScreenEffects;                                   // 0x0050(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.CameraShakeWithCurvePool
	 * Size -> 0x0010
	 */
	struct FCameraShakeWithCurvePool
	{
	public:
		TArray<class UCameraShakeWithCurve*>                       PooledShakes;                                            // 0x0000(0x0010) ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.CameraShakeWithCurveTemplatePool
	 * Size -> 0x0018
	 */
	struct FCameraShakeWithCurveTemplatePool
	{
	public:
		unsigned char                                              UnknownData_F6B1[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UCameraShakeWithCurve*>                       PooledShakes;                                            // 0x0008(0x0010) ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ActiveCameraShakeWithCurve
	 * Size -> 0x0018
	 */
	struct FActiveCameraShakeWithCurve
	{
	public:
		class UCameraShakeWithCurve* ShakeInstance;                                           // 0x0000(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LAGM[0x10];                                  // 0x0008(0x0010) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.RangeFloat
	 * Size -> 0x0008
	 */
	struct FRangeFloat
	{
	public:
		float                                                      Min;                                                     // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Max;                                                     // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.SymmetricRangeFloat
	 * Size -> 0x000C
	 */
	struct FSymmetricRangeFloat
	{
	public:
		struct FRangeFloat                                         Range;                                                   // 0x0000(0x0008) Edit, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bSymmetric;                                              // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9W5P[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.EchelonFormation
	 * Size -> 0x0010
	 */
	struct FEchelonFormation
	{
	public:
		TArray<struct FVector>                                     LocationList;                                            // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.CruiseFormation
	 * Size -> 0x0010
	 */
	struct FCruiseFormation
	{
	public:
		TArray<struct FVector>                                     LocationList;                                            // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.KnockoutParams
	 * Size -> 0x0028
	 */
	struct FKnockoutParams
	{
	public:
		float                                                      KnockoutKillPoint;                                       // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ENXF[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<float>                                              KnockoutRankPoints;                                      // 0x0008(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      KnockoutDamagePoint;                                     // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      KnockoutDamageTakenPoint;                                // 0x001C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ScalarParam;                                             // 0x0020(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JI2Y[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.SCMElementMapConfig
	 * Size -> 0x0020
	 */
	struct FSCMElementMapConfig
	{
	public:
		struct FSoftObjectPath                                     ElementLevel;                                            // 0x0000(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       LoadWithLevel;                                           // 0x0018(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ELevelLoadType                                             LoadType;                                                // 0x0019(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KT83[0x6];                                   // 0x001A(0x0006) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.SCMMapConfig
	 * Size -> 0x0080
	 */
	struct FSCMMapConfig
	{
	public:
		class FString                                              Desc;                                                    // 0x0000(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     LevelMap;                                                // 0x0010(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MiniMapId;                                               // 0x0028(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsStreaming;                                             // 0x002C(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_48NS[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class FString, struct FSCMElementMapConfig>           ElementGroups;                                           // 0x0030(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.CharacterMovementNetworkOptions
	 * Size -> 0x000C
	 */
	struct FCharacterMovementNetworkOptions
	{
	public:
		bool                                                       bEnabled;                                                // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bServerAcceptClientAuthoritativePosition;                // 0x0001(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIgnoreClientMovementErrorChecksAndCorrection;           // 0x0002(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CGYU[0x1];                                   // 0x0003(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxLocationDifferenceToTrustClientMove;                  // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EClientMoveTrustType                                       ClientMoveTrustType;                                     // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PQYZ[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Solarland.DataManagerConfig
	 * Size -> 0x0010
	 */
	struct FDataManagerConfig
	{
	public:
		class UDataTable* GeneralDataTable;                                        // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UDataTable* DataTable;                                               // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.InGameLevelingConfig
	 * Size -> 0x0008
	 */
	struct FInGameLevelingConfig
	{
	public:
		class UDataTable* ExpTable;                                                // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ExpItemConfig
	 * Size -> 0x0010
	 */
	struct FExpItemConfig
	{
	public:
		class UDataTable* ConfigTable;                                             // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UDataTable* KilledConfigTable;                                       // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.ExpItemReduceRate
	 * Size -> 0x0008
	 */
	struct FExpItemReduceRate
	{
	public:
		class UDataTable* ConfigTable;                                             // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.BoxBurstItemConfig
	 * Size -> 0x0008
	 */
	struct FBoxBurstItemConfig
	{
	public:
		class UDataTable* ConfigTable;                                             // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.FinalsBGMData
	 * Size -> 0x0028
	 */
	struct FFinalsBGMData
	{
	public:
		bool                                                       bEnableFinalsBGM;                                        // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              FinalsBGMSafeAreaIndex;                                  // 0x0001(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              FinalsBGMPlayTeamCount;                                  // 0x0002(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              FinalsBGMStopTeamCount;                                  // 0x0003(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WOTR[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              FinalsBGMName_Play;                                      // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              FinalsBGMName_Stop;                                      // 0x0018(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.AbilityMeshMontage
	 * Size -> 0x0010
	 */
	struct FAbilityMeshMontage
	{
	public:
		class USkeletalMeshComponent* Mesh;                                                    // 0x0000(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage* Montage;                                                 // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Solarland.SolarGameplayEffectConfig
	 * Size -> 0x0010
	 */
	struct FSolarGameplayEffectConfig
	{
	public:
		class UClass* GameplayEffectClass;                                     // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
