#pragma once

// Dumped with Dumper-7!


namespace SDK
{
	//---------------------------------------------------------------------------------------------------------------------
	// CLASSES
	//---------------------------------------------------------------------------------------------------------------------

	// 0x10 (0x238 - 0x228)
	// Class Solarland.3DMeshWidget
	class AThreeDMeshWidget : public AActor
	{
	public:
		class USceneComponent* DefaultSceneRoot;                                  // 0x228(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UStaticMeshComponent* StaticMeshComp;                                    // 0x230(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class AThreeDMeshWidget* GetDefaultObj();

	};

	// 0xA0 (0x2D8 - 0x238)
	// Class Solarland.3DMeshWidgetTrack
	class AThreeDMeshWidgetTrack : public AThreeDMeshWidget
	{
	public:
		uint8                                        Pad_1319[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FVector                               BoxHalfExtent;                                     // 0x240(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        PlayerNearbyAlpha;                                 // 0x24C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bDebugCollision;                                   // 0x250(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_131A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class FName                                  MaterialAlphaParamName;                            // 0x254(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                  MaterialCountDownName;                             // 0x25C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        MaxTraceDist;                                      // 0x264(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        DistFromGround;                                    // 0x268(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_131B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UStaticMeshComponent* StaticMeshCountDown;                               // 0x270(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UTextRenderComponent* DistTextComp;                                      // 0x278(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UMaterialInstanceDynamic* DynamicMaterialIcon;                               // 0x280(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		class UMaterialInstanceDynamic* DynamicMaterialCountDown;                          // 0x288(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		class UMaterialInstanceDynamic* DynamicMaterialDistText;                           // 0x290(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_131C[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class AThreeDMeshWidgetTrack* GetDefaultObj();

	};

	// 0xC8 (0x148 - 0x80)
	// Class Solarland.AbilityTask_WaitAbilityEnd
	class UAbilityTask_WaitAbilityEnd : public UAbilityTask
	{
	public:
		FMulticastInlineDelegateProperty_            OnEnd;                                             // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		uint8                                        Pad_133C[0xB8];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAbilityTask_WaitAbilityEnd* GetDefaultObj();

		class UAbilityTask_WaitAbilityEnd* WaitForAbilityEndWithTagRequirements(class UGameplayAbility* OwningAbility, const struct FGameplayTagRequirements& TagRequirements, bool InIncludeTriggeredAbilities, bool InTriggerOnce);
		class UAbilityTask_WaitAbilityEnd* WaitForAbilityEnd_Query(class UGameplayAbility* OwningAbility, const struct FGameplayTagQuery& Query, bool InIncludeTriggeredAbilities, bool InTriggerOnce);
		class UAbilityTask_WaitAbilityEnd* WaitForAbilityEnd(class UGameplayAbility* OwningAbility, const struct FGameplayTag& InWithTag, const struct FGameplayTag& InWithoutTag, bool InIncludeTriggeredAbilities, bool InTriggerOnce);
		void OnAbilityEnd(struct FAbilityEndedData& EndedData);
	};

	// 0x0 (0x80 - 0x80)
	// Class Solarland.SolarAbilityTask
	class USolarAbilityTask : public UAbilityTask
	{
	public:

		static class UClass* StaticClass();
		static class USolarAbilityTask* GetDefaultObj();

	};

	// 0x78 (0xF8 - 0x80)
	// Class Solarland.AbilityTask_WaitAttributeChangeWithOldValue
	class UAbilityTask_WaitAttributeChangeWithOldValue : public USolarAbilityTask
	{
	public:
		FMulticastInlineDelegateProperty_            OnChange;                                          // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		uint8                                        Pad_1344[0x60];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		class UAbilitySystemComponent* ExternalOwner;                                     // 0xF0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAbilityTask_WaitAttributeChangeWithOldValue* GetDefaultObj();

		class UAbilityTask_WaitAttributeChangeWithOldValue* WaitForAttributeChangeWithComparison(class UGameplayAbility* OwningAbility, const struct FGameplayAttribute& InAttribute, const struct FGameplayTag& InWithTag, const struct FGameplayTag& InWithoutTag, enum class EWaitAttributeChangeComparison InComparisonType, float InComparisonValue, bool bTriggerOnce, class AActor* OptionalExternalOwner);
		class UAbilityTask_WaitAttributeChangeWithOldValue* WaitForAttributeChange(class UGameplayAbility* OwningAbility, const struct FGameplayAttribute& InAttribute, const struct FGameplayTag& InWithTag, const struct FGameplayTag& InWithoutTag, bool bTriggerOnce, class AActor* OptionalExternalOwner);
	};

	// 0x40 (0xC0 - 0x80)
	// Class Solarland.AbilityTask_WaitDelayAndResetOnGameplayEvent
	class UAbilityTask_WaitDelayAndResetOnGameplayEvent : public USolarAbilityTask
	{
	public:
		FMulticastInlineDelegateProperty_            OnFinish;                                          // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FDelegateProperty_                           OnRecalculateWaitDelayOnEventTriggered;            // 0x90(0x10)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		uint8                                        Pad_1349[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAbilityTask_WaitDelayAndResetOnGameplayEvent* GetDefaultObj();

		class UAbilityTask_WaitDelayAndResetOnGameplayEvent* CreateTask(class UGameplayAbility* OwningAbility, float DelayTime, struct FGameplayTag& EventTag);
	};

	// 0x28 (0xA8 - 0x80)
	// Class Solarland.AbilityTask_WaitEvaluation
	class UAbilityTask_WaitEvaluation : public USolarAbilityTask
	{
	public:
		FMulticastInlineDelegateProperty_            OnGotDesiredValue;                                 // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FDelegateProperty_                           EvaluationFunction;                                // 0x90(0x10)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		uint8                                        Pad_134C[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAbilityTask_WaitEvaluation* GetDefaultObj();

		class UAbilityTask_WaitEvaluation* CreateTask(class UGameplayAbility* OwningAbility, bool bDesiredValue, bool bTriggerOnce);
	};

	// 0x28 (0xA8 - 0x80)
	// Class Solarland.AbilityTask_WaitInputAction
	class UAbilityTask_WaitInputAction : public USolarAbilityTask
	{
	public:
		FMulticastInlineDelegateProperty_            OnInputAction;                                     // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		uint8                                        Pad_136E[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAbilityTask_WaitInputAction* GetDefaultObj();

		class UAbilityTask_WaitInputAction* CreateTask(class UGameplayAbility* OwningAbility, class FName ActionName, enum class EInputEvent InputEvent, bool bTriggerOnce);
	};

	// 0x70 (0xF0 - 0x80)
	// Class Solarland.AbilityTask_WaitTagRequirementsMetStatusChange
	class UAbilityTask_WaitTagRequirementsMetStatusChange : public USolarAbilityTask
	{
	public:
		FMulticastInlineDelegateProperty_            OnMetStatusChange;                                 // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		struct FGameplayTagRequirements              TagRequirements;                                   // 0x90(0x50)(Edit, Protected, NativeAccessSpecifierProtected)
		uint8                                        Pad_137B[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAbilityTask_WaitTagRequirementsMetStatusChange* GetDefaultObj();

		class UAbilityTask_WaitTagRequirementsMetStatusChange* CreateTask(class UGameplayAbility* OwningAbility, struct FGameplayTagRequirements& TagRequirements, bool bMetInitially);
	};

	// 0x48 (0x70 - 0x28)
	// Class Solarland.ActionNode
	class UActionNode : public UObject
	{
	public:
		FMulticastInlineDelegateProperty_            OnBeganCallback;                                   // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            OnEndedCallback;                                   // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            OnResetCallback;                                   // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            OnDisposedCallback;                                // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		uint8                                        Pad_1383[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UActionNode* GetDefaultObj();

		void Reset();
		bool Finished();
		void Finish();
		bool Execute(float DeltaTime);
		bool Disposed();
		void Dispose();
	};

	// 0x10 (0x38 - 0x28)
	// Class Solarland.ActionWheelWidgetFunctionBase
	class UActionWheelWidgetFunctionBase : public UObject
	{
	public:
		TWeakObjectPtr<class USolarUserWidget>       BindedWidget;                                      // 0x28(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        LastSelectedIndex;                                 // 0x30(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1394[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UActionWheelWidgetFunctionBase* GetDefaultObj();

		int32 GetSuggestActionIndex();
		int32 GetQuickActionIndex();
		int32 GetAutoSelectedActionIndex();
		bool ExecUseCustomItemCommand(int32 InItemID);
		bool CheckCommandCanExec(class ASCMPlayerState* InPlayerState, int32 InIndex, const struct FActionWheelCommand& InCommand);
	};

	// 0x1A0 (0x400 - 0x260)
	// Class Solarland.SolarUserWidget
	class USolarUserWidget : public UUserWidget
	{
	public:
		enum class EWidgetLayerLevel                 WidgetLayerLevel;                                  // 0x260(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bIsPersistent;                                     // 0x261(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class EWidgetScope                      WidgetScope;                                       // 0x262(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class EInputCapture                     CaptureInput;                                      // 0x263(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bHideCursorDuringCapture;                          // 0x264(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_13C8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        MyRoot;                                            // 0x268(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_13C9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class FString                                Widgetkey;                                         // 0x270(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bReceiveKeyMap;                                    // 0x280(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bReceiveShowMouse;                                 // 0x281(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class EScope                            ShowScope;                                         // 0x282(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class ELayoutPreviewType                LayoutPreviewType;                                 // 0x283(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bShowTransBlackAnim;                               // 0x284(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_13CB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TSubclassOf<class UWidgetInputManager>       InputManagerClass;                                 // 0x288(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UWidgetInputManager* InputManager;                                      // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TMap<class FName, class UWidgetAnimation*>   AnimationsMap;                                     // 0x298(0x50)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
		TWeakObjectPtr<class UWidgetAnimation>       PlayingAnimation;                                  // 0x2E8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_13E2[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<struct FPlayAnimationParams>          PendingPlayAnimations;                             // 0x308(0x10)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         WidgetTickEnabled;                                 // 0x318(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_13E3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         bInterestLocalLang;                                // 0x31C(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_13E4[0xB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class USolarInputActionContext* InputActionContext;                                // 0x328(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_13E5[0xB0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class USolarUserWidget*>              AllSolarUserWidgetChilds;                          // 0x3E0(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class USolarAdapterWidget*>           AllSolarAdapterWidgetChilds;                       // 0x3F0(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class USolarUserWidget* GetDefaultObj();

		void StopListeningForInputHandle(int32 Handle);
		void StopListeningForInputActionEx(class FName ActionName, enum class EInputEvent EventType);
		void ShowSelfPanelUI();
		void ShowMouseCursor();
		void SetZOrder(int32 ZOrder);
		void SetWidgetVisible(class UWidget* Widget, bool bVisible, bool bHitTest);
		void SetWidgetTickEnabled(bool bEnabled);
		void SetWidgetScope(enum class EWidgetScope InWidgetScope);
		void SetWidgetLayerLevel(enum class EWidgetLayerLevel InWidgetLayerLevel);
		void SetWidgetKey(const class FString& InWidgetKey);
		void SetInputActionIsEnabled(class FName ActionName, enum class EInputEvent EventType, bool bInIsEnabled);
		void SetBlockInputForOneTick();
		void ReceiveTick(struct FGeometry& MyGeometry, float InDeltaTime);
		void ReceiveShow();
		void ReceiveHide();
		bool PlayAnimationByName(class FName& AnimationName, float StartAtTime, int32 NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
		void PlayAnimationByExclusively(class UWidgetAnimation* InAnimation, float StartAtTime, int32 NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed, bool bRestoreState);
		void OnTouchManagerInitialized();
		void OnSynchronizeProperties();
		void OnSolarUIOpened();
		void OnSolarUIClosed();
		void OnShow();
		void OnLocalLangChangedEx(const class FString& InLang);
		void OnHide();
		void OnExclusivelyAnimationFinished();
		void OnDeinitialize();
		void OnBackKey(enum class EWidgetBackKeyType BackKeyType);
		int32 ListenForInputActionEx(class FName ActionName, enum class EInputEvent EventType, bool bInIsEnabled, FDelegateProperty_ Callback);
		bool IsWidgetTickEnabled();
		bool IsSolarUserWidgetAndBindLua(class UWidget* InWidget);
		bool IsPlatformSwitch();
		bool IsPlatformDesktop();
		void HideMouseCursor();
		class FString GetWidgetKeyByPanelName(enum class EUIPanelName PanelName);
		class FString GetWidgetKey();
		TArray<struct FVector2D> GetTouchedLocation();
		enum class EScope GetShowScope();
		TArray<struct FVector2D> GetPointerLocation();
		class ASolarPlayerState* GetOwningSolarPlayerState();
		class ASolarCharacter* GetOwningSolarPlayerCharacter();
		class UWidgetAnimation* GetAnimationByName(class FName& AnimationName);
		TArray<class USolarUserWidget*> GetAllSolarUserWidgetChilds();
		class UWidget* FindWidgetFromName(class FName& Name);
		void ExecuteSolarUIShow();
		void ExecuteSolarUIOpened();
		void ExecuteSolarUIHide();
		void ExecuteSolarUIClosed();
		void ExecuteSolarUIClean();
		void ExecuteBindCustomControl();
		void CloseSelfPanelUI();
		TArray<class USolarUserWidget*> CacheAllSolarUserWidgetChilds();
	};

	// 0x1F0 (0x5F0 - 0x400)
	// Class Solarland.ActionWheelWidget
	class UActionWheelWidget : public USolarUserWidget
	{
	public:
		uint8                                        Pad_140C[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		class UOverlay* Overlay_Point;                                     // 0x410(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_140D[0x58];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        SelectedIndex;                                     // 0x470(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        WheelActionItemCount;                              // 0x474(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        WheelActionItemCountMax;                           // 0x478(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        OperationAreaRadius;                               // 0x47C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        CancelAreaRadius;                                  // 0x480(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        PointMoveSensitivity;                              // 0x484(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ManualSwitchThreshold_PC;                          // 0x488(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ManualSwitchThreshold_GamePad;                     // 0x48C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ManualSwitchThreshold_Mobile;                      // 0x490(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        Groupid;                                           // 0x494(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        PageCount;                                         // 0x498(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        CurrentPage;                                       // 0x49C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_140F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FActionWheelConfig                    WheelConfigs;                                      // 0x4A8(0xE0)(BlueprintVisible, NativeAccessSpecifierPublic)
		TMap<int32, class UActionWheelWidgetFunctionBase*> ActionWheelWidgetFunctionObjs;                     // 0x588(0x50)(NativeAccessSpecifierPublic)
		class UDataTable* ActionWheelConfigDataTable;                        // 0x5D8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         ActionWheelIsOpened;                               // 0x5E0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1412[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        ValidEmojiUseDistance;                             // 0x5E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        ItemWheelGroupID;                                  // 0x5E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        EmoteActionWheelGroupID;                           // 0x5EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UActionWheelWidget* GetDefaultObj();

		void UpdateWheelArrowAngle(float Degree);
		void SetInputActionGroupEnable(bool InEnable);
		void SelecteActionWheelItem(int32 Page, int32 Index);
		void ReceiveActionWheelTouchMoved(struct FVector2D& TouchLocalPos);
		void OnConsumeItemUpdated();
		void OnCommandExec(int32 InGroupID, int32 InSelectedIndex);
		void OnBindedInputActionReleased(int32 InGroupID);
		void OnBindedInputActionPressed(int32 InGroupID);
		void OnBattleHUDVisibilityChanged(bool Visible);
		void OnActionWheelPreviousPage();
		void OnActionWheelOpened();
		void OnActionWheelNextPage();
		void OnActionWheelMouseRightClicked();
		void OnActionWheelMouseLeftClicked();
		void OnActionWheelConfigInit();
		void OnActionWheelClosed();
		void LoadCustomActionCommandInfo(struct FActionWheelConfig* ActionWheelConfig);
		void InitActionWheelConfigByGroupID(int32 InGroupID, int32 InPage);
		int32 GetItemNumById(int32 InItemID);
		class UActionWheelWidgetFunctionBase* GetActionWheelWidgetFunctionObj(int32 InGroupID);
		void CommandExec(int32 InGroupID, int32 InSelectedIndex);
		void ChangeWheelVisibility(bool Visible, bool IsProactivelyCancel);
		void ActionWheelYAxis(float Movement);
		void ActionWheelXAxis(float Movement);
	};

	// 0x28 (0x50 - 0x28)
	// Class Solarland.ActorEffect
	class UActorEffect : public UObject
	{
	public:
		TSubclassOf<class UActorEffectController>    ControllerClass;                                   // 0x28(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UActorEffectController* Controller;                                        // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_1419[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UActorEffect* GetDefaultObj();

	};

	// 0x0 (0x28 - 0x28)
	// Class Solarland.ActorEffectController
	class UActorEffectController : public UObject
	{
	public:

		static class UClass* StaticClass();
		static class UActorEffectController* GetDefaultObj();

	};

	// 0xC0 (0xF0 - 0x30)
	// Class Solarland.ActorEffectSubsystem
	class UActorEffectSubsystem : public UWorldSubsystem
	{
	public:
		uint8                                        Pad_1424[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class UActorEffect*>                  Effects;                                           // 0x40(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		TMap<TSubclassOf<class UActorEffect>, struct FActorEffectPool> EffectPools;                                       // 0x50(0x50)(NativeAccessSpecifierPrivate)
		TMap<TSubclassOf<class UActorEffectController>, struct FActorEffectControllerPool> ControllerPools;                                   // 0xA0(0x50)(NativeAccessSpecifierPrivate)

		static class UClass* StaticClass();
		static class UActorEffectSubsystem* GetDefaultObj();

		bool Stop(class UActorEffect* EffectInstance);
		class UActorEffect* Start(TSubclassOf<class UActorEffect> EffectClass, class AActor* AffectedActor);
		bool Finish(class UActorEffect* EffectInstance);
	};

	// 0x80 (0x480 - 0x400)
	// Class Solarland.ActorMarkBase
	class UActorMarkBase : public USolarUserWidget
	{
	public:
		uint8                                        Pad_142B[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         bEnableWeltDetection;                              // 0x410(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_142C[0xB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        LerpAlpha;                                         // 0x41C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        AngleForArrow;                                     // 0x420(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_142E[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		struct FVector2D                             RectangleOffset;                                   // 0x434(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        Radius;                                            // 0x43C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor* CurrentFollowActor;                                // 0x440(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class APlayerController* CurrentPlayerController;                           // 0x448(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector2D                             MarkIconAlignment;                                 // 0x450(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector2D                             MarkPanelSize;                                     // 0x458(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1430[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        MaxVisibleDis;                                     // 0x478(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1431[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UActorMarkBase* GetDefaultObj();

		void SetUpdateState(bool InShouldUpdateLocation);
		void InitActorMarkBaseByFixedPos(const struct FVector& Pos, class APlayerController* Controller);
		void InitActorMarkBase(class AActor* InActor, class APlayerController* Controller);
		struct FVector GetFollowActorLocation();
		float GetDistance(bool bIncludeZ);
		class AActor* GetCurrentFollowActor();
	};

	// 0x98 (0xC8 - 0x30)
	// Class Solarland.ActorMaterialSubsystemDataAsset
	class UActorMaterialSubsystemDataAsset : public UDataAsset
	{
	public:
		struct FGameplayTag                          DefaultMaterialChangePriorityTag;                  // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<struct FMaterialChangePriorityGroup>  OrderedMaterialChangePriorityGroups;               // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TSet<struct FSoftObjectPath>                 GlobalNoChangeMaterials;                           // 0x48(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
		TArray<struct FForceChangeMaterialInfos>     GlobalForceChangeMaterials;                        // 0x98(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1434[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UActorMaterialSubsystemDataAsset* GetDefaultObj();

	};

	// 0x28 (0x60 - 0x38)
	// Class Solarland.ActorMaterialSubsystemSettings
	class UActorMaterialSubsystemSettings : public UDeveloperSettings
	{
	public:
		TSoftObjectPtr<class UActorMaterialSubsystemDataAsset> ActorMaterialSubsystemDataAsset;                   // 0x38(0x28)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UActorMaterialSubsystemSettings* GetDefaultObj();

	};

	// 0x68 (0x98 - 0x30)
	// Class Solarland.ActorMaterialSubsystem
	class UActorMaterialSubsystem : public UWorldSubsystem
	{
	public:
		class UActorMaterialSubsystemDataAsset* Settings;                                          // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		TMap<class AActor*, struct FActorMaterialInfo> ActorMaterialsMap;                                 // 0x38(0x50)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
		uint8                                        Pad_1486[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UActorMaterialSubsystem* GetDefaultObj();

		bool SetStaticMesh(class AActor* Actor, class UStaticMeshComponent* MeshComp, class UStaticMesh* NewMesh);
		bool SetSkeletalMesh(class AActor* Actor, class USkeletalMeshComponent* MeshComp, class USkeletalMesh* NewMesh, bool bReinitPose, bool bForceSkipTickAnimation);
		bool SetOriginalMultiplePassMaterial(class AActor* Actor, class UMeshComponent* MeshComp, class UMaterialInterface* Material, bool bNeedMultiplePass);
		bool SetOriginalMaterials(class AActor* Actor, class UMeshComponent* MeshComp, TArray<class UMaterialInterface*>& Materials);
		bool SetOriginalMaterial(class AActor* Actor, class UMeshComponent* MeshComp, int32 MaterialIndex, class UMaterialInterface* Material);
		void RemoveNoChangeMaterials(TArray<struct FSoftObjectPath>& Materials);
		bool RemoveMaterialChange(class AActor* Actor, const struct FMaterialChangeHandle& Handle);
		bool RemoveAllMaterialChanges(class AActor* Actor);
		void RebuildMaterialChangesOnMeshAddedOrRemoved(class AActor* Actor);
		void RebuildMaterialChangesOnAllOriginalMaterialsChanged(class AActor* Actor);
		class UMaterialInstanceDynamic* OverrideDynamicMaterialInstanceParameterByIndex(class UMaterialInstanceDynamic* TargetMaterial, class UPrimitiveComponent* SourcePrimitiveComponent, int32 SourceElementIndex, class FName ParameterName, enum class EMaterialParameterType2 ParameterType, bool bOverridenOnly);
		class UMaterialInstanceDynamic* OverrideDynamicMaterialInstanceParameter(class UMaterialInstanceDynamic* TargetMaterial, class UMaterialInterface* SourceMaterial, class FName ParameterName, enum class EMaterialParameterType2 ParameterType, bool bOverridenOnly);
		void OnActorEndPlay(class AActor* Actor, enum class EEndPlayReason EndPlayReason);
		bool K2_SetVectorMaterialParameter(class AActor* Actor, const struct FMaterialChangeHandle& Handle, class FName ParameterName, const struct FVector& ParameterValue, const struct FMaterialFilter& Filter);
		bool K2_SetScalarMaterialParameter(class AActor* Actor, const struct FMaterialChangeHandle& Handle, class FName ParameterName, float ParameterValue, const struct FMaterialFilter& Filter);
		void K2_RebuildMaterialChangesOnOriginalMaterialChanged(class AActor* Actor, const TArray<class UMeshComponent*>& ChangedMeshes);
		class UMaterialInstanceDynamic* K2_OverrideDynamicMaterialInstanceAllParametersByIndex(class UMaterialInstanceDynamic* TargetMaterial, class UPrimitiveComponent* PrimitiveComponent, int32 SourceElementIndex, int32 ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, bool bOverridenOnly);
		class UMaterialInstanceDynamic* K2_OverrideDynamicMaterialInstanceAllParameters(class UMaterialInstanceDynamic* TargetMaterial, class UMaterialInterface* SourceMaterial, int32 ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, bool bOverridenOnly);
		class UMaterialInstanceDynamic* K2_CreateDynamicMaterialInstanceOverrideAllParameters(class UPrimitiveComponent* TargetPrimitiveComponent, class UMaterialInterface* SourceMaterial, int32 ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, int32 TargetElementIndex, bool bOverridenOnly, class FName OptionalMaterialName);
		struct FMaterialChangeHandle K2_AddMaterialChangeByPath(class AActor* Actor, struct FSoftObjectPath& MaterialPath, const struct FAddMaterialChangeParams& Params);
		struct FMaterialChangeHandle K2_AddMaterialChange(class AActor* Actor, class UMaterialInterface* SourceMaterial, const struct FAddMaterialChangeParams& Params);
		bool EmptyOriginalOverrideMaterials(class AActor* Actor, class UMeshComponent* MeshComp);
		bool ContainsMaterialChangeByPriority(class AActor* Actor, int32 Priority);
		bool ContainsMaterialChange(class AActor* Actor, const struct FMaterialChangeHandle& Handle);
		bool ContainsAnyMaterialChange(class AActor* Actor);
		void AddNoChangeMaterials(TArray<struct FSoftObjectPath>& Materials);
	};

	// 0x0 (0x28 - 0x28)
	// Class Solarland.ActorMaterialSubsystemAgentInterface
	class IActorMaterialSubsystemAgentInterface : public IInterface
	{
	public:

		static class UClass* StaticClass();
		static class IActorMaterialSubsystemAgentInterface* GetDefaultObj();

	};

	// 0x0 (0x28 - 0x28)
	// Class Solarland.ActorMaterialSubsystemAgentComponentInterface
	class IActorMaterialSubsystemAgentComponentInterface : public IInterface
	{
	public:

		static class UClass* StaticClass();
		static class IActorMaterialSubsystemAgentComponentInterface* GetDefaultObj();

		class UMaterialInterface* AMS_GetAlternativeSourceMaterial(class UMaterialInterface* OriginalSourceMaterial);
	};

	// 0x88 (0xB0 - 0x28)
	// Class Solarland.ActorParticleEffectSpawner
	class UActorParticleEffectSpawner : public UObject
	{
	public:
		uint8                                        Pad_14C0[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		struct FActorParticleEffectSpawnInfo         Info;                                              // 0x38(0x70)(NativeAccessSpecifierPublic)
		uint8                                        Pad_14C1[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UActorParticleEffectSpawner* GetDefaultObj();

	};

	// 0x20 (0x50 - 0x30)
	// Class Solarland.ActorParticleEffectSubsystem
	class UActorParticleEffectSubsystem : public UWorldSubsystem
	{
	public:
		uint8                                        Pad_14C9[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class UActorParticleEffectSpawner*>   Spawners;                                          // 0x40(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

		static class UClass* StaticClass();
		static class UActorParticleEffectSubsystem* GetDefaultObj();

		struct FActorParticleEffectSpawnHandle K2_RequestParticleEffectSpawn(class AActor* Actor, const struct FActorParticleEffectSpawnInfo& SpawnInfo);
		void CancelParticleEffectSpawn(const struct FActorParticleEffectSpawnHandle& Handle);
	};

	// 0x90 (0xC0 - 0x30)
	// Class Solarland.ActorReadySubsystem
	class UActorReadySubsystem : public UWorldSubsystem
	{
	public:
		uint8                                        Pad_14CE[0x90];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UActorReadySubsystem* GetDefaultObj();

		void OnGameStateSet(class AGameStateBase* GameState);
		void OnActorPropertyChanged(class UObject* InObject);
		void OnActorEndPlay(class AActor* TargetActor);
		void HasDataWaitTooLong();
	};

	// 0xB0 (0x310 - 0x260)
	// Class Solarland.AdvProgressBase
	class UAdvProgressBase : public UUserWidget
	{
	public:
		class UImage* Progress;                                          // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UMaterialInstance* ProgressShader;                                    // 0x268(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        Speed;                                             // 0x270(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        CurrentHP;                                         // 0x274(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        MaxHP;                                             // 0x278(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_14EF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TMap<int32, float>                           ActionMap;                                         // 0x280(0x50)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
		float                                        AnimCurrentHP;                                     // 0x2D0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        ProgressAdd;                                       // 0x2D4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        ProgressMinus;                                     // 0x2D8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_14F1[0x34];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAdvProgressBase* GetDefaultObj();

		void UpdateMaxHPLength(float NewHPMax, float NewCurrentHP);
		void SetProgress(float _PreMinus, float _CurrentHP, float _PreAdd);
		int32 PreAction(float Number);
		void Init(float _DefaultHP, float _MaxHP);
		float GetMaxHP();
		float GetCurrentHPPercent();
		void DoActionSmoothly(float Number);
		void DoActionDirectly(float Number);
		void DoAction(int32 ID);
		struct FLinearColor Debug();
		void CleanPreActions();
		void CancelAction(int32 ID);
	};

	// 0x0 (0x400 - 0x400)
	// Class Solarland.AerialReconnaissanceMarkWidget
	class UAerialReconnaissanceMarkWidget : public USolarUserWidget
	{
	public:

		static class UClass* StaticClass();
		static class UAerialReconnaissanceMarkWidget* GetDefaultObj();

		void K2_MarkStateChanged(bool bInStart);
	};

	// 0x38 (0x260 - 0x228)
	// Class Solarland.AirDropAudioActor
	class AAirDropAudioActor : public AActor
	{
	public:
		uint8                                        Pad_14F8[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        ThisID;                                            // 0x238(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_14F9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         bSummonedByCharacter;                              // 0x240(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_14FA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UAkComponent* AkAudioComponent;                                  // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class USolarAkGameObject* SolarAkGameObject;                                 // 0x250(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bHasLanded;                                        // 0x258(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_14FB[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class AAirDropAudioActor* GetDefaultObj();

		void InitSolarAkGameObject(class UActorComponent* Component, bool bReset);
		void DisappearAirDropArrow();
	};

	// 0xE0 (0x110 - 0x30)
	// Class Solarland.AirDropOutcomeConfig
	class UAirDropOutcomeConfig : public UDataAsset
	{
	public:
		int32                                        OutcomeID;                                         // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_14FC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<struct FAirDropSkillDatas>            AirDropSkillSetting;                               // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FWrappedLevelToIdMap                  ShieldIdConfig;                                    // 0x48(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
		int32                                        SniperScopePartOutcomeId;                          // 0x98(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_14FE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TMap<enum class EWeaponPartType, struct FWrappedLevelToIdMap> WeaponPartIdConfig;                                // 0xA0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
		TArray<struct FWrappedIdCount>               SupplyItemArray;                                   // 0xF0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FAirDropAllOutcomeConfigArray> OutcomeSeries;                                     // 0x100(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UAirDropOutcomeConfig* GetDefaultObj();

	};

	// 0x0 (0x228 - 0x228)
	// Class Solarland.SolarDormantActor
	class ASolarDormantActor : public AActor
	{
	public:

		static class UClass* StaticClass();
		static class ASolarDormantActor* GetDefaultObj();

	};

	// 0x1E0 (0x408 - 0x228)
	// Class Solarland.SolarItemActor
	class ASolarItemActor : public ASolarDormantActor
	{
	public:
		uint8                                        Pad_1510[0x48];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		struct FSolarItemData                        ItemData;                                          // 0x270(0xB8)(Net, RepNotify, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize                   DroppedLocation;                                   // 0x328(0xC)(Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        SpawnOffset;                                       // 0x334(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FSoftObjectPath>               DiscardMatPath;                                    // 0x338(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSoftObjectPath                       OutlineMatPath;                                    // 0x348(0x18)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSoftObjectPath                       FXPath;                                            // 0x360(0x18)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        NoneMeshFxOffset;                                  // 0x378(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        PositionTolerance;                                 // 0x37C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                FXBPPath;                                          // 0x380(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class USphereComponent* SphereComponent;                                   // 0x390(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1515[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TWeakObjectPtr<class AActor>                 FXActor;                                           // 0x39C(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		enum class EItemState                        ItemCurrentState;                                  // 0x3A4(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1516[0xB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<uint8>                                MarkedTeamIdList;                                  // 0x3B0(0x10)(Net, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1517[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UStaticMeshComponent* StaticMeshComp;                                    // 0x3C8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<class UMaterialInstanceDynamic*>      NormalMats;                                        // 0x3D0(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<class UMaterialInstanceDynamic*>      OutlineMats;                                       // 0x3E0(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bAdjustDroppedLocationByLandscape;                 // 0x3F0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1518[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FSolarLandscapeListenerConfig         LandscapeListenerConfig;                           // 0x3F4(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
		uint8                                        Pad_1519[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class ASolarItemActor* GetDefaultObj();

		void UnMarkThisItem(uint8 TeamID);
		void SwitchDiscardMaterials();
		void SetOutlineMeshVisible(bool Visible);
		void SetItemData(struct FSolarItemData& _ItemData);
		void OnServerPawned();
		void OnRep_ItemDataChange();
		void OnRep_ItemCurrentStateChanged();
		void OnRep_DroppedLocation();
		void NotifyThisItemWasPickedUp();
		void MarkThisItem(uint8 TeamID);
		class UStaticMeshComponent* GetStaticMeshComp();
		int32 GetQuality();
	};

	// 0x200 (0x608 - 0x408)
	// Class Solarland.SolarTreasureBoxActor
	class ASolarTreasureBoxActor : public ASolarItemActor
	{
	public:
		enum class ETreasureBoxState                 CurrentState;                                      // 0x408(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1523[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FSolarItemDataArray                   ItemDataList;                                      // 0x410(0x118)(Edit, Net, Transient, RepNotify, NativeAccessSpecifierPublic)
		TArray<struct FSolarItemData>                SortedGameItemDatas;                               // 0x528(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1524[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        DataLeng;                                          // 0x558(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		enum class ECostType                         CostType;                                          // 0x55C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1525[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        CostNum;                                           // 0x560(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1526[0x54];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        HighestItemQuality;                                // 0x5B8(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        BurstRadius;                                       // 0x5BC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        BurstRadiusRandScale;                              // 0x5C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        BurstLocalHeight;                                  // 0x5C4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        BurstEulerAngle;                                   // 0x5C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bBurstSplitItem;                                   // 0x5CC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class EBurstMethod                      BurstMethod;                                       // 0x5CD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1529[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        RadSafeSlopeToBurstOn;                             // 0x5D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        GoldenSpiralMinRadiusSquared;                      // 0x5D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class ASolarBurstItemActor*>          BurstItemActors;                                   // 0x5D8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                               MeshBoxExtent;                                     // 0x5E8(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_152B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UAkComponent* AkAudioComponent;                                  // 0x5F8(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class USolarAkGameObject* SolarAkGameObject;                                 // 0x600(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class ASolarTreasureBoxActor* GetDefaultObj();

		void UpdateTreasureBoxInternal();
		void UpdateOpenBoxUIByState(enum class ETreasureBoxState NewState);
		void UpdateItemDataListInternal();
		void ServerSetState(enum class ETreasureBoxState NewState, class ASolarCharacter* RequestCharacter);
		void ServerNotifyPlayerOpen(class ASolarCharacter* RequestCharacter, enum class EItemType InItemType);
		void PlayOpenAnimation();
		void OnRep_ItemDataList();
		void OnRep_CurrentState();
		void OnClientItemHighestQualityChanged(int32 NewQuality, int32 PrevQuality);
		bool IsEmpty();
		void InitSolarAkGameObject(class UActorComponent* Component, bool bReset);
		int32 GetNumCost();
		TArray<struct FSolarItemData> GetItemList();
		enum class ECostType GetCostType();
		void ConstructTreasureBoxTest(TArray<int32>* ItemIdList);
		void ConstructTreasureBox(int32 DropId);
		bool BOpened();
	};

	// 0x688 (0xC90 - 0x608)
	// Class Solarland.AirDropTreasureBox
	class AAirDropTreasureBox : public ASolarTreasureBoxActor
	{
	public:
		bool                                         bPendingDestroy;                                   // 0x608(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1557[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        OpenProgress;                                      // 0x60C(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ASolarCharacter* OpeningCharacter;                                  // 0x610(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        OpenTime;                                          // 0x618(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ProtectionTime;                                    // 0x61C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1559[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        StartDropHeight;                                   // 0x630(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FVector                               TargetLocation;                                    // 0x634(0xC)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FRotator                              TargetRotation;                                    // 0x640(0xC)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
		struct FVector                               SummonCharLocation;                                // 0x64C(0xC)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        RecordDropTime;                                    // 0x658(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_155C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		enum class EAirDropMovementState             MovementState;                                     // 0x660(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_155D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        InitialHeight;                                     // 0x664(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        DropGravity;                                       // 0x668(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        MaxDropSpeed;                                      // 0x66C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        DecelerateHeight;                                  // 0x670(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        ApplyDamageHeight;                                 // 0x674(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        DecelerateTime;                                    // 0x678(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1560[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UCurveFloat* DecelerateCurve;                                   // 0x680(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        SqueezePawnRadius;                                 // 0x688(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        ThrustPawnStrength;                                // 0x68C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        CollideUpBoundingRatio;                            // 0x690(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        CollidePushUpAngle;                                // 0x694(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UCurveFloat* CollidePushSpeedCurve;                             // 0x698(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1561[0x38];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        ApplyDamageRate;                                   // 0x6D8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1563[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FSolarDamageInfo                      DamageInfo;                                        // 0x6E0(0x40)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
		uint8                                        Pad_1564[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		enum class EAirDropOpenState                 OpenState;                                         // 0x728(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1565[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class FString                                SummonPlayerID;                                    // 0x730(0x10)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSoftObjectPtr<class UParticleSystem>        OpenAirdropEffect;                                 // 0x740(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSoftObjectPtr<class UParticleSystem>        LandHitEffect;                                     // 0x768(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSoftObjectPtr<class UParticleSystem>        LandSmokeEffect;                                   // 0x790(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSoftObjectPtr<class UParticleSystem>        PendingDestroyEffect;                              // 0x7B8(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSoftObjectPtr<class UParticleSystem>        DestroyEffect;                                     // 0x7E0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSoftObjectPtr<class UParticleSystem>        FallingEffect;                                     // 0x808(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSoftObjectPtr<class UParticleSystem>        FallingImpulseEffect;                              // 0x830(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSoftObjectPtr<class UParticleSystem>        LightBeamEffect;                                   // 0x858(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FTransform                            FallingEffectOffset;                               // 0x880(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FTransform                            FallingImpulseEffectOffset;                        // 0x8B0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FTransform                            LightBeamEffectOffset;                             // 0x8E0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FTransform                            PendingDestroyEffectOffset;                        // 0x910(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		class UAnimationAsset* LandAnimation;                                     // 0x940(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UAnimationAsset* OpenAnimation;                                     // 0x948(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ShowLandSmokeHeight;                               // 0x950(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        AirDropSpawnDelay;                                 // 0x954(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        FallingEffectDelay;                                // 0x958(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bSummonBySkill;                                    // 0x95C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1569[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        YawOffset;                                         // 0x960(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_156B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class USkeletalMeshComponent* SkeletalMeshComp;                                  // 0x968(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_156C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UParticleSystemComponent* LandSmokePSC;                                      // 0x978(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UParticleSystemComponent* PendingDestroyPSC;                                 // 0x980(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UParticleSystemComponent* FallingPSC;                                        // 0x988(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UParticleSystemComponent* FallingImpulsePSC;                                 // 0x990(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UParticleSystemComponent* LightBeamPSC;                                      // 0x998(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_156D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FSoftClassPath                        AirDropGuideMeshBPClassPath;                       // 0x9A8(0x18)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        GuideArrowDisappearHeight;                         // 0x9C0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_156E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class FString                                SNameAirDropOpen;                                  // 0x9C8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNameLandHit;                                      // 0x9D8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNameAirDropSpawn;                                 // 0x9E8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNameStartDrop;                                    // 0x9F8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNameStopDrop;                                     // 0xA08(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNameDecelerateAudio;                              // 0xA18(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNamePlayLandedLoopAudio;                          // 0xA28(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNameStopLandedLoopAudio;                          // 0xA38(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNamePlayOnGroundBroadcastLoopAudio;               // 0xA48(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNameStopOnGroundBroadcastLoopAudio;               // 0xA58(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNamePlayStartHackAudio;                           // 0xA68(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNameStopStartHackAudio;                           // 0xA78(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNamePlayHackingLoopAudio;                         // 0xA88(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNameStopHackingLoopAudio;                         // 0xA98(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNameStopHackingLoopAudioAux;                      // 0xAA8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                PendingDestroyLoopStart;                           // 0xAB8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                PendingDestroyLoopEnd;                             // 0xAC8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SNameDestroySound;                                 // 0xAD8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1570[0x68];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		class FName                                  ColorKeyTag1;                                      // 0xB50(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class FName                                  ColorKeyTag2;                                      // 0xB58(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class FName                                  ColorKeyGlow;                                      // 0xB60(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class FName                                  ColorKeyMesh;                                      // 0xB68(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class FName                                  AlphaKey;                                          // 0xB70(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class FName                                  LightBeamAlphaKey;                                 // 0xB78(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class FName                                  ColorKeyTagFlow1;                                  // 0xB80(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class FName                                  ColorKeyTagFlow2;                                  // 0xB88(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class FName                                  ColorKeyLightEffect;                               // 0xB90(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        FadeTweenDuration;                                 // 0xB98(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        RedTweenDuration;                                  // 0xB9C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          BlueColorTag1;                                     // 0xBA0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          RedColorTag1;                                      // 0xBB0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          BlueColorTag2;                                     // 0xBC0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          RedColorTag2;                                      // 0xBD0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          BlueColorGlow;                                     // 0xBE0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          RedColorGlow;                                      // 0xBF0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          BlueColorMesh;                                     // 0xC00(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          RedColorMesh;                                      // 0xC10(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          RedColorTagFlow1;                                  // 0xC20(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          RedColorTagFlow2;                                  // 0xC30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          BlueColorTagFlow1;                                 // 0xC40(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          BlueColorTagFlow2;                                 // 0xC50(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          RedColorLightEffect;                               // 0xC60(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FLinearColor                          BlueColorLightEffect;                              // 0xC70(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1575[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class AAirDropTreasureBox* GetDefaultObj();

		void ReceiveOnOpenStateChanged(enum class EAirDropOpenState InPrevOpenState, enum class EAirDropOpenState InCurrOpenState);
		void PlayLandingAnimation();
		bool OpenAirDropTreasureBox(class ASolarCharacter* _OpeningCharacter);
		void OnStateChanged();
		void OnRep_TargetLocation(const struct FVector& PreTargetLocation);
		void OnRep_SummonPlayerID();
		void OnRep_SummonCharLocation();
		void OnRep_StartDropHeight();
		void OnRep_RecordDropTime(float PreDropTime);
		void OnRep_PendingDestroy();
		void OnRep_OpenState(enum class EAirDropOpenState PreOpenState);
		void OnRep_OpenProgressChange();
		void OnRep_OpenCharacterChange();
		void OnRep_MovementState(enum class EAirDropMovementState PreMovementState);
		void OnMovementStateChanged(enum class EAirDropMovementState InPrevMovementState, enum class EAirDropMovementState InCurrMovementState);
		void OnFadeOutFallingEffect();
		bool IsSummonedByCharacter();
		bool IsOpenningCharacterOffline();
		bool IsCharacterInRange(class ASolarCharacter* InCheckCharacter);
		bool CancelOpenAirDropTreasureBox(class ASolarCharacter* _OpeningCharacter);
	};

	// 0x0 (0x28 - 0x28)
	// Class Solarland.AirlineCruiseCompInterface
	class IAirlineCruiseCompInterface : public IInterface
	{
	public:

		static class UClass* StaticClass();
		static class IAirlineCruiseCompInterface* GetDefaultObj();

		class UAirlineCruiseComponent* GetAirlineCruiseComponent();
	};

	// 0x20 (0xD0 - 0xB0)
	// Class Solarland.GameModeCompBase
	class UGameModeCompBase : public UActorComponent
	{
	public:
		uint8                                        Pad_1596[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         bPreStartPlay;                                     // 0xB8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bTakeChargeStartPlay;                              // 0xB9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bPostStartPlay;                                    // 0xBA(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1597[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         bPreHandleMatchHasStarted;                         // 0xBD(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bTakeChargeHandleMatchHasStarted;                  // 0xBE(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bPostHandleMatchHasStarted;                        // 0xBF(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1599[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         bPreRestartPlayer;                                 // 0xC2(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bTakeChargeRestartPlayer;                          // 0xC3(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bPostRestartPlayer;                                // 0xC4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_159B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         bPreEndPlay;                                       // 0xC7(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bTakeChargeEndPlay;                                // 0xC8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bPostEndPlay;                                      // 0xC9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_159D[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UGameModeCompBase* GetDefaultObj();

		void PreStartPlayBind(TArray<class UGameModeCompBase*>& ComponentCollection);
		void PreRestartPlayerBind(TArray<class UGameModeCompBase*>& ComponentCollection, class AController* NewPlayer);
		void PreHandleMatchHasStartedBind(TArray<class UGameModeCompBase*>& ComponentCollection);
		void PreGameModeStartPlay(TArray<class UGameModeCompBase*>& ComponentCollection);
		void PreGameModeRestartPlayer(TArray<class UGameModeCompBase*>& ComponentCollection, class AController* NewPlayer);
		void PreGameModeHandleMatchHasStarted(TArray<class UGameModeCompBase*>& ComponentCollection);
		void PreGameModeEndPlay(TArray<class UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason);
		void PreEndPlayBind(TArray<class UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason);
		void PostStartPlayBind(TArray<class UGameModeCompBase*>& ComponentCollection);
		void PostRestartPlayerBind(TArray<class UGameModeCompBase*>& ComponentCollection, class AController* NewPlayer);
		void PostHandleMatchHasStartedBind(TArray<class UGameModeCompBase*>& ComponentCollection);
		void PostGameModeStartPlay(TArray<class UGameModeCompBase*>& ComponentCollection);
		void PostGameModeRestartPlayer(TArray<class UGameModeCompBase*>& ComponentCollection, class AController* NewPlayer);
		void PostGameModeHandleMatchHasStarted(TArray<class UGameModeCompBase*>& ComponentCollection);
		void PostGameModeEndPlay(TArray<class UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason);
		void PostEndPlayBind(TArray<class UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason);
		void OnGameModeStartPlay(bool* bOutSuccess, TArray<class UGameModeCompBase*>& ComponentCollection);
		void OnGameModeRestartPlayer(bool* bOutSuccess, TArray<class UGameModeCompBase*>& ComponentCollection, class AController* NewPlayer);
		void OnGameModeHandleMatchHasStarted(bool* bOutSuccess, TArray<class UGameModeCompBase*>& ComponentCollection);
		void OnGameModeEndPlay(bool* bOutSuccess, TArray<class UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason);
		class ASolarGameMode* GetGameModeOwner();
	};

	// 0x78 (0x148 - 0xD0)
	// Class Solarland.AirlineCruiseComponent
	class UAirlineCruiseComponent : public UGameModeCompBase
	{
	public:
		int32                                        UsedAirlineID;                                     // 0xD0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15A5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TSubclassOf<class ASolarCapsuleRoot>         CapsuleRootClass;                                  // 0xD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class ASolarCapsuleRoot* CapsuleRoot;                                       // 0xE0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TMap<int32, struct FAirlineData>             AirlineDataList;                                   // 0xE8(0x50)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
		class ASolarCharacter* CruiseTemplate;                                    // 0x138(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_15A6[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAirlineCruiseComponent* GetDefaultObj();

		void OnPlayerJoin(class ASCMPlayerState* PlayerState);
		void OnCruiseCompleted(class AActor* DestroyedRoot);
		void OnAIJoin(class ASCMPlayerState* PlayerState);
		int32 GetUsedAirlineData(struct FAirlineData* OutData);
	};

	// 0x4A0 (0x4D0 - 0x30)
	// Class Solarland.AirPlaneVehicleDataAsset
	class UAirPlaneVehicleDataAsset : public UDataAsset
	{
	public:
		struct FRuntimeFloatCurve                    AdditionalLiftCurveBasedOnVelocity;                // 0x30(0x88)(Edit, NativeAccessSpecifierPublic)
		struct FRuntimeFloatCurve                    AdditionalLiftCurveBasedOnVelocityZ;               // 0xB8(0x88)(Edit, NativeAccessSpecifierPublic)
		struct FRuntimeFloatCurve                    AdditionalLiftCurveBasedOnPitch;                   // 0x140(0x88)(Edit, NativeAccessSpecifierPublic)
		struct FRuntimeFloatCurve                    AdditionalLiftForPitchUpFactorCurve;               // 0x1C8(0x88)(Edit, NativeAccessSpecifierPublic)
		float                                        AdditionalLiftForClampGravity;                     // 0x250(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15A7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FRuntimeFloatCurve                    AdditionalLiftCurveForPitchUp;                     // 0x258(0x88)(Edit, NativeAccessSpecifierPublic)
		struct FRuntimeFloatCurve                    CruisingSpeedMultiplier;                           // 0x2E0(0x88)(Edit, NativeAccessSpecifierPublic)
		struct FGameplayTag                          RollingCostTag;                                    // 0x368(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        CruisingRotateAccelaration;                        // 0x370(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        CruisingRotateDecelaration;                        // 0x374(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        CruisingMaxAngularSpeed;                           // 0x378(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        CruisingClampMaxSpeedMultiplier;                   // 0x37C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameplayTagContainer                 CancelCruisingTags;                                // 0x380(0x20)(Edit, NativeAccessSpecifierPublic)
		float                                        RollBackEndSpeed;                                  // 0x3A0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        RollBackCameraDuration;                            // 0x3A4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FVehicleVFX>                   ThrusterParticles;                                 // 0x3A8(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ThrusterParticleWithThrottle;                      // 0x3B8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ThrusterParticleWithoutThrottle;                   // 0x3BC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ThrusterParticleSpeed;                             // 0x3C0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ThrusterParticleDeactivateSpeed;                   // 0x3C4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FVehicleVFX>                   WingParticles;                                     // 0x3C8(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        WingParticleSpeed;                                 // 0x3D8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        WingParticleDeactivateSpeed;                       // 0x3DC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        PreTakeOffDuration;                                // 0x3E0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        PreTakeOffHoverForceMultiplier;                    // 0x3E4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        TakingOffPitchOffset;                              // 0x3E8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15A9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FRuntimeFloatCurve                    TakingOffStabilizeSpeedCurve;                      // 0x3F0(0x88)(Edit, NativeAccessSpecifierPublic)
		int32                                        AmmoMaterialIndex;                                 // 0x478(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                  MataterialProgressParam;                           // 0x47C(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                  MataterialColorParam;                              // 0x484(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FLinearColor                          NormalColor;                                       // 0x48C(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FLinearColor                          ReloadingColor;                                    // 0x49C(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FFloatRange                           MataterialProgressRange;                           // 0x4AC(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15AA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<struct FVehicleVFX>                   BulletSocketParticles;                             // 0x4C0(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UAirPlaneVehicleDataAsset* GetDefaultObj();

	};

	// 0x720 (0x750 - 0x30)
	// Class Solarland.AmmoConfig
	class UAmmoConfig : public UDataAsset
	{
	public:
		enum class EHoldActionType                   HoldAction;                                        // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15CD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<struct FFireChargeData>               FireChargeDatas;                                   // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                FireChargeStopSoundName;                           // 0x48(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ChargingToleranceEndTime;                          // 0x58(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ChargingWorkingEndTime;                            // 0x5C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ChargingHoldingEndTime;                            // 0x60(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ChargingTrajectoryTime;                            // 0x64(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bScaleHitEffectByChargingTime;                     // 0x68(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bCostToChargeScale;                                // 0x69(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15D0[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        FireCostFullShot;                                  // 0x6C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bForceFullShot;                                    // 0x70(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15D2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        MaxChargingDamageScale;                            // 0x74(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        DeltaAngle;                                        // 0x78(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15D3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class FString                                Name;                                              // 0x80(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Des;                                               // 0x90(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        PropID;                                            // 0xA0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        LifeTime;                                          // 0xA4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class EFireMethodType                   FireMethodType;                                    // 0xA8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class ETrajectoryType                   TrajectoryType;                                    // 0xA9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15D6[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        CustomValue;                                       // 0xAC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSubclassOf<class ASolarBullet>              BulletClass;                                       // 0xB0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSoftClassPath                        BulletClassPath;                                   // 0xB8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class ETriggerType                      TriggerType;                                       // 0xD0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15D9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        MaxRange;                                          // 0xD4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        EffRange;                                          // 0xD8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        Radius;                                            // 0xDC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        InitSpeed;                                         // 0xE0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class ECostFireType                     FireCostType;                                      // 0xE4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15DB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        FireCostPerAttack;                                 // 0xE8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        FireSpeedChangeTime;                               // 0xEC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        FireSpeedChangeCOP;                                // 0xF0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        FastestFireInterval;                               // 0xF4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        SlowestFireInterval;                               // 0xF8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        BaseFireInterval;                                  // 0xFC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        FireIntervalRevertPreTime;                         // 0x100(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        FireIntervalReavertSpeed;                          // 0x104(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        BoltActionTime;                                    // 0x108(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        StartBoltDuration;                                 // 0x10C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        FirePrepareTime;                                   // 0x110(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        FireStateBreakTime;                                // 0x114(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        FireStreakBreakTime;                               // 0x118(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        BaseReloadTime;                                    // 0x11C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ReloadBoltTime;                                    // 0x120(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        PostFireOverload;                                  // 0x124(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bPlayHitSound;                                     // 0x128(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bPlayExplodeSound;                                 // 0x129(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15E0[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        FlySoundReceiveRadius;                             // 0x12C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        FlySoundIgnoreDistance;                            // 0x130(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        SingleSoundCount;                                  // 0x134(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Play_Land_Common_Hit_1P;                           // 0x138(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Play_Land_Common_Hit_3P;                           // 0x148(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Play_Land_Common_Hit_3P_Enemy;                     // 0x158(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Play_Land_Fly_Once_3P;                             // 0x168(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Play_Land_Fly_Once_3P_Enemy;                       // 0x178(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Play_Land_Fly_Loop_1P;                             // 0x188(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Play_Land_Fly_Loop_3P;                             // 0x198(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Play_Land_Fly_Loop_3P_Enemy;                       // 0x1A8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Stop_Land_Fly_Loop_1P;                             // 0x1B8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Stop_Land_Fly_Loop_3P;                             // 0x1C8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Stop_Land_Fly_Loop_3P_Enemy;                       // 0x1D8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Play_Fire_Empty_1p;                                // 0x1E8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Play_Fire_Empty_3p;                                // 0x1F8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                Play_Fire_Empty_3p_Enemy;                          // 0x208(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UCurveFloat* PostFireSpreadCurveStruct;                         // 0x218(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        VhADSSpreadCOP;                                    // 0x220(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ADSSpreadCOP;                                      // 0x224(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        SpreadFirePreTime;                                 // 0x228(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        SpreadPostFireSpeed;                               // 0x22C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        SpreadRestorePreTime;                              // 0x230(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        SpreadRestoreSpeed;                                // 0x234(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FWeaponFireTPPAnimConfig              TPPRecoilConfig;                                   // 0x238(0x28)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
		struct FWeaponFireFPPAnimConfig              FPPRecoilConfigNoScope;                            // 0x260(0x70)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
		struct FWeaponFireFPPAnimConfig              FPPRecoilConfigWithScope;                          // 0x2D0(0x70)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
		struct FAmmonVerticalRecoilStruct            PitchRecoilStruct;                                 // 0x340(0x30)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
		struct FAmmonHorizontalRecoilStruct          YawRecoilStruct;                                   // 0x370(0x30)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
		struct FAmmonRecoilRollStruct                RollRecoilStruct;                                  // 0x3A0(0x40)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
		struct FAmmonRecoilScope                     ScopeRecoil;                                       // 0x3E0(0xB8)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
		float                                        ADSRecoilCOP;                                      // 0x498(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15E7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TMap<class FString, float>                   RecoilCOPMap;                                      // 0x4A0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
		TArray<enum class EPhysicalSurface>          IgnoreEPhysicalSurface;                            // 0x4F0(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ProjectileMaxGravity;                              // 0x500(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ParticleStartDistance;                             // 0x504(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        TrajectoryStartDistance;                           // 0x508(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bPenetrable;                                       // 0x50C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bTakeDamageAfterDeathVerge;                        // 0x50D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15E8[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UCurveFloat* PenetrationDamageMultiplierCurve;                  // 0x510(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UCurveFloat* CylinderDamageMultiplierCurve;                     // 0x518(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSlateBrush                           TriggerIcon;                                       // 0x520(0xE0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
		enum class EVirtualBulletType                VirtualBulletType;                                 // 0x600(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bStepOnServer;                                     // 0x601(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bUseSubStepping;                                   // 0x602(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15EA[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        MaxSimulationTimeStep;                             // 0x604(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        MaxSimulationIterations;                           // 0x608(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15EB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UAmmoConfig* TraceOverrideAmmo;                                 // 0x610(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        TraceTargetFlag;                                   // 0x618(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15EC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FTracerBulletData                     TracerData;                                        // 0x620(0x40)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
		class UCurveFloat* BulletOffsetCurve;                                 // 0x660(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FVector2D>                     BulletOffsetAngles;                                // 0x668(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UCurveFloat* BulletDamageCurve;                                 // 0x678(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UCurveFloat* BulletScaleCurve;                                  // 0x680(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UCurveFloat* BulletMovementCurve;                               // 0x688(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bThirdPesonViewXScaledByDistance;                  // 0x690(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bForceApplyAbility;                                // 0x691(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15EE[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<TSubclassOf<class ASolarAbility>>     AmmoAbilityClasses;                                // 0x698(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<TSubclassOf<class ASolarAbility>>     AmmoAbilityClassesOnDestroyed;                     // 0x6A8(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSubclassOf<class ASolarAbility>             AmmoAbilityClassesOnSelf;                          // 0x6B8(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        NameLocalTextIDNumber;                             // 0x6C0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        DescriptionLocalTextIDNumber;                      // 0x6C4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        RangeLocalTextID;                                  // 0x6C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        DifficultyLocalTextID;                             // 0x6CC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSolarDamageInfo                      DamageInfo;                                        // 0x6D0(0x40)(Edit, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
		struct FSolarDamageInfo                      DestroyDamageInfo;                                 // 0x710(0x40)(Edit, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAmmoConfig* GetDefaultObj();

		void InitVerticalRecoilStruct(float CostTime, int32 AIndex, float AMin, float AMax, int32 BIndex, float BMin, float BMax);
		void InitSpreadData(float Adscop, float Vhadscop, float Firepre, float Changespeed, float Restorepre, float Restorespeed);
		void InitScopeRollRecoilStruct(float CostTime, int32 AIndex, float AMin, float AMax, int32 BIndex, float BMin, float BMax, float Adscop);
		void InitScopeAndCrossHairVibration(float ScopeVMaxDistanceOffSet, float ScopeVVibrationDuration, float ScopeHMaxDistanceOffSet, float ScopeHVibrationDuration, float ScopeVContinuousFallingDuration, float ScopeVContinuousFallingPointIndex, float VMaxDistanceOffSetScale, float VVibrationDurationScale, float VSingleOffSetScale, float VContinuousOffSetScale, float HMaxDistanceOffSetScale, float HVibrationDurationScale, float HSingleOffSetScale, float HContinuousOffSetScale, float HOffSetProbabilityScale);
		void InitRollRecoilStruct(float CostTime, int32 AIndex, float AMin, float AMax, int32 BIndex, float BMin, float BMax, float Adscop);
		void InitRecoilCOPMap(TArray<class FString>& Keys, TArray<float>& Values);
		void InitPostFireSpreadCurveStruct(const class FString& Path);
		void InitHorizontalRecoilStruct(float CostTime, int32 AIndex, float AMin, float AMax, int32 BIndex, float BMin, float BMax);
		void InitBaseData(int32 Trigger);
	};

	// 0x10 (0x760 - 0x750)
	// Class Solarland.AmmoCanisterConfig
	class UAmmoCanisterConfig : public UAmmoConfig
	{
	public:
		int32                                        ShrapnelSum;                                       // 0x750(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        MaxShrapnelEffectSum;                              // 0x754(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15F6[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAmmoCanisterConfig* GetDefaultObj();

	};

	// 0x0 (0x750 - 0x750)
	// Class Solarland.AmmoGravityLineConfig
	class UAmmoGravityLineConfig : public UAmmoConfig
	{
	public:

		static class UClass* StaticClass();
		static class UAmmoGravityLineConfig* GetDefaultObj();

	};

	// 0x10 (0x38 - 0x28)
	// Class Solarland.AndroidInputManager
	class UAndroidInputManager : public UObject
	{
	public:
		FMulticastInlineDelegateProperty_            OnAndroidBackPressed;                              // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UAndroidInputManager* GetDefaultObj();

	};

	// 0x8 (0x40 - 0x38)
	// Class Solarland.AnimNotify_ChangeWeaponAttachState
	class UAnimNotify_ChangeWeaponAttachState : public UAnimNotify
	{
	public:
		enum class EWeaponSlotType                   EWeaponSlot;                                       // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class EWeaponAttachState                AttachState;                                       // 0x39(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_15FF[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAnimNotify_ChangeWeaponAttachState* GetDefaultObj();

	};

	// 0x10 (0x48 - 0x38)
	// Class Solarland.AnimNotify_CharacterFootEffect
	class UAnimNotify_CharacterFootEffect : public UAnimNotify
	{
	public:
		TArray<struct FFootEffect>                   FootEffectList;                                    // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UAnimNotify_CharacterFootEffect* GetDefaultObj();

		void AddNewFootEffect(struct FFootEffect& NewEffect);
	};

	// 0x8 (0x40 - 0x38)
	// Class Solarland.AnimNotify_CharacterPlaySoundGroup
	class UAnimNotify_CharacterPlaySoundGroup : public UAnimNotify
	{
	public:
		class FName                                  SoundGroupName;                                    // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UAnimNotify_CharacterPlaySoundGroup* GetDefaultObj();

	};

	// 0x10 (0x48 - 0x38)
	// Class Solarland.AnimNotify_CharacterPlaySoundGroups
	class UAnimNotify_CharacterPlaySoundGroups : public UAnimNotify
	{
	public:
		TArray<class FName>                          SoundGroupNames;                                   // 0x38(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UAnimNotify_CharacterPlaySoundGroups* GetDefaultObj();

	};

	// 0x8 (0x40 - 0x38)
	// Class Solarland.SolarAnimNotify
	class USolarAnimNotify : public UAnimNotify
	{
	public:
		bool                                         bDynamic;                                          // 0x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1603[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class USolarAnimNotify* GetDefaultObj();

	};

	// 0x40 (0x80 - 0x40)
	// Class Solarland.AnimNotify_CharacterStartSound
	class UAnimNotify_CharacterStartSound : public USolarAnimNotify
	{
	public:
		TArray<struct FCharacterSound>               SoundList;                                         // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bUseSwitch;                                        // 0x50(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1607[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class FString>                        SwitchGroupNames;                                  // 0x58(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bUseRTPC;                                          // 0x68(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1608[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class FString>                        RPTCNames;                                         // 0x70(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAnimNotify_CharacterStartSound* GetDefaultObj();

		int32 RemoveAllSwitches();
		int32 RemoveAllRPTCs();
		int32 RemoveAllCharacterSounds();
		void AddNewSwitch(const class FString& NewSwitch);
		void AddNewRPTC(const class FString& NewRTPC);
		void AddNewCharacterSound(struct FCharacterSound& NewSound);
	};

	// 0x10 (0x48 - 0x38)
	// Class Solarland.AnimNotify_CharacterStopSound
	class UAnimNotify_CharacterStopSound : public UAnimNotify
	{
	public:
		TArray<struct FCharacterSound>               StopList;                                          // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAnimNotify_CharacterStopSound* GetDefaultObj();

		int32 RemoveAllCharacterSoundStops();
		void AddNewCharacterSoundStop(struct FCharacterSound& NewStop);
	};

	// 0x8 (0x40 - 0x38)
	// Class Solarland.AnimNotify_ExecuteGameplayCueLocal
	class UAnimNotify_ExecuteGameplayCueLocal : public UAnimNotify
	{
	public:
		struct FGameplayCueTag                       GameplayCueTag;                                    // 0x38(0x8)(Edit, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAnimNotify_ExecuteGameplayCueLocal* GetDefaultObj();

	};

	// 0x50 (0x88 - 0x38)
	// Class Solarland.AnimNotify_FlyWaterEffect
	class UAnimNotify_FlyWaterEffect : public UAnimNotify
	{
	public:
		class UParticleSystem* PSTemplate;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSoftObjectPtr<class UParticleSystem>        PSTemplateSoft;                                    // 0x40(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                  SocketName;                                        // 0x68(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                               LocationOffset;                                    // 0x70(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FRotator                              RotationOffset;                                    // 0x7C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UAnimNotify_FlyWaterEffect* GetDefaultObj();

	};

	// 0x10 (0x48 - 0x38)
	// Class Solarland.AnimNotify_LegVehicleRiseDust
	class UAnimNotify_LegVehicleRiseDust : public UAnimNotify
	{
	public:
		TArray<int32>                                NotifyFootIndex;                                   // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAnimNotify_LegVehicleRiseDust* GetDefaultObj();

	};

	// 0xE8 (0x120 - 0x38)
	// Class Solarland.AnimNotify_PlayParticleAsync
	class UAnimNotify_PlayParticleAsync : public UAnimNotify
	{
	public:
		class UParticleSystem* PSTemplate;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSoftObjectPtr<class UParticleSystem>        PSTemplateSoft;                                    // 0x40(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSolarSkinnedParticleSystem           SkinnedPSTemplate;                                 // 0x68(0x70)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
		struct FVector                               LocationOffset;                                    // 0xD8(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FRotator                              RotationOffset;                                    // 0xE4(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FVector                               Scale;                                             // 0xF0(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1609[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		uint8                                        Attached : 1;                                      // Mask: 0x1, PropSize: 0x10x110(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        BitPad_10C : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
		uint8                                        Pad_160A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class FName                                  SocketName;                                        // 0x114(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_160B[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAnimNotify_PlayParticleAsync* GetDefaultObj();

	};

	// 0x10 (0x48 - 0x38)
	// Class Solarland.AnimNotify_PlayPickupSound
	class UAnimNotify_PlayPickupSound : public UAnimNotify
	{
	public:
		class FString                                DefaultSoundEventName;                             // 0x38(0x10)(BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UAnimNotify_PlayPickupSound* GetDefaultObj();

		class FString GetDefaultSoundEventName();
	};

	// 0x8 (0x40 - 0x38)
	// Class Solarland.AnimNotify_ReloadClip
	class UAnimNotify_ReloadClip : public UAnimNotify
	{
	public:
		enum class EAnimReloadNotifyType             StepType;                                          // 0x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		enum class EClipAttachType                   ClipAttachType;                                    // 0x39(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_160C[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAnimNotify_ReloadClip* GetDefaultObj();

	};

	// 0x0 (0x38 - 0x38)
	// Class Solarland.AnimNotify_ServerRefreshBones
	class UAnimNotify_ServerRefreshBones : public UAnimNotify
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotify_ServerRefreshBones* GetDefaultObj();

	};

	// 0x0 (0x38 - 0x38)
	// Class Solarland.AnimNotify_ShieldEndRecharge
	class UAnimNotify_ShieldEndRecharge : public UAnimNotify
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotify_ShieldEndRecharge* GetDefaultObj();

	};

	// 0x0 (0x38 - 0x38)
	// Class Solarland.AnimNotify_ShieldHideRechargeFX
	class UAnimNotify_ShieldHideRechargeFX : public UAnimNotify
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotify_ShieldHideRechargeFX* GetDefaultObj();

	};

	// 0x0 (0x38 - 0x38)
	// Class Solarland.AnimNotify_ShieldOperatorSet
	class UAnimNotify_ShieldOperatorSet : public UAnimNotify
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotify_ShieldOperatorSet* GetDefaultObj();

	};

	// 0x0 (0x38 - 0x38)
	// Class Solarland.AnimNotify_ShieldShowRechargeFX
	class UAnimNotify_ShieldShowRechargeFX : public UAnimNotify
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotify_ShieldShowRechargeFX* GetDefaultObj();

	};

	// 0x0 (0x38 - 0x38)
	// Class Solarland.AnimNotify_ShieldStartRecharge
	class UAnimNotify_ShieldStartRecharge : public UAnimNotify
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotify_ShieldStartRecharge* GetDefaultObj();

	};

	// 0x0 (0x38 - 0x38)
	// Class Solarland.AnimNotify_ThrowThrown
	class UAnimNotify_ThrowThrown : public UAnimNotify
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotify_ThrowThrown* GetDefaultObj();

	};

	// 0x8 (0x40 - 0x38)
	// Class Solarland.AnimNotify_VehicleCameraShake
	class UAnimNotify_VehicleCameraShake : public UAnimNotify
	{
	public:
		TSubclassOf<class UCameraShake>              VehicleCameraShake;                                // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UAnimNotify_VehicleCameraShake* GetDefaultObj();

	};

	// 0x28 (0x60 - 0x38)
	// Class Solarland.AnimNotify_VehiclePlaySound
	class UAnimNotify_VehiclePlaySound : public UAnimNotify
	{
	public:
		bool                                         bCheckEnemy;                                       // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_160F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class FString                                SameTeamSound;                                     // 0x40(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                EnemySound;                                        // 0x50(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UAnimNotify_VehiclePlaySound* GetDefaultObj();

	};

	// 0x10 (0x48 - 0x38)
	// Class Solarland.AnimNotify_VehiclePreviewSound
	class UAnimNotify_VehiclePreviewSound : public UAnimNotify
	{
	public:
		class FString                                Sound;                                             // 0x38(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class UAnimNotify_VehiclePreviewSound* GetDefaultObj();

	};

	// 0x10 (0x48 - 0x38)
	// Class Solarland.AnimNotify_VehicleVFX
	class UAnimNotify_VehicleVFX : public UAnimNotify
	{
	public:
		TArray<struct FVehicleVFX>                   VehicleVFXes;                                      // 0x38(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

		static class UClass* StaticClass();
		static class UAnimNotify_VehicleVFX* GetDefaultObj();

	};

	// 0x0 (0x38 - 0x38)
	// Class Solarland.AnimNotify_WeaponBolt
	class UAnimNotify_WeaponBolt : public UAnimNotify
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotify_WeaponBolt* GetDefaultObj();

	};

	// 0x10 (0x48 - 0x38)
	// Class Solarland.AnimNotify_WeaponPlaySoundGroup
	class UAnimNotify_WeaponPlaySoundGroup : public UAnimNotify
	{
	public:
		bool                                         bLastWeapon;                                       // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1611[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class FName                                  SoundGroupName;                                    // 0x3C(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1612[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAnimNotify_WeaponPlaySoundGroup* GetDefaultObj();

	};

	// 0x20 (0x50 - 0x30)
	// Class Solarland.AnimNotifyState_AddLooseGameplayTag
	class UAnimNotifyState_AddLooseGameplayTag : public UAnimNotifyState
	{
	public:
		struct FGameplayTagContainer                 GameplayTags;                                      // 0x30(0x20)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAnimNotifyState_AddLooseGameplayTag* GetDefaultObj();

	};

	// 0x0 (0x30 - 0x30)
	// Class Solarland.AnimNotifyState_AllowPhysicsRotationDuringAnimRootMotion
	class UAnimNotifyState_AllowPhysicsRotationDuringAnimRootMotion : public UAnimNotifyState
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotifyState_AllowPhysicsRotationDuringAnimRootMotion* GetDefaultObj();

	};

	// 0x0 (0x30 - 0x30)
	// Class Solarland.AnimNotifyState_AutoCancelOnInputReleased
	class UAnimNotifyState_AutoCancelOnInputReleased : public UAnimNotifyState
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotifyState_AutoCancelOnInputReleased* GetDefaultObj();

	};

	// 0x8 (0x38 - 0x30)
	// Class Solarland.SolarAnimNotifyState
	class USolarAnimNotifyState : public UAnimNotifyState
	{
	public:
		bool                                         bDynamic;                                          // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1615[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class USolarAnimNotifyState* GetDefaultObj();

	};

	// 0x20 (0x58 - 0x38)
	// Class Solarland.AnimNotifyState_CharacterLoopedSound
	class UAnimNotifyState_CharacterLoopedSound : public USolarAnimNotifyState
	{
	public:
		TArray<struct FCharacterSound>               EventListToPlay;                                   // 0x38(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<struct FCharacterSound>               EventListToStop;                                   // 0x48(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAnimNotifyState_CharacterLoopedSound* GetDefaultObj();

	};

	// 0x18 (0x48 - 0x30)
	// Class Solarland.AnimNotifyState_HideCharacterMesh
	class UAnimNotifyState_HideCharacterMesh : public UAnimNotifyState
	{
	public:
		struct FGameplayTag                          VisibilityTag;                                     // 0x30(0x8)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bPropagateToChildren;                              // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1616[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TSubclassOf<class USceneComponent>           ChildrenExceptClass;                               // 0x40(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAnimNotifyState_HideCharacterMesh* GetDefaultObj();

	};

	// 0x10 (0x40 - 0x30)
	// Class Solarland.AnimNotifyState_InhibitAimOffset
	class UAnimNotifyState_InhibitAimOffset : public UAnimNotifyState
	{
	public:
		float                                        InhibitSmoothTime;                                 // 0x30(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		float                                        RecoverSmoothTime;                                 // 0x34(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		bool                                         bCalcRecoverSmoothTimeByRemainingTime;             // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_1617[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAnimNotifyState_InhibitAimOffset* GetDefaultObj();

	};

	// 0x10 (0x40 - 0x30)
	// Class Solarland.AnimNotifyState_InhibitLeftHandWeaponAttach
	class UAnimNotifyState_InhibitLeftHandWeaponAttach : public UAnimNotifyState
	{
	public:
		float                                        InhibitSmoothTime;                                 // 0x30(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		float                                        RecoverSmoothTime;                                 // 0x34(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		bool                                         bCalcRecoverSmoothTimeByRemainingTime;             // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_1618[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAnimNotifyState_InhibitLeftHandWeaponAttach* GetDefaultObj();

	};

	// 0x0 (0x30 - 0x30)
	// Class Solarland.AnimNotifyState_OpenTreasureBox
	class UAnimNotifyState_OpenTreasureBox : public UAnimNotifyState
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotifyState_OpenTreasureBox* GetDefaultObj();

	};

	// 0x8 (0x38 - 0x30)
	// Class Solarland.AnimNotifyState_OverrideHitEffectSurfaceType
	class UAnimNotifyState_OverrideHitEffectSurfaceType : public UAnimNotifyState
	{
	public:
		enum class EPhysicalSurface                  SurfaceType;                                       // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1619[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAnimNotifyState_OverrideHitEffectSurfaceType* GetDefaultObj();

	};

	// 0x8 (0x38 - 0x30)
	// Class Solarland.AnimNotifyState_PlayGameplayCueLocal
	class UAnimNotifyState_PlayGameplayCueLocal : public UAnimNotifyState
	{
	public:
		struct FGameplayCueTag                       GameplayCueTag;                                    // 0x30(0x8)(Edit, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAnimNotifyState_PlayGameplayCueLocal* GetDefaultObj();

	};

	// 0x28 (0x58 - 0x30)
	// Class Solarland.AnimNotifyState_RechargeShield
	class UAnimNotifyState_RechargeShield : public UAnimNotifyState
	{
	public:
		struct FGameplayTagContainer                 GameplayTags;                                      // 0x30(0x20)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
		bool                                         bFXorMesh;                                         // 0x50(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_161A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAnimNotifyState_RechargeShield* GetDefaultObj();

	};

	// 0x0 (0x30 - 0x30)
	// Class Solarland.AnimNotifyState_RepairVehicleWeakPoints
	class UAnimNotifyState_RepairVehicleWeakPoints : public UAnimNotifyState
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotifyState_RepairVehicleWeakPoints* GetDefaultObj();

	};

	// 0x0 (0x30 - 0x30)
	// Class Solarland.AnimNotifyState_ShieldUpgradeFX
	class UAnimNotifyState_ShieldUpgradeFX : public UAnimNotifyState
	{
	public:

		static class UClass* StaticClass();
		static class UAnimNotifyState_ShieldUpgradeFX* GetDefaultObj();

	};

	// 0x8 (0x38 - 0x30)
	// Class Solarland.AnimNotifyState_SimulatedWeaponAttach
	class UAnimNotifyState_SimulatedWeaponAttach : public UAnimNotifyState
	{
	public:
		enum class EWeaponSlotType                   Slot;                                              // 0x30(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class EWeaponAttachState                AttachState;                                       // 0x31(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_161B[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAnimNotifyState_SimulatedWeaponAttach* GetDefaultObj();

	};

	// 0x20 (0x50 - 0x30)
	// Class Solarland.AnimNotifyState_SolarSpawnMeshAndAttach
	class UAnimNotifyState_SolarSpawnMeshAndAttach : public UAnimNotifyState
	{
	public:
		TArray<struct FAttachedMeshInfo>             MeshesInfo;                                        // 0x30(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<class UStaticMeshComponent*>          SpawnedMeshComps;                                  // 0x40(0x10)(ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAnimNotifyState_SolarSpawnMeshAndAttach* GetDefaultObj();

	};

	// 0xF0 (0x120 - 0x30)
	// Class Solarland.AnimNotifyState_SolarTimedParticleEffect
	class UAnimNotifyState_SolarTimedParticleEffect : public UAnimNotifyState
	{
	public:
		bool                                         bAsyncLoad;                                        // 0x30(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_161C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UParticleSystem* PSTemplate;                                        // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSoftObjectPtr<class UParticleSystem>        PSTemplateSoft;                                    // 0x40(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSolarSkinnedParticleSystem           SkinnedPSTemplate;                                 // 0x68(0x70)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
		bool                                         Attached;                                          // 0xD8(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_161D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class FName                                  SocketName;                                        // 0xDC(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                               LocationOffset;                                    // 0xE4(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FRotator                              RotationOffset;                                    // 0xF0(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FVector                               Scale;                                             // 0xFC(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bDestroyAtEnd;                                     // 0x108(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bLockRelativeRotation;                             // 0x109(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_161E[0x16];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAnimNotifyState_SolarTimedParticleEffect* GetDefaultObj();

	};

	// 0x20 (0x50 - 0x30)
	// Class Solarland.AnimNotifyState_UpgradeShield
	class UAnimNotifyState_UpgradeShield : public UAnimNotifyState
	{
	public:
		struct FGameplayTagContainer                 GameplayTags;                                      // 0x30(0x20)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAnimNotifyState_UpgradeShield* GetDefaultObj();

	};

	// 0x48 (0xF8 - 0xB0)
	// Class Solarland.SolarMeerkatScheduleComponent
	class USolarMeerkatScheduleComponent : public UActorComponent
	{
	public:
		uint8                                        Pad_161F[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FMeerkatConfig                        MeerkatData;                                       // 0xBC(0x14)(NoDestructor, Protected, NativeAccessSpecifierProtected)
		uint8                                        Pad_1620[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class USolarMeerkatScheduleComponent* GetDefaultObj();

		void ServerReportRPC(const class FString& Key, const class FString& Value);
		void ClientUpdateScheduleConfig(struct FMeerkatConfig& AntiCheatConfig);
	};

	// 0x28 (0x120 - 0xF8)
	// Class Solarland.MeerkatSubScheduleAE
	class UMeerkatSubScheduleAE : public USolarMeerkatScheduleComponent
	{
	public:
		uint8                                        Pad_1621[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UMeerkatSubScheduleAE* GetDefaultObj();

	};

	// 0x20 (0x118 - 0xF8)
	// Class Solarland.MeerkatSubScheduleAR
	class UMeerkatSubScheduleAR : public USolarMeerkatScheduleComponent
	{
	public:
		uint8                                        Pad_1622[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UMeerkatSubScheduleAR* GetDefaultObj();

	};

	// 0x20 (0x118 - 0xF8)
	// Class Solarland.MeerkatSubScheduleHp
	class UMeerkatSubScheduleHp : public USolarMeerkatScheduleComponent
	{
	public:
		uint8                                        Pad_1623[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UMeerkatSubScheduleHp* GetDefaultObj();

		void ClientNotifySeverHpExceptionOccur();
	};

	// 0xD8 (0x1D0 - 0xF8)
	// Class Solarland.MeerkatSubScheduleMB
	class UMeerkatSubScheduleMB : public USolarMeerkatScheduleComponent
	{
	public:
		uint8                                        Pad_1624[0xD8];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UMeerkatSubScheduleMB* GetDefaultObj();

	};

	// 0x28 (0x68 - 0x40)
	// Class Solarland.AttributeSubExecCalc
	class UAttributeSubExecCalc : public UGameplayEffectExecutionCalculation
	{
	public:
		TSubclassOf<class UAttributeSubExecProxy>    CDOProxyClass;                                     // 0x40(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UAttributeSubExecProxy* CDOProxy;                                          // 0x48(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1625[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UAttributeSubExecCalc* GetDefaultObj();

	};

	// 0x8 (0x30 - 0x28)
	// Class Solarland.AttributeSubExecProxy
	class UAttributeSubExecProxy : public UObject
	{
	public:
		TWeakObjectPtr<class UAttributeSubExecCalc>  CDOOwner;                                          // 0x28(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAttributeSubExecProxy* GetDefaultObj();

		void ModifyAttributeSub(class USolarAttributeSubComponent* AttrSubComp, enum class EAttributeSubBehavior Behavior, int32 AttributeSubID, class FName AttrSubTag, float ModifyValue);
		struct FGameplayModifierEvaluatedData MakeExecProxyEvaluated(const struct FGameplayAttribute& InAttribute, float InMagnitud);
		void ExecutePureAttributeSub(class USolarAttributeSubComponent* AttrSubComp, TArray<struct FAttributeSubSetting>& InAttributeSubs);
		void ExecuteAttributeCalculation(class USolarAttributeSubComponent* AttrSubComp, TArray<struct FAttributeSubSetting>& InAttributeSubs, TArray<struct FGameplayAttribute>& InAttribute, TArray<struct FGameplayModifierEvaluatedData>* OutModResults);
		class UAttributeSubExecProxy* CreateProxy(class UAttributeSubExecCalc* InCDOOwner, TSubclassOf<class UAttributeSubExecProxy> ProxyClass);
	};

	// 0x20 (0x868 - 0x848)
	// Class Solarland.AttributeSubGameplayEffect
	class UAttributeSubGameplayEffect : public UGameplayEffect
	{
	public:
		TArray<struct FAttributeSubSetting>          AttributeSubMods;                                  // 0x848(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<struct FAttributeSubSetting>          PureAttributeSubs;                                 // 0x858(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UAttributeSubGameplayEffect* GetDefaultObj();

		void UpdateAttributeBySub(const struct FGameplayAttribute& Attribute);
		class UAttributeSubGameplayEffect* CreateAttributeSubEffectInstance(class UObject* Outer, TSubclassOf<class UAttributeSubExecCalc> AttributeSubCalcClass, TSubclassOf<class UAttributeSubGameplayEffect> Class);
		void CancelPureAttributeSub(int32 AttributeSubID);
		void CancelAttributeSubModify(const struct FGameplayAttribute& Attribute, int32 AttributeSubID);
		void AddPureAttributeSub(int32 AttributeSubID, float Value);
		void AddAttributeSubModify(const struct FGameplayAttribute& Attribute, int32 AttributeSubID, float Value);
	};

	// 0x0 (0x28 - 0x28)
	// Class Solarland.AttributeSubInterface
	class IAttributeSubInterface : public IInterface
	{
	public:

		static class UClass* StaticClass();
		static class IAttributeSubInterface* GetDefaultObj();

		class USolarAttributeSubComponent* GetAttributeSubComponent();
	};

	// 0x30 (0x630 - 0x600)
	// Class Solarland.VertAnimMeshComponent
	class UVertAnimMeshComponent : public UStaticMeshComponent
	{
	public:
		uint8                                        Pad_162E[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UVertAnimMeshComponent* GetDefaultObj();

		void PlayInfo(struct FVertexAnimInfo& InAnimInfo);
		void Play(int32 InStartFrame, int32 InEndFrame, float InLength, bool InLoop);
	};

	// 0xE0 (0x710 - 0x630)
	// Class Solarland.BackpackVertAnimMeshComponent
	class UBackpackVertAnimMeshComponent : public UVertAnimMeshComponent
	{
	public:
		struct FVertexAnimInfo                       DefaultAnimInfo;                                   // 0x630(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		TMap<enum class EBackPackAnimSubType, struct FVertexAnimInfo> BackPackAnimInfoMap;                               // 0x640(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
		class ASolarCharacter* SolarCharacter;                                    // 0x690(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		class ASolarBackpackActor* BackPackActor;                                     // 0x698(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_1630[0x70];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UBackpackVertAnimMeshComponent* GetDefaultObj();

	};

	// 0x0 (0x30 - 0x30)
	// Class Solarland.SolarAttributeSet
	class USolarAttributeSet : public UAttributeSet
	{
	public:

		static class UClass* StaticClass();
		static class USolarAttributeSet* GetDefaultObj();

		void K2_SetAttributeValue(class FName AttributeName, float NewVal);
		void K2_OnReplicationAttribute(struct FGameplayAttributeData& OldValue, struct FGameplayAttributeData& ReplicatedAttribute, class FName AttributeName);
		void K2_InitAttributeValue(struct FGameplayAttributeData& OriginAttribute, float NewVal);
		float K2_GetAttributeValue(struct FGameplayAttributeData& OriginAttribute);
		struct FGameplayAttribute K2_GetAttribute(class FName AttributeName);
	};

	// 0x38 (0x68 - 0x30)
	// Class Solarland.BasalAttributeSet
	class UBasalAttributeSet : public USolarAttributeSet
	{
	public:
		float                                        MaxHealthCustomScale;                              // 0x30(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1638[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FGameplayAttributeData                MaxHealth;                                         // 0x38(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)
		struct FGameplayAttributeData                CurrentHealth;                                     // 0x48(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)
		struct FGameplayAttributeData                LockHealth;                                        // 0x58(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class UBasalAttributeSet* GetDefaultObj();

		void OnRep_MaxHealth(struct FGameplayAttributeData& Previous);
		void OnRep_LockHealth(struct FGameplayAttributeData& Previous);
		void OnRep_CurrentHealth(struct FGameplayAttributeData& Previous);
	};

	// 0x130 (0x390 - 0x260)
	// Class Solarland.BattleChat
	class UBattleChat : public UUserWidget
	{
	public:
		class UGaugeImage* ChatCDMask;                                        // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UImage* ImgBG;                                             // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UCheckBoxGroup* CBGroupOperation;                                  // 0x270(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UScrollBox* PanelChatOptions;                                  // 0x278(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class USolarCheckBox* CBoxChatSwitch;                                    // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UWidgetAnimation* AnimChatCooldown;                                  // 0x288(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TSubclassOf<class UQuickChatUnit>            ChatButtonClass;                                   // 0x290(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_163D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FSlateBrush                           SeparatorBrush;                                    // 0x2A0(0xE0)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
		uint8                                        Pad_163E[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class UBattleChat* GetDefaultObj();

		void SetLogDisplay(bool bDisplay);
		void ReceiveQuickMessage(const class FString& InName, const class FString& InMessage1, bool bLocalPlayer, bool bSound, int32 PosInTeam, const class FString& InMessage2);
		void ReceiveQuickChatSending();
		void OnGroupOperationStateChanged(TArray<class UCheckBox*>& ChildChangedArray, int32 CheckedChildIndex);
	};

	// 0x18 (0x240 - 0x228)
	// Class Solarland.BattlegroundMapElementActor
	class ABattlegroundMapElementActor : public AActor
	{
	public:
		uint8                                        Pad_1640[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FBattlegroundMapElementData           MapElementData;                                    // 0x230(0xC)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
		uint8                                        Pad_1641[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class ABattlegroundMapElementActor* GetDefaultObj();

		struct FBattlegroundMapElementData GetMapElementData();
		enum class EFactionType GetCurrentOwnerFaction();
	};

	// 0x50 (0x290 - 0x240)
	// Class Solarland.BattlegroundControlPoint
	class ABattlegroundControlPoint : public ABattlegroundMapElementActor
	{
	public:
		struct FControlPointData                     ControlPointData;                                  // 0x240(0x14)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
		uint8                                        Pad_164E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UBoxComponent* BoxComp;                                           // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_164F[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		enum class EFactionType                      ProgressOwnerFaction;                              // 0x270(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class EFactionType                      OccupiedFaction;                                   // 0x271(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1650[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class ABattlegroundPlayerState*>      PlayersInside;                                     // 0x278(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        OccupyingProgress;                                 // 0x288(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class EProgressStatus                   ProgressStatus;                                    // 0x289(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1651[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class ABattlegroundControlPoint* GetDefaultObj();

		void OnRep_ProgressStatus();
		void OnRep_ProgressOwnerFaction();
		void OnRep_OccupyingProgress();
		void OnRep_OccupiedFaction();
		void OnRep_CharactersInside();
		void K2_OnProgressStatusChanged();
		void K2_OnProgressOwnerFactionChanged();
		void K2_OnOccupyingProgressChanged();
		void K2_OnOccupiedFactionChanged();
		void K2_OnCharactersInsideChanged();
		bool IsPlayerInSide(class ABattlegroundPlayerState* InPlayerState);
		enum class EBattlegroundPlayerStartRegion GetPlayerStartRegion(class ABattlegroundPlayerState* InPlayerState);
		struct FControlPointData GetControlPointData();
		void AddOccupyingPersonalScore();
	};

	// 0x0 (0x400 - 0x400)
	// Class Solarland.BattlegroundDeployWidget
	class UBattlegroundDeployWidget : public USolarUserWidget
	{
	public:

		static class UClass* StaticClass();
		static class UBattlegroundDeployWidget* GetDefaultObj();

	};

	// 0x298 (0x5A8 - 0x310)
	// Class Solarland.SolarGameMode
	class ASolarGameMode : public AGameMode
	{
	public:
		FMulticastInlineDelegateProperty_            PreStartPlay;                                      // 0x310(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FDelegateProperty_                           CalledStartPlay;                                   // 0x320(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            PostStartPlay;                                     // 0x330(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            PreHandleMatchHasStarted;                          // 0x340(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FDelegateProperty_                           CalledHandleMatchHasStarted;                       // 0x350(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            PostHandleMatchHasStarted;                         // 0x360(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            PreRestartPlayer;                                  // 0x370(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FDelegateProperty_                           CalledRestartPlayer;                               // 0x380(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            PostRestartPlayer;                                 // 0x390(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            PreEndPlay;                                        // 0x3A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FDelegateProperty_                           CalledEndPlay;                                     // 0x3B0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            PostEndPlay;                                       // 0x3C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		TArray<class UGameModeCompBase*>             GameModeComponents;                                // 0x3D0(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_169C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        GamePlayMode;                                      // 0x3E4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<TSubclassOf<class AActor>>            ManagerClasses;                                    // 0x3E8(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class FString                                CharacterClassPath;                                // 0x3F8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        CharacterIdInTrainningCourse;                      // 0x408(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        SkinIdInTrainningCourse;                           // 0x40C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        BagIdInTrainingCourse;                             // 0x410(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bManuallyModifyCharacter;                          // 0x414(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_169D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        SpecifiedCharacterSkinID;                          // 0x418(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bManuallyModifyCharacterBagId;                     // 0x41C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_169E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        SpecifiedCharacterBagID;                           // 0x420(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bManuallyModifyCharacterBagTrailId;                // 0x424(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_169F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        SpecifiedCharacterBagTrailID;                      // 0x428(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_16A0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		FMulticastInlineDelegateProperty_            OnPostSpawnDefaultSolarCharacterAtTransform;       // 0x430(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		class USolarGameModeAIComponent* AIMgrComponent;                                    // 0x440(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class USolarGameModeStatisticsComponent* StatComponent;                                     // 0x448(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class ASolarTeamInfo*>                Teams;                                             // 0x450(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class ASolarTeamInfo*>                AliveTeams;                                        // 0x460(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class ASolarPlayerState*>             AlivePlayers;                                      // 0x470(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSubclassOf<class ASolarTeamInfo>            TeamClass;                                         // 0x480(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UDataTable* TeamDataTable;                                     // 0x488(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_16A3[0xB8];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		class ASolarFlyTrail* FlyTrailActor;                                     // 0x548(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_16A4[0x40];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class FString>                        BannedPlayerIDList;                                // 0x590(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		class USolarCharacterDataCollector* CharacterDataCollector;                            // 0x5A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class ASolarGameMode* GetDefaultObj();

		void UpdatePlayerData(int32 CharacterSkinID, int32 CharacterBagID, int32 CharacterBagTrailID, class ASolarPlayerState* PlayerState);
		void UpdateDeserterTag(class ASolarPlayerState* PlayerState);
		void UpdateBotPlayerData(class ASolarPlayerState* PlayerState);
		void UpdateAliveTeamsAndPlayers();
		class FString TryKickOutOnlinePlayer(const class FString& PlayerId, bool IsAllowReconnect);
		void SolarGM_SetAntiCheatData(const class FString& InVariableName, float InMin, float InMax, float InThreshold, bool bInBanPlayer);
		void SetGamePlayMode(int32 InGamePlayMode);
		void SendHitMsgWithBool(class ASolarCharacterBase* HitedPlayer, TScriptInterface<class ISolarCharacterController>& PC, enum class ESolarHitType MsgType, float Damage, bool bo);
		void SendHitMsg(class ASolarCharacterBase* HitedPlayer, TScriptInterface<class ISolarCharacterController>& PC, enum class ESolarHitType MsgType, float Damage, const class FString& Params);
		void RestartPlayerTakeChargeEvent__DelegateSignature(bool* bOutSuccess, TArray<class UGameModeCompBase*>& ComponentCollection, class AController* NewPlayer);
		void RestartPlayerEvent__DelegateSignature(TArray<class UGameModeCompBase*>& ComponentCollection, class AController* NewPlayer);
		void PresettleAll();
		void PreAssignTeam(uint8 DesiredTeamID, const TArray<class FString>& Players);
		void PostSpawnDefaultSolarCharacterAtTransformDelegate__DelegateSignature(class ASolarPlayerState* NewPlayer, class ASolarCharacter* NewCharacter);
		void OnStartBattleresponded();
		bool OnPlayerReJoinRequest(const class FString& PlayerId, class FString* ErrorMsg);
		void NotifyItemStateChanged(class AActor* Item, int32 State);
		void KickOutPlayerToLobby(const class FString& InPlayerID);
		void KickOutAllPlayerToLobby();
		bool IsCustomRoom(int32 InRuleID);
		bool IsBannedForCheating(const class FString& PlayerId);
		void InitCharacterClassPath(int32 CharacterId);
		void GetTeams(TArray<class ASolarTeamInfo*>* OutTeams, bool FilterNoMemberTeam, bool FilterAlreadySettled);
		int32 GetRandomCharacterID();
		TArray<int32> GetRandomAISkinIDByEliminateIDs(TArray<int32>& EliminateIDs);
		TArray<int32> GetRandomAISkinID(class ASolarPlayerState* InPS, bool bOnlyLowerPos);
		int32 GetMatchTeammateCount();
		int32 GetGamePlayMode();
		class UGameModeGlobalSetting* GetGameModeSetting(class UObject* WorldContextObject);
		void GetEmptyTeams(TArray<class ASolarTeamInfo*>* OutTeams, bool Reverse);
		void GameModeComponentTakeChargeEvent__DelegateSignature(bool* bOutSuccess, TArray<class UGameModeCompBase*>& ComponentCollection);
		void GameModeComponentEvent__DelegateSignature(TArray<class UGameModeCompBase*>& ComponentCollection);
		void EndPlayTakeChargeEvent__DelegateSignature(bool* bOutSuccess, TArray<class UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason);
		void EndPlayEvent__DelegateSignature(TArray<class UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason);
		void EnableActorChannelCloseDelayForCharacters();
		void DisableActorChannelCloseDelayForCharacters(class AActor* Actor, enum class EEndPlayReason EndPlayReason);
		class ASolarPlayerState* CreateBotAISingle(int32 CharacterId, struct FVector& Location, const TArray<enum class ETeamType>& JoinPolicies, TSubclassOf<class ASolarBotAIController> ControllerClass, int32 Difficultly);
		class ASolarPlayerState* CreateBotAIAndJoinTeamByName(int32 CharacterId, struct FVector& Location, const class FString& TeamName, TSubclassOf<class ASolarBotAIController> ControllerClass, int32 Difficultly);
		class ASolarPlayerState* CreateBotAIAndJoinTeamByID(int32 CharacterId, struct FVector& Location, uint8 TeamID, TSubclassOf<class ASolarBotAIController> ControllerClass, int32 Difficultly);
		class ASolarPlayerState* CreateBotAIAndJoinTeam(int32 CharacterId, struct FVector& Location, class ASolarTeamInfo* TeamInfo, TSubclassOf<class ASolarBotAIController> ControllerClass, int32 Difficultly);
		class ASolarPlayerState* CreateBotAI(int32 CharacterId, struct FVector& Location, int32 Difficultly);
		bool CanPlayerBattle(class ASolarPlayerState* PlayerState);
	};

	// 0x30 (0x5D8 - 0x5A8)
	// Class Solarland.SBattleGameMode
	class ASBattleGameMode : public ASolarGameMode
	{
	public:
		FMulticastInlineDelegateProperty_            OnPlayerDisconnectedGame;                          // 0x5A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            OnPlayerReconnectedGame;                           // 0x5B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		uint8                                        Pad_16BA[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        SettlementStageConfigID;                           // 0x5D0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_16BB[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class ASBattleGameMode* GetDefaultObj();

		void SettlePlayerBattleData(class ASolarPlayerState* Player);
		void ReceiveBattleSettlement();
		void ReceiveBattleOver();
		void OnPlayerLeaveDSTimeOut(class ASolarPlayerState* PlayerState);
		bool IsAutoSettlementWhenKilled();
		bool IsAllowReconnectGame(class ASolarPlayerState* Player);
	};

	// 0x1B8 (0x790 - 0x5D8)
	// Class Solarland.SCustomGameMode
	class ASCustomGameMode : public ASBattleGameMode
	{
	public:
		uint8                                        Pad_1708[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        TimeOutSeconds;                                    // 0x5E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1709[0xB4];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		class UCGMLogicComponent* LogicComponent;                                    // 0x698(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UCGMDeathComponent* DeathComponent;                                    // 0x6A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_170A[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class ASCMPlayerController*>          WaitingPlayers;                                    // 0x6B8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_170C[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		FMulticastInlineDelegateProperty_            OnPlayerJoin;                                      // 0x6D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            OnAIJoin;                                          // 0x6E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            OnPlayerOutEvent;                                  // 0x6F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		TArray<TSubclassOf<class AGameManagerBase>>  GameManagerClasses;                                // 0x708(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		TSubclassOf<class UCGMLogicComponent>        LogicComponentClass;                               // 0x718(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		TSubclassOf<class UCGMDeathComponent>        DeathComponentClass;                               // 0x720(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		TSubclassOf<class USCMPlayerRPCComponent>    PlayerRPCComponentClass;                           // 0x728(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_170D[0x60];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class ASCustomGameMode* GetDefaultObj();

		void TimerStartGame();
		void StartBattle();
		void ResendResurrectCoin(class ASolarCharacter* ResurrectCharacter, class ASCMPlayerState* ResurrectPlayer);
		bool RequestAllowReconnectGame(class ASCMPlayerState* InPC);
		void ReceiveSpectatorJoinData(class ASCMPlayerState* Player);
		void ReceiveServerLevelLoaded(const class FString& LevelName);
		bool ReceivePlayerReJoinRequest(const class FString& PlayerId, class FString* ErrorMsg);
		void ReceivePlayerReJoin(class ASCMPlayerState* NewPlayer);
		void ReceivePlayerPreLogin(const class FString& PlayerId, class ASCMPlayerState* OfflinePlayer, class FString* ErrorMsg);
		void ReceivePlayerNonSpectatorJoinData(class ASCMPlayerState* Player);
		void ReceivePlayerLevelLoaded(class ASCMPlayerController* Player, const class FString& LevelName);
		void ReceivePlayerJoinData(const class FString& PlayerId);
		void ReceivePlayerJoinBattle(class ASCMPlayerState* NewPlayer, bool IsAI);
		void ReceivePlayerJoin(class ASCMPlayerState* NewPlayer, bool IsAI);
		void ReceivePlayerCheat(class ASolarPlayerState* InCheater);
		void ReceivePlayerCancelJoin(const class FString& PlayerId);
		void ReceivePlayerBattleEnd(class ASCMPlayerState* Player, enum class ESCMPlayerOutType OutType);
		void ReceivePlayerAbnormal(class ASolarPlayerState* InAbnormalPlayer);
		void ReceiveOBPlayersChanged();
		void ReceiveGameModeInit();
		void ReceiveBattleTick(float InBattleTime, float DeltaTime);
		void ReceiveBattleEnd();
		void ReceiveBattleBegin();
		void OnTeamInTournamentSettled(const class FString& Side, uint8 TeamID);
		void OnReceivePlayerLogin(class APlayerController* PlayerController);
		void OnReceivePlayerBattleStart(class APlayerController* PlayerController);
		void OnReceiveBattleStart();
		void OnPlayerSettled(class ASCMPlayerState* Player);
		void OnPlayerOut__DelegateSignature(class ASCMPlayerState* Player, enum class ESCMPlayerOutType OutType);
		void OnPlayerOfflineTimeOut(class ASCMPlayerState* OfflineTimeoutPlayer);
		void OnPlayerJoin__DelegateSignature(class ASCMPlayerState* Player);
		void OnPlayerGiveUp(class ASCMPlayerState* OfflineTimeoutPlayer);
		void OnMatchEnd(int32 RPCID);
		void OnDSClose();
		void OnBotAIDataReady(int32 AICount);
		void OnAIJoin__DelegateSignature(class ASCMPlayerState* BotAI);
		void NotifyDSBattleOver();
		void NotifyBotAIDataReady(int32 AICount);
		bool IsKillWhenPlayerOut(class ASolarPlayerState* PlayerState);
		bool IsEnableLogicComp();
		int32 GetCurMapID();
		void CreateHomeActor(const class FString& Path);
		bool CheckLogicComponentIsA(TSoftClassPtr<class UCGMLogicComponent> ClassPath);
		bool ChangePlayerCharacter(class ASCMPlayerState* Player, int32 CharacterId, int32 SkinId);
		bool ChangeBotAICharacter(class ASolarPlayerState* Player, int32 CharacterId, int32 SkinId);
	};

	// 0x1C0 (0x950 - 0x790)
	// Class Solarland.BattlegroundGameMode
	class ABattlegroundGameMode : public ASCustomGameMode
	{
	public:
		TSubclassOf<class AFactionInfo>              FactionClass;                                      // 0x790(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AFactionInfo* BlueFaction;                                       // 0x798(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AFactionInfo* RedFaction;                                        // 0x7A0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TMap<enum class EFactionType, class FText>   FactionNameMap;                                    // 0x7A8(0x50)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
		int32                                        MinPlayerLimit;                                    // 0x7F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        MaxPlayerLimit;                                    // 0x7FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FBattlegroundGlobalData               GlobalDataConfig;                                  // 0x800(0x40)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
		int32                                        DefaultSubModeID;                                  // 0x840(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FBattlegroundSubModeData              DefaultSubModeData;                                // 0x844(0x1C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
		TMap<int32, struct FBattlegroundSubModeData> MapDataConfig;                                     // 0x860(0x50)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
		uint8                                        Pad_1720[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<int32>                                BotCharacterIDs;                                   // 0x8B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        BotDifficultly;                                    // 0x8C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        MaxBots;                                           // 0x8CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		float                                        SpawnBotInterval;                                  // 0x8D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bEnableBot;                                        // 0x8D4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1723[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FTimerHandle                          SpawnBotsTimerHandle;                              // 0x8D8(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<class AActor*>                        PreStarts;                                         // 0x8E0(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_1725[0x58];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		struct FTimerHandle                          EndMatchTimerHandle;                               // 0x948(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class ABattlegroundGameMode* GetDefaultObj();

		void SpawnBotTick();
		void SetMinPlayerLimit(int32 NewCount);
		void SetMaxPlayerLimit(int32 NewCount);
		void OnBotSpawned(class ASolarPlayerState* Bot);
		struct FBattlegroundSubModeData GetSubModeData();
		bool GetPreStartTransform(struct FTransform* OutTransform);
		struct FBattlegroundGlobalData GetGlobalData();
		class AActor* ChooseBestPlayerStart(class ABattlegroundPlayerState* InPlayerState, enum class EDeploymentType InType);
	};

	// 0x208 (0x4C0 - 0x2B8)
	// Class Solarland.SolarGameState
	class ASolarGameState : public AGameState
	{
	public:
		uint8                                        Pad_1788[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		class ASolarCharacter* LatestKillerCharacter;                             // 0x2D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ASolarCharacter* LatestDeathCharacter;                              // 0x2E0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1789[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class ASolarPlayerState*>             SolarPlayerStateArray;                             // 0x308(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class ASolarPlayerState*>             RealPlayerStateArray;                              // 0x318(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        bShowBattlePrompt : 1;                             // Mask: 0x1, PropSize: 0x10x328(0x1)(Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        BitPad_117 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
		uint8                                        Pad_178A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<int32>                                MapVehicleSpawnTypes;                              // 0x330(0x10)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_178B[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<struct FPrePooledBundle>              PrePooledBundles;                                  // 0x350(0x10)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        RemainingPlayersCount;                             // 0x360(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        AlivePlayersCount;                                 // 0x364(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        RemainingTeamCount;                                // 0x368(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        PlayersCount;                                      // 0x36C(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        TeamCount;                                         // 0x370(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_178C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        TotalBoardingNum;                                  // 0x374(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        CapsulePlayerNum;                                  // 0x378(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        SettlementStageConfigID;                           // 0x37C(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TSet<class UClass*>                          LimitMaxReplicatedNumClasses;                      // 0x380(0x50)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
		float                                        StartTime;                                         // 0x3D0(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        NumPlayers;                                        // 0x3D4(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<class ASolarPlayerState*>             OBPlayerList;                                      // 0x3D8(0x10)(Net, ZeroConstructor, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        GameWarmID;                                        // 0x3E8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        TeammateNumMode;                                   // 0x3EC(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameStartConditionList               GameStartConditions;                               // 0x3F0(0x58)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
		class USolarGameplayConfigComponent* GameplayConfigComponent;                           // 0x448(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<class ASolarTeamInfo*>                Teams;                                             // 0x450(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        NumReplicatedTeams;                                // 0x460(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_178D[0x4F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		class USolarPlayerActivityHeatComponent* SolarPlayerActivityHeatComponent;                  // 0x4B0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Countdown;                                         // 0x4B8(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_178E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        EndMatchCountdown;                                 // 0x4BC(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

		static class UClass* StaticClass();
		static class ASolarGameState* GetDefaultObj();

		void SetTeamLastVehicleLocation(uint8 InTeamId, struct FVector& InVehiclePosition);
		void SetSettlementStageConfigID(int32 InConfigID);
		void SetCustomConfigValue(enum class ECustomParamType InType, float InValue);
		void ServerUpdateMapVehicleSpawnTypes(TArray<int32>& InSpawnTargetVehicleTypes);
		void PlayTeamVictoryVoice();
		void OnSafeAreaIndexChanged(int32 NewIndex);
		void OnRep_SettlementStageConfigID();
		void OnRep_RemainingTeamCountChange();
		void OnRep_PlayersCountChange();
		void OnRep_OnPlayersCountChange();
		void OnRep_OnAlivePlayersCountChange();
		void OnRep_OBPlayerList();
		void OnRep_NumReplicatedTeams();
		void OnRep_NumPlayers(int32 PreviousNumPlayers);
		void OnRep_EndMatchCountdown();
		void OnRep_Countdown();
		void OnRep_CapsulePlayerNum();
		void OnRecordingConnectionChanged();
		void OnPlayerStateEndPlay(class AActor* Actor, enum class EEndPlayReason EndPlayReason);
		void OnOBPlayerListChange();
		void OnLocalSpectateTargetChanged(class ASolarPlayerState* OldTarget, class ASolarSpectateInfo* SpectateInfo);
		void NotifyCheatedPlayer(class ASolarPlayerState* CheatedPlayerState, class FText& OutReason);
		void NotifyBombingEnd(int32 BombId);
		void NotifyBombingBegin(int32 BombId, struct FVector& Location, float Radius);
		void NotifyAbnormalPlayer(class ASolarPlayerState* AbnormalPlayerState, class FText& OutReason);
		void NetMulticastVictoryAction(const class FString& WinTeamName, class ASolarCharacter* LastKiller, class ASolarCharacter* LastDeath);
		void NetMulticastNotifyDebugMessage(int32 DebugIndex, struct FVector& SpawnerLocation, const class FString& DebugString);
		void NetMulticastNotifyCheatedPlayer(class ASolarPlayerState* CheatedPlayerState, class FText& BanReason);
		void K2_SetCanShowBattlePrompt(bool NewValue);
		bool IsSupportWeaponUpgrade();
		bool IsSupportCharacterTacticalAbility();
		bool IsSupportCharacterSuperAbility();
		bool IsSupportCharacterRole();
		bool IsSupportCharacterInGameLeveling();
		float GetWorldStartTimeSeconds();
		int32 GetWatchingPlayerCount(bool IgnoreOffline);
		void GetTeams(TArray<class ASolarTeamInfo*>* OutTeams, bool FilterNoMemberTeam, bool FilterAlreadySettled);
		class ASolarPlayerState* GetTeamPlayerState(uint8 InTeamId, uint8 InPosInTeam);
		int32 GetTeamNumCount();
		uint8 GetTeammateNum(uint8 InTeamId);
		class ASolarTeamInfo* GetTeamByName(const class FString& InTeamName);
		class ASolarTeamInfo* GetTeam(uint8 InTeamId);
		enum class ERoleSkillOperation GetTacticalSkillStateOperationOnInit();
		enum class ERoleSkillOperation GetSuperSkillStateOperationOnInit();
		class ASolarPlayerState* GetSpecTargetOrLocalPlayerState();
		class ASolarSafeArea* GetSolarSafeArea();
		int32 GetSettlementStageConfigID();
		int32 GetRemainingTeamCount();
		int32 GetRemainingPlayersCount();
		void GetPlayerTeams(TArray<class ASolarTeamInfo*>* OutTeams, bool FilterAlreadySettled);
		class ASolarPlayerState* GetPlayerStateByPlayerId(const class FString& InPlayerID);
		class ASolarPlayerState* GetPlayerStateByNickName(const class FString& InNickName);
		int32 GetPlayersCount();
		class ASolarCharacter* GetPlayerByPlayerId(const class FString& InPlayerID);
		void GetOnlyPlayerTeams(TArray<class ASolarTeamInfo*>* OutTeams, bool FilterAlreadySettled);
		void GetOnlyBotTeams(TArray<class ASolarTeamInfo*>* OutTeams, bool FilterAlreadySettled);
		class ASolarPlayerState* GetOfflinePlayerState(const class FString& OfflinePlayerId);
		bool GetOBPlayerList(TArray<class ASolarPlayerState*>* OutPlayerList);
		class ASolarPlayerState* GetLocalSolarPlayerState();
		int32 GetEndMatchCountdown();
		bool GetCanShowBattlePrompt();
		float GetBattleStartTimeSeconds();
		void GetAllCharactersExceptTeammate(TArray<class ASolarCharacter*>* CharacterArray);
		int32 GetAliveSolarPlayersCount(bool IgnoreOffline);
		int32 GetAlivePlayersCount();
		uint8 GetAlivePlayerNumInTeamExceptDying(uint8 InTeamId, bool bExceptCheater);
		void DoVictoryActionOnServer(const class FString& InWinTeamName);
		void DoSlomoOnLocalFromConfig();
		void DoSlomoOnLocal(float TimeDilation, float TimeDuration, float DelayTime);
		void DelayPlayVictoryMusic();
		void CelebrateBattleEnd(const struct FVector& Location);
		uint8 CalculateTeamNum();
		void CacheSafeArea(class ASolarSafeArea* SafeArea);
	};

	// 0x20 (0x4E0 - 0x4C0)
	// Class Solarland.SBattleGameState
	class ASBattleGameState : public ASolarGameState
	{
	public:
		uint8                                        Pad_1790[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         IsBattleEnd;                                       // 0x4D8(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         IsBattleSettlement;                                // 0x4D9(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		enum class EBattleEndType                    BattleEndType;                                     // 0x4DA(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_1791[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class ASBattleGameState* GetDefaultObj();

		bool IsBattleOver();
		bool GetIsBattleSettlement();
		enum class EBattleEndType GetBattleEndType();
	};

	// 0x1A8 (0x688 - 0x4E0)
	// Class Solarland.SCustomGameState
	class ASCustomGameState : public ASBattleGameState
	{
	public:
		uint8                                        Pad_17BA[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		enum class ESCMInGameState                   InGameState;                                       // 0x4E8(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bInSelectHero;                                     // 0x4E9(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_17BC[0x3E];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		struct FCustomRoomData                       CustomRoomData;                                    // 0x528(0xD8)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
		bool                                         bCustomRoomMode;                                   // 0x600(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_17BE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class AGameManagerBase*>              GameManagers;                                      // 0x608(0x10)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		class AGameDataManager* GameDataManager;                                   // 0x618(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ACustomSettlementManager* SettlementManager;                                 // 0x620(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_17C0[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		class UCGMManagerConfigComponent* ManagerConfigComponent;                            // 0x638(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class ACGFormula* InsFormula;                                        // 0x640(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<class ASolarPlayerState*>             PlayersWithTrackingAbility;                        // 0x648(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		TArray<class ASpatializeInfoTrack*>          TrackInfos;                                        // 0x658(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_17C2[0xB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         bBasicSystemReady;                                 // 0x673(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_17C3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		FMulticastInlineDelegateProperty_            OnBasicSystemReady;                                // 0x678(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class ASCustomGameState* GetDefaultObj();

		void SetRoomPoolPrizeType(int32 TypeID);
		void SetRoomPasssd(const class FString& Passwd);
		void SetRoomName(const class FString& Name);
		void SetRoomLevelLimit(int32 Level);
		void SetRoomEnableSwapPos(bool bIsEnabled);
		void SetRoomEnableInvite(bool bIsEnabled);
		void OnTournamentBattleEnd();
		void OnServerCustomRoomDataReady();
		void OnRep_InGameState();
		void OnRep_GameManagerList();
		void OnRep_GameDataManager();
		void OnRep_CustomRoomData();
		void OnRep_bInSelectHero();
		void OnPlayerBattleStateChange(class ASCMPlayerState* PlayerState);
		void OnDataManagerPrepare();
		void OnCustomRoomDataChange(struct FCustomRoomData& InCustomRoomData);
		void NotifyVipPlayerJoin(int32 FlagID, uint8 VipType, enum class ECommonInputType InputType, const class FString& NickName, bool bCustomRoom, bool bInTournament);
		void NotifyRoomDataChanged();
		void MultiClientAllManagersOnRepDelegate__DelegateSignature();
		bool IsNeedCalculateTournamentPoints();
		bool IsInTournament();
		bool IsInCustomServer();
		bool IsCustomRoomMode();
		bool IsAtNonSettlementStage();
		void InitKnockoutPointParams(struct FKnockoutParams* InParams);
		struct FTournamentData GetTournamentData();
		bool GetOBSCMPlayerList(TArray<class ASCMPlayerState*>* OutPlayerList);
		class UCGMManagerConfigComponent* GetManagerConfigComponent();
		class ACGFormula* GetFormula();
		struct FCustomRoomData GetCustomRoomData();
		class UCGMGameplayConfig* GetCGMGameplayConfig();
		void ClearCustomRoomData();
		void CallOnBasicSystemReady();
		int32 CalculateKnockoutPoints(int32 InTeamRank, int32 InKillNum, float InTotalDamage, float InTotalDamageTaken);
	};

	// 0xC8 (0x750 - 0x688)
	// Class Solarland.BattlegroundGameState
	class ABattlegroundGameState : public ASCustomGameState
	{
	public:
		int32                                        MinPlayerLimit;                                    // 0x688(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        MaxPlayerLimit;                                    // 0x68C(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FBattlegroundGlobalData               GlobalData;                                        // 0x690(0x40)(BlueprintVisible, BlueprintReadOnly, Net, Transient, Protected, NativeAccessSpecifierProtected)
		int32                                        SubModeID;                                         // 0x6D0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FBattlegroundSubModeData              SubModeData;                                       // 0x6D4(0x1C)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
		TArray<struct FBattlegroundScoreData>        ScoreData;                                         // 0x6F0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_17E3[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class ABattlegroundMapElementActor*>  AllMapElementsActors;                              // 0x708(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<class ABattlegroundControlPoint*>     AllControlPoints;                                  // 0x718(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		int32                                        AllMapElementsActorCount;                          // 0x728(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         AllMapElementsActorReady;                          // 0x72C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         SubModeDataSet;                                    // 0x72D(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_17E4[0x22];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class ABattlegroundGameState* GetDefaultObj();

		void RegisterMapElement(class ABattlegroundMapElementActor* InActor);
		void OnSetMatchState__DelegateSignature(class FName& NewState);
		void OnServerLevelLoaded(const class FString& LevelName);
		void OnRep_SubModeData();
		void OnRep_ScoreData();
		void OnReceivedScoreDataChanged(TArray<struct FBattlegroundScoreData>& InData);
		void OnPlayerJoinTeam(class ASolarTeamInfo* TeamInfo, class ASolarPlayerState* PlayerState);
		void OnOccupiedFactionChanged(class ABattlegroundControlPoint* BattlegroundControlPoint);
		void OnCountdownChangeDelegate__DelegateSignature(uint8 InValue);
		void OnAddBonusScore();
		bool K2_HasMatchEnded();
		void HideAllAirWall();
		struct FBattlegroundSubModeData GetSubModeData();
		TArray<struct FBattlegroundScoreData> GetScoreData();
		int32 GetPersonalScoreByType(enum class EPersonalScoreType InType);
		int32 GetMinPlayerLimit();
		int32 GetMaxPlayerLimit();
		class ABattlegroundMapElementActor* GetMapElementByType(enum class EDeploymentType InType);
		struct FBattlegroundGlobalData GetGlobalData();
	};

	// 0x0 (0x318 - 0x318)
	// Class Solarland.SolarHUD
	class ASolarHUD : public AHUD
	{
	public:

		static class UClass* StaticClass();
		static class ASolarHUD* GetDefaultObj();

	};

	// 0x98 (0x3B0 - 0x318)
	// Class Solarland.BattleHUDBase
	class ABattleHUDBase : public ASolarHUD
	{
	public:
		TSubclassOf<class UHUDDispatcherBase>        Dispatcher;                                        // 0x318(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class UHUDDispatcherBase* WidgetEventDispatcher;                             // 0x320(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FSoftObjectPath                       TeammateUI;                                        // 0x328(0x18)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bSingle;                                           // 0x340(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bUseBattleDeathView;                               // 0x341(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_17F0[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class USolarPlayersHPModel* PlayersHPModel;                                    // 0x348(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		class USolarPlayersShieldModel* PlayersShieldModel;                                // 0x350(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		class USolarTeamInfoModel* TeamInfoModelModel;                                // 0x358(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_17F1[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class ABattleHUDBase* GetDefaultObj();

		void ShowDiePage_Deprecated();
		void OnPlayerStateRepInController(enum class EPlayerStateRepType RepType, class APlayerState* PlayerState);
		void OnPlayerStateRepInCharacter(enum class EPlayerStateRepType RepType, class APlayerState* PlayerState);
		void OnNewTeamInfo(class ASolarTeamInfo* TeamInfo);
		void OnCharacterEndPlay(class ASolarCharacter* Character);
		class UUISubsystem* GetUISubSystem();
		void CloseDiePage_Deprecated(TSubclassOf<class UUserWidget> InDiePageClass);
	};

	// 0x8 (0x3B8 - 0x3B0)
	// Class Solarland.BattlegroundHUD
	class ABattlegroundHUD : public ABattleHUDBase
	{
	public:
		uint8                                        Pad_1805[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class ABattlegroundHUD* GetDefaultObj();

		void OnPlayerStatusChanged(enum class EBattlegroundPlayerStatus InStatus);
		void OnPersonalScoreChanged(enum class EPersonalScoreType InType, const class FString& Param);
		void OnMatchStateChanged(class FName& InState);
		void OnCountdownChanged(uint8 InValue);
		void K2_OnPlayerStatusChanged(enum class EBattlegroundPlayerStatus InStatus);
		void K2_OnPersonalScoreChanged(enum class EPersonalScoreType InType, const class FString& Param);
		void K2_OnCountdownChanged(uint8 InValue);
		void K2_HandleCountDownToBegin();
		void InitBattlegroundHUD(enum class EBattlegroundPlayerStatus InStatus);
	};

	// 0x0 (0x28 - 0x28)
	// Class Solarland.BattlegroundMapElementInterface
	class IBattlegroundMapElementInterface : public IInterface
	{
	public:

		static class UClass* StaticClass();
		static class IBattlegroundMapElementInterface* GetDefaultObj();

	};

	// 0x18 (0x270 - 0x258)
	// Class Solarland.BattlegroundPlayerStart
	class ABattlegroundPlayerStart : public APlayerStart
	{
	public:
		uint8                                        Pad_1808[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FBattlegroundMapElementData           MapElementData;                                    // 0x260(0xC)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
		uint8                                        Pad_1809[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class ABattlegroundPlayerStart* GetDefaultObj();

	};

	// 0x890 (0xBC0 - 0x330)
	// Class Solarland.SolarPlayerState
	class ASolarPlayerState : public APlayerState
	{
	public:
		FMulticastInlineDelegateProperty_            OnTeammatePlayerStateRepDelegate;                  // 0x330(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            OnTeammatePlayerStateRemovedInPreparatoryPhaseDelegate; // 0x340(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            OnTeammatePlayerStateRemovedInBattlePhaseDelegate; // 0x350(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            OnPlayerChangedGoldsDelegate;                      // 0x360(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		FMulticastInlineDelegateProperty_            OnOBPlayerRepDelegate;                             // 0x370(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		int32                                        Gold;                                              // 0x380(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1883[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<int32>                                CostedGolds;                                       // 0x388(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<int32>                                ReceivedGolds;                                     // 0x398(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        CharacterId;                                       // 0x3A8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        SkinId;                                            // 0x3AC(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                ClanId;                                            // 0x3B0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                ClanName;                                          // 0x3C0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                ClanShortName;                                     // 0x3D0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        BagId;                                             // 0x3E0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        CapsuleID;                                         // 0x3E4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                SolarPlayerID;                                     // 0x3E8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                NickName;                                          // 0x3F8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                       BattleVoiceId;                                     // 0x408(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1884[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int64                                        RTCType;                                           // 0x410(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint64                                       UserId;                                            // 0x418(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        PosInTeam;                                         // 0x420(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1885[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        CharacterLevel;                                    // 0x424(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        AvatarID;                                          // 0x428(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1886[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class FString                                AvatarUrl;                                         // 0x430(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        AvatarFrameID;                                     // 0x440(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        Gender;                                            // 0x444(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        AccountLevel;                                      // 0x448(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        FriendNum;                                         // 0x44C(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        RoleID;                                            // 0x450(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1887[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<struct FMedalInfo>                    Medals;                                            // 0x458(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FBattleCharacterData>          AllCharacterData;                                  // 0x468(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FCharacterSkin>                AllSkins;                                          // 0x478(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<int32>                                AllVoices;                                         // 0x488(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FBattleCharacterData                  CurUsedCharacterData;                              // 0x498(0x60)(BlueprintVisible, BlueprintReadOnly, Net, NativeAccessSpecifierPublic)
		TArray<int32>                                KillReports;                                       // 0x4F8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FExpRankMedalData>             AllExpRankMedalData;                               // 0x508(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FLastBattleInfo                       LastBattleInfo;                                    // 0x518(0x1C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		uint8                                        Pad_1888[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class FString>                        ReCombatLimitPlayer;                               // 0x538(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        RoleUltimateSkillCDState;                          // 0x548(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1889[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<struct FSettlementParam_ExtraRewardInfo> ExtraRewards;                                      // 0x550(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FSettlementReward>             SettlementRewards;                                 // 0x560(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FSettlementCrateReward>        CrateRewards;                                      // 0x570(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                       PlayerNumber;                                      // 0x580(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_188A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TMap<int32, int32>                           VehicleSkinData;                                   // 0x588(0x50)(NativeAccessSpecifierPublic)
		float                                        CurrentHealth;                                     // 0x5D8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        MaxHealth;                                         // 0x5DC(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FShieldInfo                           CurShieldInfo;                                     // 0x5E0(0x8)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, NativeAccessSpecifierPublic)
		uint8                                        ReviveItemNum;                                     // 0x5E8(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        ReviveCountByItem;                                 // 0x5E9(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_188B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        TalentID;                                          // 0x5EC(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        LikeValue;                                         // 0x5F0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        ReceivedGiftNum;                                   // 0x5F4(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        SpectatorNum;                                      // 0x5F8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class ETalentState                      TalentState;                                       // 0x5FC(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         HasBackendVerified;                                // 0x5FD(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         HasGroupBackendVerified;                           // 0x5FE(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_188C[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FVector2D                             MarkedPointInNavMap;                               // 0x600(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                               SelfLastVehicleLocation;                           // 0x608(0xC)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                               TeamLastVehicleLocation;                           // 0x614(0xC)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        CurrentPlayerStateInGame;                          // 0x620(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        CurrentCharacterStateInGame;                       // 0x621(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_188D[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        AccountFlag;                                       // 0x624(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        ClanFlag;                                          // 0x628(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_188E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<int32>                                EquippedEmotes;                                    // 0x630(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TMap<int32, struct FEquippedEmotesData>      AllCharacterEquippedEmotes;                        // 0x640(0x50)(NativeAccessSpecifierPublic)
		class FString                                OS;                                                // 0x690(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                OsType;                                            // 0x6A0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                DeviceModel;                                       // 0x6B0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class ECommonInputType                  InputType;                                         // 0x6C0(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bIsSameTeamWithLocalPlayer;                        // 0x6C1(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         HasReconnection;                                   // 0x6C2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1890[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         bHasHangUpBehavior;                                // 0x6C8(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1891[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        HangUpTime;                                        // 0x6CC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        OfflineBattleTime;                                 // 0x6D0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        Elo;                                               // 0x6D4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        RankLevel;                                         // 0x6D8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        RankLevel2;                                        // 0x6DC(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        LegendRank;                                        // 0x6E0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        StartWaitTime;                                     // 0x6E4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ReportedWaitTime;                                  // 0x6E8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        VipType;                                           // 0x6EC(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1893[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        WarmupTag;                                         // 0x6F0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        Frustration;                                       // 0x6F4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bMonitor;                                          // 0x6F8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        LobbyTeamMemberNum;                                // 0x6F9(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1894[0x16];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         bTeamIDHasChanged;                                 // 0x710(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1895[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        RepliableMessageID;                                // 0x714(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        RepliableMessageStartTime;                         // 0x718(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1896[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         bIsOBPlayer;                                       // 0x728(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1897[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        WarmId;                                            // 0x72C(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        WarmType;                                          // 0x730(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         AllowOtherJoin;                                    // 0x734(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1898[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class FString                                SocialTeamID;                                      // 0x738(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        WaitTimeBeforeEnterSpectateMode;                   // 0x748(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_1899[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		FMulticastInlineDelegateProperty_            OnSpectateInfoRep;                                 // 0x750(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		class ASolarPlayerState* KillerPlayerState;                                 // 0x760(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class ASolarPlayerState* RevengePlayerState;                                // 0x768(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		TArray<struct FKillEnemySnapshot>            KilledEnemysRecord;                                // 0x770(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		class ASolarSpectateInfo* SpectateInfo;                                      // 0x780(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		enum class EPlayerNetStateInGame             NetStateInGame;                                    // 0x788(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bHasLogin;                                         // 0x789(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_189A[0xE];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         bHasUpdateByServerData;                            // 0x798(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_189B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class USolarReplayHighlightComponent* ReplayHightlightComp;                              // 0x7A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		int32                                        KillNum;                                           // 0x7A8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_189C[0x1C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        AssistNum;                                         // 0x7C8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_189D[0x1C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		struct FVector                               DeathPos;                                          // 0x7E8(0xC)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        ReconnectNum;                                      // 0x7F4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_189E[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        MultiKillDurationTime;                             // 0x808(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_189F[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        TotalReceivedDamage;                               // 0x820(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		float                                        HealSelf;                                          // 0x824(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        ReceivedHeal;                                      // 0x828(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        LifeTime;                                          // 0x82C(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSettlementTempData                   SettleSyncData;                                    // 0x830(0xD8)(NativeAccessSpecifierPublic)
		int32                                        PlayerRank;                                        // 0x908(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         IsAce;                                             // 0x90C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bMVP;                                              // 0x90D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_18A0[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		bool                                         IsVictory;                                         // 0x90F(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        MvpScore;                                          // 0x910(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        KDA;                                               // 0x914(0x4)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        ResurrectionTimes;                                 // 0x918(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        CharacterExp;                                      // 0x91C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<int32>                                CharacterExpReason;                                // 0x920(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        GainCombatScore;                                   // 0x930(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        AccountExp;                                        // 0x934(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TMap<int32, int32>                           WeaponExps;                                        // 0x938(0x50)(NativeAccessSpecifierPublic)
		int32                                        Zomborg;                                           // 0x988(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        ZomborgExtra;                                      // 0x98C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<enum class ESCMPlayerPunishType>      SettlePunishTypes;                                 // 0x990(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TMap<int32, int32>                           CollectionItemRewards;                             // 0x9A0(0x50)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
		TArray<int32>                                StrategyConditionIDs;                              // 0x9F0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        SettlementDisplayStrategyID;                       // 0xA00(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_18A1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		enum class ESCMPlayerOutPath                 PlayerOutPath;                                     // 0xA07(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<int32>                                UsedCharacterIDs;                                  // 0xA08(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bPresettling;                                      // 0xA18(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bHasSettled;                                       // 0xA19(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		bool                                         bIsPlayerBattleEnd;                                // 0xA1A(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_18A2[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        InteractValue;                                     // 0xA1C(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        LastInteractTime;                                  // 0xA20(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        DamageFactor;                                      // 0xA24(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        VehicleProbability;                                // 0xA28(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                         bIsTimeoutPlayer;                                  // 0xA2C(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        bShowBattlePrompt : 1;                             // Mask: 0x1, PropSize: 0x10xA2D(0x1)(Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        BitPad_118 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
		uint8                                        Pad_18A3[0x22];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		struct FExposeLocationMap                    ExposeLocationMap;                                 // 0xA50(0x58)(Protected, NativeAccessSpecifierProtected)
		TArray<class ASolarPlayerState*>             ExposeLocationArray;                               // 0xAA8(0x10)(Net, ZeroConstructor, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		struct FVector                               PlayerLocation;                                    // 0xAB8(0xC)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_18A4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class ASolarPlayerState* ExposeTo;                                          // 0xAC8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_18A5[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        SkydivingLeaderPosInTeam;                          // 0xAD8(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        SkydivingFollowFormationPos;                       // 0xADC(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_18A6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		enum class ESkydivingState                   SkydivingState;                                    // 0xAE4(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_18A7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class USolarAchievementComponent* AchievementComponent;                              // 0xAE8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_18A8[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<int32>                                PreCompletedAchievementIDs;                        // 0xAF8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_18A9[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        PlayerLevel;                                       // 0xB20(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        PlayerExperience;                                  // 0xB24(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                        HistoryShieldUpgradeItemNum;                       // 0xB28(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_18AA[0x1C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		class ASpatializeInfoTrack* TrackInfo;                                         // 0xB48(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                        TrackMaxRevealDistance;                            // 0xB50(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class EAppLifetimeState                 AppLifetimeState;                                  // 0xB54(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_18AB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        TailFlameId;                                       // 0xB58(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_18AC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class ASolarTeamInfo* Team;                                              // 0xB60(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_18AD[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<struct FSolarBattleWeaponData>        BattleWeaponDataArray;                             // 0xB90(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AHeroPickInfo* HeroPickInfo;                                      // 0xBA0(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_18AE[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

		static class UClass* StaticClass();
		static class ASolarPlayerState* GetDefaultObj();

		bool WillFollowMovementOfSkydivingLeader();
		void UpgradePlayerLevel(int32 LevelAdded);
		void UpdateCurUseCharacterData(int32 InCharacterId);
		void UpdateCurUseCharacterAndSkinData(int32 InCharacterId, int32 InSkinID);
		void UpdateAICharacterDataList(struct FBattleCharacterData& InCharacterData);
		bool TryGetVehicleDamageInfo(TArray<int32>* OutVehicleDamageInfo);
		bool TryGetSafeAreaInfo(TArray<int32>* OutSafeZoneInfo);
		bool TryGetPlayerBackpackItems(TArray<int32>* OutWeaponIds);
		void SyncMarkedWorldData(struct FWorldMarkData& InMarkData);
		void SynchronizePlayerStateInGame(enum class EPlayerStateInGame InEPlayerStateInGame, bool InIfOrNot);
		void SynchronizeCharacterStateInGame(enum class ECharacterStateInGame InECharacterStateInGame, bool InIfOrNot);
		void StatWeaponLevelAndTime();
		void StatWeaponBattleDetailInfo();
		void StatVehicleDriveTypeLuaCall(int32 DriveType);
		void StatVehicleDriveType(int32 DriveType);
		void ShowTeammatesHUD(TArray<class ASolarPlayerState*>& TeammateStates, class ASolarPlayerState* InSpectateTargetPlayerState);
		void SetRoleUltimateSkillCDState(int32 NewState);
		void SetRoleID(int32 InRoleID);
		void SetPlayerNetStateInGame(enum class EPlayerNetStateInGame InPlayerNetStateInGame);
		void SetIsTimeoutPlayer(bool InValue);
		void SetIsPlayerBattleEnd(bool bPlayerBattleEnd);
		void SetDeserter(bool InIsDeserter);
		void SetDeathboxSkinId(TArray<int32>& InOwnedDeathboxSkinIds);
		void ServerUpdateInputType(enum class ECommonInputType NowInputType);
		void ServerUnexposeLocationToOtherOnce(class ASolarPlayerState* OtherPS);
		void ServerUnexposeLocationToOther(class ASolarPlayerState* OtherPS);
		void ServerReportWaitTime();
		void ServerPlayerSelectSkin(int32 InCharacterId, int32 InSkinID);
		void ServerHeroRequest(int32 InCharacterId);
		void ServerExposeLocationToOther(class ASolarPlayerState* OtherPS);
		void ServerChangeRoleID(int32 InRoleID);
		void ReviseWeaponExp(int32 Weaponid, int32 WeaponExp, int32 CurLevel, int32 CurExp);
		void RequestServerUpdateInputType(enum class ECommonInputType NowInputType);
		void ReportWaitTime();
		void RemoveMarkedWorldDataFromLua(struct FWorldMarkData& InMarkData);
		void RemoveMarkedWorldData(struct FWorldMarkData& InMarkData);
		void ReceiveTeamIdReplicated(bool bRelatedToSelf);
		void ReceiveTalentStateSet(enum class ETalentState InState);
		void ReceiveTalentIDReplication(enum class EPlayerStateRepType RepType, class APlayerState* ClientOwnerPS);
		void ReceiveSideReplicatedAfter();
		void ReceivePostInitializeComponents();
		bool ReceiveGold(int32 InReceivedGold, bool NeedSyncToServer, bool NeedSyncToDS);
		void ReceiveClientInitialize(class AController* C);
		void PlayerSelectSkin(int32 InCharacterId, int32 InSkinID);
		void PlayerSelectHero(int32 InCharacterId, int32 InSkinID, bool bConfirm);
		bool PlayerIsResurrecting();
		bool PlayerHasLogin();
		bool PlayerCanRebirthByReviveItem(bool bCheckItemNum, bool bIncludingReviving);
		bool PlayerCanRebirthByBuyResurrection();
		bool PlayerCanRebirthByAllMeans();
		bool PlayerCanRebirthBlueprint();
		bool PlayerCanRebirth();
		bool PlayerCanBuyRescue();
		void OnUpdatedPlayerStateLoginData();
		void OnTeammatePlayerStateRepDelegate__DelegateSignature();
		void OnTeammatePlayerStateRemovedDelegate__DelegateSignature(uint8& InPosInTeam, bool InIsLastOne);
		void OnTeamInfoChanged__DelegateSignature(class ASolarTeamInfo* PreviousTeam, class ASolarTeamInfo* NowTeam);
		void OnStopReceiveExposedLocation(class ASolarPlayerState* OtherPS);
		void OnStartResurrectProgress(int32 InTextId, float InDuration, float InRemaining, bool bShowCancel);
		void OnSpectateTargetChanged(class ASolarPlayerState* InOldTarget, class ASolarSpectateInfo* InSpectateInfo);
		void OnSpectateInfoRep__DelegateSignature(class ASolarSpectateInfo* SpectateInfo);
		void OnRequestStartResurrect(class ADeathTreasureBox* InDeatbox);
		void OnRequestCancelResurrect(class ADeathTreasureBox* InDeatbox);
		void OnReplayRecordingStarted();
		void OnRep_UserId();
		void OnRep_TotalReceivedDamage();
		void OnRep_TeammatesState();
		void OnRep_TeamLastVehicleLocation();
		void OnRep_TeamChanged(class ASolarTeamInfo* PreviousTeam);
		void OnRep_TalentID();
		void OnRep_TailFlameId();
		void OnRep_SpectateInfo();
		void OnRep_SkydivingState();
		void OnRep_SkydivingLeaderPosInTeam(int32 OldValue);
		void OnRep_SkinId();
		void OnRep_Side(const class FString& OldSide);
		void OnRep_SelfLastVehicleLocation();
		void OnRep_RTCType();
		void OnRep_RoleID();
		void OnRep_ReviveItemNum();
		void OnRep_ReviveCountByItem();
		void OnRep_RepliableMsg();
		void OnRep_PosInTeam(uint8& InLastPosInTeam);
		void OnRep_PlayerLocation();
		void OnRep_PlayerLevel();
		void OnRep_PlayerExp();
		void OnRep_NickName(const class FString& OldNickName);
		void OnRep_NetStateInGame();
		void OnRep_MaxHealth();
		void OnRep_MarkedPointInNavMap();
		void OnRep_KillNum();
		void OnRep_Job();
		void OnRep_IsOBPlayer();
		void OnRep_InputType();
		void OnRep_HeroPickInfo();
		void OnRep_HasSettled();
		void OnRep_Gold();
		void OnRep_ExposeLocationArray();
		void OnRep_EquippedEmotes();
		void OnRep_CurShieldInfo(struct FShieldInfo& InLastShieldInfo);
		void OnRep_CurrentPlayerStateInGame(uint8& InLastPlayerStateInGame);
		void OnRep_CurrentHealth();
		void OnRep_CurrentCharacterStateInGame(uint8& InLastCharacterStateInGame);
		void OnRep_ClanId();
		void OnRep_ClanFlag();
		void OnRep_CharacterId(int32 OldCharacterId);
		void OnRep_BattleVoiceId();
		void OnRep_BagId();
		void OnRep_AssistNum();
		void OnRep_AccountFlag();
		void OnRefreshReviveInfo();
		void OnReceiveExposedLocation(class ASolarPlayerState* OtherPS, struct FVector& Location);
		class FString OnPlayerUpgrade(int32 NewLevel, bool bFromServer);
		void OnPlayerUpdateStatData(enum class EStatisticsType InType);
		void OnPlayerGainExperience(int32 GainedExp, int32 CurrentExp, int32 TotalExp, enum class EExpBehaviorType BehaviorType);
		void OnPlayerChangedGolds(enum class EPlayerChangedGoldType ChangedGoldType, int32 CostGoldNum, enum class EPlayerChangedGoldResult CostResult);
		void OnOtherPlayerStopSpectateMyTeam(class ASolarSpectateInfo* InSpectateInfo);
		void OnOtherPlayerStopSpectateMe(class ASolarPlayerState* InSpectatorPlayerState, class ASolarSpectateInfo* InSpectateInfo);
		void OnOtherPlayerBeginSpectateMe(class ASolarPlayerState* InSpectatorPlayerState, class ASolarSpectateInfo* InSpectateInfo);
		void OnOBPlayerRepDelegate__DelegateSignature(bool bIsOBPlayer);
		void OnLeaveLocalPlayerTeam(class ASolarTeamInfo* TeamInfo, class ASolarPlayerState* PlayerState);
		void OnJoinLocalPlayerTeam(class ASolarTeamInfo* TeamInfo, class ASolarPlayerState* PlayerState);
		void OnInputTypeChanged(enum class ECommonInputType NowInputType);
		void OnEnterHeroPick();
		void OnDamageChanged__DelegateSignature(float Damage);
		void OnClientSpectateTargetChanged(class ASolarPlayerState* InOldTarget, class ASolarSpectateInfo* InSpectateInfo);
		void OnCancelResurrectProgress(int32 InTextId);
		void NotifyUpdateTeamMateLevelUI();
		void NotifyAddExperience(int32 ExpAdded);
		bool NeedPerformSpectateInfoOnSimulate();
		int32 LuaGetExpFromWeaponImplementation(enum class EExpBehaviorType InBehaviorType, int32 InParamOne, int32 InParamTwo, float InDamage);
		void LeaveTeam();
		void JoinTeamByPolicy(enum class ETeamType TeamType, bool AutoBalance);
		void JoinTeamByPolicies(const TArray<enum class ETeamType>& JoinPolicies, bool AutoBalance);
		void JoinTeamByName(const class FString& InTeamName);
		void JoinTeamByID(uint8 InTeamId);
		void JoinTeam(class ASolarTeamInfo* InTeam);
		bool IsWaitingLogin();
		bool IsUsingClanForFlag();
		bool IsUnfollowShortcutEnabled();
		bool IsTimeOutPlayer();
		bool IsTeammateWithLocalOrSpecTargetPlayer();
		bool IsTeammateWith(class ASolarPlayerState* Other);
		bool IsSpectatingOtherPlayer();
		bool IsSkydivingLeader();
		bool IsSkydivingCompleted();
		bool IsSkydiving();
		bool IsSameTeamWithLocalPlayer();
		bool IsReconnecting();
		bool IsPreStartSkydiving();
		bool IsPlayerWaitingForTeammatesHelp();
		bool IsPlayerTeam();
		bool IsPlayerSameTeam(const class FString& TargetPlayerID);
		bool IsPlayerOnline();
		bool IsPlayerOffline();
		bool IsPlayer();
		bool IsOutBySelf();
		bool IsOfflinePlayer();
		bool IsOBPlayer();
		bool IsMySkydivingLeader(int32 LeaderPosInTeam);
		bool IsMVP();
		bool IsMaxLevelInGame();
		bool IsLocalPlayerCameraFocusingMe();
		bool IsKickOutByServer();
		bool IsDeserter();
		bool IsBuyingResurrection();
		bool IsBeingSpectated();
		bool IsAllyWithLocalPlayer();
		bool IsAllyWithLocalOrSpecTargetPlayer();
		bool IsAllyWith(class ASolarPlayerState* Other);
		bool IsAIPlayer();
		bool IsACheater();
		void InitInputType();
		void IncreaseReviveCount();
		void HideTeammatesHUD(TArray<class ASolarPlayerState*>& TeammateStates);
		bool HasSkydivingLeader();
		bool HasSettled();
		bool HasCheatSelf();
		int32 GetWeaponSettlmentExp(int32 Weaponid);
		int32 GetVehicleSkinID(int32 VehicleID);
		class FString GetUserID();
		TArray<int32> GetUsableTailFlameIds();
		void GetUsableSkinsForCharacter(int32 InCharacterId, TArray<int32>* Result, bool* bCharacterUsable);
		TArray<int32> GetUsableJetpackIds();
		float GetTotalReceivedDamage();
		float GetTotalCausedDamage();
		uint8 GetTeamRank();
		class FString GetTeamName();
		void GetTeammatePlayers(bool bIncludingSelf, TArray<class ASolarPlayerState*>* OutTeammates);
		class ASolarPlayerState* GetTeammatePlayerByPosInTeam(int32 InPosInTeam);
		int32 GetTeammateNum(bool bIncludeSelf);
		uint8 GetTeamID();
		class USolarGameModeStatisticsComponent* GetStatComponent();
		class ASolarSpectateInfo* GetSpectateTargetSpectateInfo();
		class ASolarPlayerState* GetSpectateTargetPlayerState();
		class ASolarCharacter* GetSpectateTargetCharacter();
		class ASolarSpectateInfo* GetSpectateInfo();
		class ASolarReplayPlayerController* GetSolarReplayPlayerController();
		class ASolarPlayerController* GetSolarPlayerController();
		class ASolarCharacter* GetSolarCharacter();
		class ASolarBotAIController* GetSolarBotAIController();
		void GetSkinInfo(int32 InSkinID, struct FCharacterSkin* ResultInfo);
		int32 GetRankScore();
		int32 GetRankLevelID();
		class ASolarCharacter* GetPossessedCharacter();
		class UPlayerStatisticsData* GetPlayerStatData();
		enum class EPlayerNetStateInGame GetPlayerNetState();
		class FString GetPlayerNameWithoutUID();
		TArray<struct FMedalInfo> GetMedalInfo();
		int32 GetMaxShieldMatCountToDeathbox();
		class ASolarPlayerState* GetLocalPlayerState();
		class ASolarPlayerState* GetLocalOrSpecTargetPlayerState();
		class ASolarCharacter* GetLocalOrSpecTargetCharacter();
		class ASolarCharacter* GetLocalCharacter();
		int32 GetLegendRank();
		class ASolarPlayerState* GetKillerPlayerState();
		bool GetIsPlayerBattleEnd();
		float GetExpSettleModePunishRatio();
		int32 GetExpItemCount(int32 InLevelGap);
		int32 GetExpByBehavior(enum class EExpBehaviorType InBehaviorType, int32 InParamOne, int32 InParamTwo, float InDamage);
		int32 GetExpAddValueFromItem(int32 ItemID);
		int32 GetDriveVehicleID();
		struct FVector GetDeathBoxLocation();
		float GetCurrentTalentCDDuration();
		float GetCurrentTalentActiveDuration();
		void GetCurrentSkinForCharacter(int32 InCharacterId, bool* bCharacterUsable, int32* OutSkinId);
		class FString GetClanShortName();
		int32 GetCharacterRandomEquippedVoiceByType(enum class EPassiveTriggeredVoice VoiceType);
		struct FVector GetCharacterLocation();
		TArray<class FString> GetBuyResurrectionSavedTeammateIDArr();
		TArray<int32> GetBuyResurrectionSavedTeammateBonusArr();
		void GetAlliesPlayers(bool bIncludingSelf, TArray<class ASolarPlayerState*>* OutAllies);
		bool CostGold(int32 InCostedGold, bool NeedSyncToServer);
		void ClientNotifyKillNumChanged(int32 KillNumber, int32 SpreesNum);
		void ClientImmediatelyTeammatesSkinID(TArray<class ASolarPlayerState*>& InTeammates, TArray<int32>& InSkinID);
		void ClearTeammatesMark();
		bool CheckIfTeamLastVehicleLocationValid();
		bool CheckIfTeamIdValid();
		bool CheckIfSelfLastVehicleLocationValid();
		bool CheckIfPosInTeamValid();
		bool CheckIfMarkedPointInNavMapValid();
		bool CheckIfInactive();
		bool CheckIfDataValid();
		bool CheckIfBeInSpecifiedPlayerState(enum class EPlayerStateInGame InEPlayerStateInGame);
		bool CheckIfBeInSpecifiedCharacterState(enum class ECharacterStateInGame InECharacterStateInGame);
		bool CheckIfBattleVoiceIdValid();
		bool CheckGoldIsEnough(int32 InCostedGold);
		void ChangeTailFlameId(int32 InTailFlameId);
		void ChangeBagById(int32 InBagId);
		bool CanReviveItemPutInDeathBox();
		bool CanAcceptSkydivingLeaderTransferRequest(class ASolarPlayerState* RequesterPlayerState);
		bool CanAcceptSkydivingFollowRequest(class ASolarPlayerState* RequesterPlayerState);
		bool CanAcceptSkydivingFollowInvitation(class ASolarPlayerState* InviterPlayerState);
		int32 CalculateZomborg();
		float CalculateCharacterExp();
		float CalculateAccountExp();
		void AddExperience(int32 InExp, enum class EExpBehaviorType InType);
	};

	// 0x80 (0xC40 - 0xBC0)
	// Class Solarland.SCMPlayerState
	class ASCMPlayerState : public ASolarPlayerState
	{
	public:
		enum class ESCMPlayerState                   BattleState;                                       // 0xBC0(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class ESCMPlayerOutType                 PlayerOutType;                                     // 0xBC1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class ESCMPlayerType                    PlayerType;                                        // 0xBC2(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		enum class ESCMPlayerGameRole                PlayerGameRole;                                    // 0xBC3(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                        Pad_18CF[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<struct FSCMReplicateHostData>         ReplicateData;                                     // 0xBD8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                        Pad_18D0[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        ReviveStartTime;                                   // 0xBF8(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_18D1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class ASolarPlayerState* RevivingTeammatePS;                                // 0xC00(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                        Pad_18D2[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
		class USolarTaskComponent* TaskSystem;                                        // 0xC18(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<TSoftClassPtr<class UActorComponent>> GMComponentClasses;                                // 0xC20(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class UActorComponent*>               SpawnedGMComps;                                    // 0xC30(0x10)(ExportObject, Net, ZeroConstructor, Transient, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

		static class UClass* StaticClass();
		static class ASCMPlayerState* GetDefaultObj();

		void UpdateTaskInfo(struct FTaskUpdateInfo& InTaskInfo);
		void UpDateDataManager(TArray<struct FSCMReplicateHostData>& InReplicateData, bool bInit);
		void ServerChangePlayerCharacter(int32 NewCharacterID, int32 NewSkinID);
		void ServerBeginSpectate(class ASCMPlayerState* TargetPlayer);
		void ReviveSelfAsWinner(bool bOverrideLocation, struct FVector& ReviveLocation);
		void RequestStartGame();
		void RequestSetWeaponTypeAvailableLuaCall(enum class EWeaponUIType WeaponUIType, bool bIsAvailable);
		void RequestSetWeaponTypeAvailable(enum class EWeaponUIType WeaponUIType, bool bIsAvailable);
		void RequestSetWeaponAvailableLuaCall(int32 Weaponid, bool bIsAvailable);
		void RequestSetWeaponAvailable(int32 Weaponid, bool bIsAvailable);
		void RequestSetVehicleTypeAvailableLuaCall(int32 VehicleTypeID, bool bIsAvailable);
		void RequestSetVehicleTypeAvailable(int32 VehicleTypeID, bool bIsAvailable);
		void RequestSetVehicleClassAvailableLuaCall(enum class EVehicleClass VehicleClass, bool bIsAvailable);
		void RequestSetVehicleClassAvailable(enum class EVehicleClass VehicleClass, bool bIsAvailable);
