#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x10 (0x238 - 0x228)
// Class Solarland.3DMeshWidget
class AThreeDMeshWidget : public AActor
{
public:
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x228(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  StaticMeshComp;                                    // 0x230(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AThreeDMeshWidget* GetDefaultObj();

};

// 0xA0 (0x2D8 - 0x238)
// Class Solarland.3DMeshWidgetTrack
class AThreeDMeshWidgetTrack : public AThreeDMeshWidget
{
public:
	uint8                                        Pad_1198[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               BoxHalfExtent;                                     // 0x240(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PlayerNearbyAlpha;                                 // 0x24C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDebugCollision;                                   // 0x250(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1199[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  MaterialAlphaParamName;                            // 0x254(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  MaterialCountDownName;                             // 0x25C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxTraceDist;                                      // 0x264(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistFromGround;                                    // 0x268(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_119B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  StaticMeshCountDown;                               // 0x270(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextRenderComponent*                  DistTextComp;                                      // 0x278(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*              DynamicMaterialIcon;                               // 0x280(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*              DynamicMaterialCountDown;                          // 0x288(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*              DynamicMaterialDistText;                           // 0x290(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_119E[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AThreeDMeshWidgetTrack* GetDefaultObj();

};

// 0xC8 (0x148 - 0x80)
// Class Solarland.AbilityTask_WaitAbilityEnd
class UAbilityTask_WaitAbilityEnd : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnEnd;                                             // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_11B5[0xB8];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitAbilityEnd* GetDefaultObj();

	class UAbilityTask_WaitAbilityEnd* WaitForAbilityEndWithTagRequirements(class UGameplayAbility* OwningAbility, const struct FGameplayTagRequirements& TagRequirements, bool InIncludeTriggeredAbilities, bool InTriggerOnce);
	class UAbilityTask_WaitAbilityEnd* WaitForAbilityEnd_Query(class UGameplayAbility* OwningAbility, const struct FGameplayTagQuery& Query, bool InIncludeTriggeredAbilities, bool InTriggerOnce);
	class UAbilityTask_WaitAbilityEnd* WaitForAbilityEnd(class UGameplayAbility* OwningAbility, const struct FGameplayTag& InWithTag, const struct FGameplayTag& InWithoutTag, bool InIncludeTriggeredAbilities, bool InTriggerOnce);
	void OnAbilityEnd(struct FAbilityEndedData& EndedData);
};

// 0x0 (0x80 - 0x80)
// Class Solarland.SolarAbilityTask
class USolarAbilityTask : public UAbilityTask
{
public:

	static class UClass* StaticClass();
	static class USolarAbilityTask* GetDefaultObj();

};

// 0x78 (0xF8 - 0x80)
// Class Solarland.AbilityTask_WaitAttributeChangeWithOldValue
class UAbilityTask_WaitAttributeChangeWithOldValue : public USolarAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnChange;                                          // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_11D6[0x60];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAbilitySystemComponent*               ExternalOwner;                                     // 0xF0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAbilityTask_WaitAttributeChangeWithOldValue* GetDefaultObj();

	class UAbilityTask_WaitAttributeChangeWithOldValue* WaitForAttributeChangeWithComparison(class UGameplayAbility* OwningAbility, const struct FGameplayAttribute& InAttribute, const struct FGameplayTag& InWithTag, const struct FGameplayTag& InWithoutTag, enum class EWaitAttributeChangeComparison InComparisonType, float InComparisonValue, bool bTriggerOnce, class AActor* OptionalExternalOwner);
	class UAbilityTask_WaitAttributeChangeWithOldValue* WaitForAttributeChange(class UGameplayAbility* OwningAbility, const struct FGameplayAttribute& InAttribute, const struct FGameplayTag& InWithTag, const struct FGameplayTag& InWithoutTag, bool bTriggerOnce, class AActor* OptionalExternalOwner);
};

// 0x40 (0xC0 - 0x80)
// Class Solarland.AbilityTask_WaitDelayAndResetOnGameplayEvent
class UAbilityTask_WaitDelayAndResetOnGameplayEvent : public USolarAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnFinish;                                          // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnRecalculateWaitDelayOnEventTriggered;            // 0x90(0x10)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_11DB[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitDelayAndResetOnGameplayEvent* GetDefaultObj();

	class UAbilityTask_WaitDelayAndResetOnGameplayEvent* CreateTask(class UGameplayAbility* OwningAbility, float DelayTime, struct FGameplayTag& EventTag);
};

// 0x28 (0xA8 - 0x80)
// Class Solarland.AbilityTask_WaitEvaluation
class UAbilityTask_WaitEvaluation : public USolarAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnGotDesiredValue;                                 // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FDelegateProperty_                           EvaluationFunction;                                // 0x90(0x10)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_11EB[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitEvaluation* GetDefaultObj();

	class UAbilityTask_WaitEvaluation* CreateTask(class UGameplayAbility* OwningAbility, bool bDesiredValue, bool bTriggerOnce);
};

// 0x28 (0xA8 - 0x80)
// Class Solarland.AbilityTask_WaitInputAction
class UAbilityTask_WaitInputAction : public USolarAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnInputAction;                                     // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_11F7[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitInputAction* GetDefaultObj();

	class UAbilityTask_WaitInputAction* CreateTask(class UGameplayAbility* OwningAbility, class FName ActionName, enum class EInputEvent InputEvent, bool bTriggerOnce);
};

// 0x70 (0xF0 - 0x80)
// Class Solarland.AbilityTask_WaitTagRequirementsMetStatusChange
class UAbilityTask_WaitTagRequirementsMetStatusChange : public USolarAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnMetStatusChange;                                 // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGameplayTagRequirements              TagRequirements;                                   // 0x90(0x50)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1208[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitTagRequirementsMetStatusChange* GetDefaultObj();

	class UAbilityTask_WaitTagRequirementsMetStatusChange* CreateTask(class UGameplayAbility* OwningAbility, struct FGameplayTagRequirements& TagRequirements, bool bMetInitially);
};

// 0x48 (0x70 - 0x28)
// Class Solarland.ActionNode
class UActionNode : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnBeganCallback;                                   // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEndedCallback;                                   // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnResetCallback;                                   // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDisposedCallback;                                // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1214[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActionNode* GetDefaultObj();

	void Reset();
	bool Finished();
	void Finish();
	bool Execute(float DeltaTime);
	bool Disposed();
	void Dispose();
};

// 0x10 (0x38 - 0x28)
// Class Solarland.ActionWheelWidgetFunctionBase
class UActionWheelWidgetFunctionBase : public UObject
{
public:
	TWeakObjectPtr<class USolarUserWidget>       BindedWidget;                                      // 0x28(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LastSelectedIndex;                                 // 0x30(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1223[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActionWheelWidgetFunctionBase* GetDefaultObj();

	int32 GetSuggestActionIndex();
	int32 GetQuickActionIndex();
	int32 GetAutoSelectedActionIndex();
	bool ExecUseCustomItemCommand(int32 InItemID);
	bool CheckCommandCanExec(class ASCMPlayerState* InPlayerState, int32 InIndex, const struct FActionWheelCommand& InCommand);
};

// 0xE8 (0x348 - 0x260)
// Class Solarland.SolarUserWidget
class USolarUserWidget : public UUserWidget
{
public:
	enum class EWidgetLayerLevel                 WidgetLayerLevel;                                  // 0x260(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsPersistent;                                     // 0x261(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWidgetScope                      WidgetScope;                                       // 0x262(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInputCapture                     CaptureInput;                                      // 0x263(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideCursorDuringCapture;                          // 0x264(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1479[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MyRoot;                                            // 0x268(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_147A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Widgetkey;                                         // 0x270(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReceiveKeyMap;                                    // 0x280(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReceiveShowMouse;                                 // 0x281(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EScope                            ShowScope;                                         // 0x282(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowTransBlackAnim;                               // 0x283(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_147C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UWidgetInputManager>       InputManagerClass;                                 // 0x288(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetInputManager*                   InputManager;                                      // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UWidgetAnimation*>   AnimationsMap;                                     // 0x298(0x50)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UWidgetAnimation>       PlayingAnimation;                                  // 0x2E8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_147D[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FPlayAnimationParams>          PendingPlayAnimations;                             // 0x308(0x10)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         WidgetTickEnabled;                                 // 0x318(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_147E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USolarInputActionContext*              InputActionContext;                                // 0x320(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_147F[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class USolarUserWidget*>              AllSolarUserWidgetChilds;                          // 0x338(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class USolarUserWidget* GetDefaultObj();

	void StopListeningForInputHandle(int32 Handle);
	void StopListeningForInputActionEx(class FName ActionName, enum class EInputEvent EventType);
	void ShowSelfPanelUI();
	void ShowMouseCursor();
	void SetZOrder(int32 ZOrder);
	void SetWidgetVisible(class UWidget* Widget, bool bVisible, bool bHitTest);
	void SetWidgetTickEnabled(bool bEnabled);
	void SetWidgetKey(const class FString& InWidgetKey);
	void SetInputActionIsEnabled(class FName ActionName, enum class EInputEvent EventType, bool bInIsEnabled);
	void SetBlockInputForOneTick();
	void ReceiveTick(struct FGeometry& MyGeometry, float InDeltaTime);
	void ReceiveShow();
	void ReceiveHide();
	bool PlayAnimationByName(class FName& AnimationName, float StartAtTime, int32 NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
	void PlayAnimationByExclusively(class UWidgetAnimation* InAnimation, float StartAtTime, int32 NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed, bool bRestoreState);
	void OnTouchManagerInitialized();
	void OnSynchronizeProperties();
	void OnSolarUIOpened();
	void OnSolarUIClosed();
	void OnShow();
	void OnHide();
	void OnExclusivelyAnimationFinished();
	void OnDeinitialize();
	void OnBackKey(enum class EWidgetBackKeyType BackKeyType);
	int32 ListenForInputActionEx(class FName ActionName, enum class EInputEvent EventType, bool bInIsEnabled, FDelegateProperty_ Callback);
	bool IsWidgetTickEnabled();
	bool IsSolarUserWidgetAndBindLua(class UWidget* InWidget);
	bool IsPlatformDesktop();
	void HideMouseCursor();
	class FString GetWidgetKeyByPanelName(enum class EUIPanelName PanelName);
	class FString GetWidgetKey();
	TArray<struct FVector2D> GetTouchedLocation();
	enum class EScope GetShowScope();
	TArray<struct FVector2D> GetPointerLocation();
	class ASolarPlayerState* GetOwningSolarPlayerState();
	class ASolarCharacter* GetOwningSolarPlayerCharacter();
	class UWidgetAnimation* GetAnimationByName(class FName& AnimationName);
	TArray<class USolarUserWidget*> GetAllSolarUserWidgetChilds();
	class UWidget* FindWidgetFromName(class FName& Name);
	void ExecuteSolarUIShow();
	void ExecuteSolarUIOpened();
	void ExecuteSolarUIHide();
	void ExecuteSolarUIClosed();
	void ExecuteSolarUIClean();
	void ExecuteBindCustomControl();
	void CloseSelfPanelUI();
	TArray<class USolarUserWidget*> CacheAllSolarUserWidgetChilds();
};

// 0x1E0 (0x528 - 0x348)
// Class Solarland.ActionWheelWidget
class UActionWheelWidget : public USolarUserWidget
{
public:
	uint8                                        Pad_14A1[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UOverlay*                              Overlay_Point;                                     // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14A3[0x58];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SelectedIndex;                                     // 0x3B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        WheelActionItemCount;                              // 0x3BC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        WheelActionItemCountMax;                           // 0x3C0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OperationAreaRadius;                               // 0x3C4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CancelAreaRadius;                                  // 0x3C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PointMoveSensitivity;                              // 0x3CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ManualSwitchThreshold_PC;                          // 0x3D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ManualSwitchThreshold_GamePad;                     // 0x3D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ManualSwitchThreshold_Mobile;                      // 0x3D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Groupid;                                           // 0x3DC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PageCount;                                         // 0x3E0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentPage;                                       // 0x3E4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14A7[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FActionWheelConfig                    WheelConfigs;                                      // 0x3F0(0xD8)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<int32, class UActionWheelWidgetFunctionBase*> ActionWheelWidgetFunctionObjs;                     // 0x4C8(0x50)(NativeAccessSpecifierPublic)
	class UDataTable*                            ActionWheelConfigDataTable;                        // 0x518(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ActionWheelIsOpened;                               // 0x520(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14A8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ValidEmojiUseDistance;                             // 0x524(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UActionWheelWidget* GetDefaultObj();

	void UpdateWheelArrowAngle(float Degree);
	void SetInputActionGroupEnable(bool InEnable);
	void SelecteActionWheelItem(int32 Page, int32 Index);
	void ReceiveActionWheelTouchMoved(struct FVector2D& TouchLocalPos);
	void OnConsumeItemUpdated();
	void OnCommandExec(int32 InGroupID, int32 InSelectedIndex);
	void OnBindedInputActionReleased(int32 InGroupID);
	void OnBindedInputActionPressed(int32 InGroupID);
	void OnBattleHUDVisibilityChanged(bool Visible);
	void OnActionWheelPreviousPage();
	void OnActionWheelOpened();
	void OnActionWheelNextPage();
	void OnActionWheelMouseRightClicked();
	void OnActionWheelMouseLeftClicked();
	void OnActionWheelConfigInit();
	void OnActionWheelClosed();
	void LoadCustomActionCommandInfo(struct FActionWheelConfig* ActionWheelConfig);
	void InitActionWheelConfigByGroupID(int32 InGroupID, int32 InPage);
	int32 GetItemNumById(int32 InItemID);
	class UActionWheelWidgetFunctionBase* GetActionWheelWidgetFunctionObj(int32 InGroupID);
	void CommandExec(int32 InGroupID, int32 InSelectedIndex);
	void ChangeWheelVisibility(bool Visible);
	void ActionWheelYAxis(float Movement);
	void ActionWheelXAxis(float Movement);
};

// 0x28 (0x50 - 0x28)
// Class Solarland.ActorEffect
class UActorEffect : public UObject
{
public:
	TSubclassOf<class UActorEffectController>    ControllerClass;                                   // 0x28(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorEffectController*                Controller;                                        // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_14AD[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActorEffect* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Solarland.ActorEffectController
class UActorEffectController : public UObject
{
public:

	static class UClass* StaticClass();
	static class UActorEffectController* GetDefaultObj();

};

// 0x20 (0x50 - 0x30)
// Class Solarland.ActorEffectSubsystem
class UActorEffectSubsystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_14BD[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UActorEffect*>                  Effects;                                           // 0x40(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UActorEffectSubsystem* GetDefaultObj();

	bool Stop(class UActorEffect* EffectInstance);
	class UActorEffect* Start(TSubclassOf<class UActorEffect> EffectClass, class AActor* AffectedActor);
	bool Finish(class UActorEffect* EffectInstance);
};

// 0x58 (0x3A0 - 0x348)
// Class Solarland.ActorMarkBase
class UActorMarkBase : public USolarUserWidget
{
public:
	uint8                                        Pad_14CC[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                CurrentFollowActor;                                // 0x360(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                     CurrentPlayerController;                           // 0x368(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             MarkIconAlignment;                                 // 0x370(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             MarkPanelSize;                                     // 0x378(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14CE[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxVisibleDis;                                     // 0x398(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14CF[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActorMarkBase* GetDefaultObj();

	void SetUpdateState(bool InShouldUpdateLocation);
	void InitActorMarkBaseByFixedPos(const struct FVector& Pos, class APlayerController* Controller);
	void InitActorMarkBase(class AActor* InActor, class APlayerController* Controller);
	struct FVector GetFollowActorLocation();
	float GetDistance(bool bIncludeZ);
	class AActor* GetCurrentFollowActor();
};

// 0x58 (0x90 - 0x38)
// Class Solarland.ActorMaterialSubsystemSettings
class UActorMaterialSubsystemSettings : public UDeveloperSettings
{
public:
	struct FGameplayTag                          DefaultMaterialChangePriorityTag;                  // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMaterialChangePriorityGroup>  OrderedMaterialChangePriorityGroups;               // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FSoftObjectPath>               GlobalNoChangeMaterials;                           // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FForceChangeMaterialInfos>     GlobalForceChangeMaterials;                        // 0x60(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14D4[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActorMaterialSubsystemSettings* GetDefaultObj();

	int32 GetMaterialChangePriority(struct FGameplayTag& Tag);
};

// 0x60 (0x90 - 0x30)
// Class Solarland.ActorMaterialSubsystem
class UActorMaterialSubsystem : public UWorldSubsystem
{
public:
	TMap<class AActor*, struct FActorMaterialInfo> ActorMaterialsMap;                                 // 0x30(0x50)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_151B[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActorMaterialSubsystem* GetDefaultObj();

	bool SetStaticMesh(class AActor* Actor, class UStaticMeshComponent* MeshComp, class UStaticMesh* NewMesh);
	bool SetSkeletalMesh(class AActor* Actor, class USkeletalMeshComponent* MeshComp, class USkeletalMesh* NewMesh, bool bReinitPose, bool bForceSkipTickAnimation);
	bool SetOriginalMultiplePassMaterial(class AActor* Actor, class UMeshComponent* MeshComp, class UMaterialInterface* Material, bool bNeedMultiplePass);
	bool SetOriginalMaterials(class AActor* Actor, class UMeshComponent* MeshComp, TArray<class UMaterialInterface*>& Materials);
	bool SetOriginalMaterial(class AActor* Actor, class UMeshComponent* MeshComp, int32 MaterialIndex, class UMaterialInterface* Material);
	void RemoveNoChangeMaterials(TArray<struct FSoftObjectPath>& Materials);
	bool RemoveMaterialChange(class AActor* Actor, const struct FMaterialChangeHandle& Handle);
	bool RemoveAllMaterialChanges(class AActor* Actor);
	void RebuildMaterialChangesOnMeshAddedOrRemoved(class AActor* Actor);
	void RebuildMaterialChangesOnAllOriginalMaterialsChanged(class AActor* Actor);
	class UMaterialInstanceDynamic* OverrideDynamicMaterialInstanceParameterByIndex(class UMaterialInstanceDynamic* TargetMaterial, class UPrimitiveComponent* SourcePrimitiveComponent, int32 SourceElementIndex, class FName ParameterName, enum class EMaterialParameterType2 ParameterType, bool bOverridenOnly);
	class UMaterialInstanceDynamic* OverrideDynamicMaterialInstanceParameter(class UMaterialInstanceDynamic* TargetMaterial, class UMaterialInterface* SourceMaterial, class FName ParameterName, enum class EMaterialParameterType2 ParameterType, bool bOverridenOnly);
	void OnActorEndPlay(class AActor* Actor, enum class EEndPlayReason EndPlayReason);
	bool K2_SetVectorMaterialParameter(class AActor* Actor, const struct FMaterialChangeHandle& Handle, class FName ParameterName, const struct FVector& ParameterValue, const struct FMaterialFilter& Filter);
	bool K2_SetScalarMaterialParameter(class AActor* Actor, const struct FMaterialChangeHandle& Handle, class FName ParameterName, float ParameterValue, const struct FMaterialFilter& Filter);
	void K2_RebuildMaterialChangesOnOriginalMaterialChanged(class AActor* Actor, const TArray<class UMeshComponent*>& ChangedMeshes);
	class UMaterialInstanceDynamic* K2_OverrideDynamicMaterialInstanceAllParametersByIndex(class UMaterialInstanceDynamic* TargetMaterial, class UPrimitiveComponent* PrimitiveComponent, int32 SourceElementIndex, int32 ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, bool bOverridenOnly);
	class UMaterialInstanceDynamic* K2_OverrideDynamicMaterialInstanceAllParameters(class UMaterialInstanceDynamic* TargetMaterial, class UMaterialInterface* SourceMaterial, int32 ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, bool bOverridenOnly);
	class UMaterialInstanceDynamic* K2_CreateDynamicMaterialInstanceOverrideAllParameters(class UPrimitiveComponent* TargetPrimitiveComponent, class UMaterialInterface* SourceMaterial, int32 ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, int32 TargetElementIndex, bool bOverridenOnly, class FName OptionalMaterialName);
	struct FMaterialChangeHandle K2_AddMaterialChangeByPath(class AActor* Actor, struct FSoftObjectPath& MaterialPath, const struct FAddMaterialChangeParams& Params);
	struct FMaterialChangeHandle K2_AddMaterialChange(class AActor* Actor, class UMaterialInterface* SourceMaterial, const struct FAddMaterialChangeParams& Params);
	bool EmptyOriginalOverrideMaterials(class AActor* Actor, class UMeshComponent* MeshComp);
	bool ContainsMaterialChangeByPriority(class AActor* Actor, int32 Priority);
	bool ContainsMaterialChange(class AActor* Actor, const struct FMaterialChangeHandle& Handle);
	bool ContainsAnyMaterialChange(class AActor* Actor);
	void AddNoChangeMaterials(TArray<struct FSoftObjectPath>& Materials);
};

// 0x0 (0x28 - 0x28)
// Class Solarland.ActorMaterialSubsystemAgentInterface
class IActorMaterialSubsystemAgentInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IActorMaterialSubsystemAgentInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Solarland.ActorMaterialSubsystemAgentComponentInterface
class IActorMaterialSubsystemAgentComponentInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IActorMaterialSubsystemAgentComponentInterface* GetDefaultObj();

	class UMaterialInterface* AMS_GetAlternativeSourceMaterial(class UMaterialInterface* OriginalSourceMaterial);
};

// 0x88 (0xB0 - 0x28)
// Class Solarland.ActorParticleEffectSpawner
class UActorParticleEffectSpawner : public UObject
{
public:
	uint8                                        Pad_1527[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FActorParticleEffectSpawnInfo         Info;                                              // 0x38(0x70)(NativeAccessSpecifierPublic)
	uint8                                        Pad_1528[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActorParticleEffectSpawner* GetDefaultObj();

};

// 0x20 (0x50 - 0x30)
// Class Solarland.ActorParticleEffectSubsystem
class UActorParticleEffectSubsystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_152F[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UActorParticleEffectSpawner*>   Spawners;                                          // 0x40(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UActorParticleEffectSubsystem* GetDefaultObj();

	struct FActorParticleEffectSpawnHandle K2_RequestParticleEffectSpawn(class AActor* Actor, const struct FActorParticleEffectSpawnInfo& SpawnInfo);
	void CancelParticleEffectSpawn(const struct FActorParticleEffectSpawnHandle& Handle);
};

// 0xB0 (0x310 - 0x260)
// Class Solarland.AdvProgressBase
class UAdvProgressBase : public UUserWidget
{
public:
	class UImage*                                Progress;                                          // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                     ProgressShader;                                    // 0x268(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Speed;                                             // 0x270(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CurrentHP;                                         // 0x274(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxHP;                                             // 0x278(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1540[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, float>                           ActionMap;                                         // 0x280(0x50)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                        AnimCurrentHP;                                     // 0x2D0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ProgressAdd;                                       // 0x2D4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ProgressMinus;                                     // 0x2D8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1541[0x34];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAdvProgressBase* GetDefaultObj();

	void UpdateMaxHPLength(float NewHPMax, float NewCurrentHP);
	void SetProgress(float _PreMinus, float _CurrentHP, float _PreAdd);
	int32 PreAction(float Number);
	void Init(float _DefaultHP, float _MaxHP);
	float GetMaxHP();
	float GetCurrentHPPercent();
	void DoActionSmoothly(float Number);
	void DoActionDirectly(float Number);
	void DoAction(int32 ID);
	struct FLinearColor Debug();
	void CleanPreActions();
	void CancelAction(int32 ID);
};

// 0x0 (0x348 - 0x348)
// Class Solarland.AerialReconnaissanceMarkWidget
class UAerialReconnaissanceMarkWidget : public USolarUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAerialReconnaissanceMarkWidget* GetDefaultObj();

	void K2_MarkStateChanged(bool bInStart);
};

// 0x98 (0x2C0 - 0x228)
// Class Solarland.AirDropAudioActor
class AAirDropAudioActor : public AActor
{
public:
	struct FVector                               DropBeginLocation;                                 // 0x228(0xC)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               DropEndLocation;                                   // 0x234(0xC)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CurrZ;                                             // 0x240(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1546[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                SpawnedWarningEffect;                              // 0x248(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                    WarningEffect;                                     // 0x250(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ThisID;                                            // 0x258(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1547[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bSummonedByCharacter;                              // 0x260(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1548[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                SNameAirDropSpawnWarning;                          // 0x268(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameAirDropStopSpawnWarning;                      // 0x278(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameAirDropApprochWarning;                        // 0x288(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameAirDropStopApprochWarning;                    // 0x298(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkComponent*                          AkAudioComponent;                                  // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USolarAkGameObject*                    SolarAkGameObject;                                 // 0x2B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_154B[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHasLanded;                                        // 0x2B9(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_154C[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAirDropAudioActor* GetDefaultObj();

	void OnAirDropTreasureBoxStateChanged(int32 ItemID, enum class EAirDropMovementState MovementState, enum class EAirDropOpenState OpenState);
	void OnAirDropApproch(int32 InThisID);
	void InitSolarAkGameObject(class UActorComponent* Component, bool bReset);
};

// 0x0 (0x228 - 0x228)
// Class Solarland.SolarDormantActor
class ASolarDormantActor : public AActor
{
public:

	static class UClass* StaticClass();
	static class ASolarDormantActor* GetDefaultObj();

};

// 0x1B8 (0x3E0 - 0x228)
// Class Solarland.SolarItemActor
class ASolarItemActor : public ASolarDormantActor
{
public:
	uint8                                        Pad_1555[0x40];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSolarItemData                        ItemData;                                          // 0x268(0xB8)(Net, RepNotify, NativeAccessSpecifierPublic)
	float                                        SpawnOffset;                                       // 0x320(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1558[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSoftObjectPath>               DiscardMatPath;                                    // 0x328(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       OutlineMatPath;                                    // 0x338(0x18)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       FXPath;                                            // 0x350(0x18)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NoneMeshFxOffset;                                  // 0x368(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_155A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                FXBPPath;                                          // 0x370(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USphereComponent*                      SphereComponent;                                   // 0x380(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_155B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class AActor>                 FXActor;                                           // 0x38C(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EItemState                        ItemCurrentState;                                  // 0x394(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_155D[0xB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<uint8>                                MarkedTeamIdList;                                  // 0x3A0(0x10)(Net, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_155E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  StaticMeshComp;                                    // 0x3B8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>      NormalMats;                                        // 0x3C0(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>      OutlineMats;                                       // 0x3D0(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ASolarItemActor* GetDefaultObj();

	void UnMarkThisItem(uint8 TeamID);
	void SwitchDiscardMaterials();
	void SetOutlineMeshVisible(bool Visible);
	void SetItemData(struct FSolarItemData& _ItemData);
	void OnServerPawned();
	void OnRep_ItemDataChange();
	void OnRep_ItemCurrentStateChanged();
	void NotifyThisItemWasPickedUp();
	void MarkThisItem(uint8 TeamID);
	class UStaticMeshComponent* GetStaticMeshComp();
	int32 GetQuality();
};

// 0x1F0 (0x5D0 - 0x3E0)
// Class Solarland.SolarTreasureBoxActor
class ASolarTreasureBoxActor : public ASolarItemActor
{
public:
	enum class ETreasureBoxState                 CurrentState;                                      // 0x3E0(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1574[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSolarItemDataArray                   ItemDataList;                                      // 0x3E8(0x118)(Edit, Net, Transient, RepNotify, NativeAccessSpecifierPublic)
	TArray<struct FSolarItemData>                SortedGameItemDatas;                               // 0x500(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1575[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DataLeng;                                          // 0x530(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ECostType                         CostType;                                          // 0x534(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1576[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CostNum;                                           // 0x538(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1577[0x54];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        HighestItemQuality;                                // 0x590(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BurstRadius;                                       // 0x594(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstRadiusRandScale;                              // 0x598(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstLocalHeight;                                  // 0x59C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstEulerAngle;                                   // 0x5A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBurstSplitItem;                                   // 0x5A4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBurstMethod                      BurstMethod;                                       // 0x5A5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1579[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RadSafeSlopeToBurstOn;                             // 0x5A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GoldenSpiralMinRadiusSquared;                      // 0x5AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ASolarBurstItemActor*>          BurstItemActors;                                   // 0x5B0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkComponent*                          AkAudioComponent;                                  // 0x5C0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USolarAkGameObject*                    SolarAkGameObject;                                 // 0x5C8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ASolarTreasureBoxActor* GetDefaultObj();

	void UpdateTreasureBoxInternal();
	void UpdateOpenBoxUIByState(enum class ETreasureBoxState NewState);
	void UpdateItemDataListInternal();
	void ServerSetState(enum class ETreasureBoxState NewState, class ASolarCharacter* RequestCharacter);
	void ServerNotifyPlayerOpen(class ASolarCharacter* RequestCharacter, enum class EItemType InItemType);
	void PlayOpenAnimation();
	void OnRep_ItemDataList();
	void OnRep_CurrentState();
	void OnClientItemHighestQualityChanged(int32 NewQuality, int32 PrevQuality);
	bool IsEmpty();
	void InitSolarAkGameObject(class UActorComponent* Component, bool bReset);
	int32 GetNumCost();
	TArray<struct FSolarItemData> GetItemList();
	enum class ECostType GetCostType();
	void ConstructTreasureBoxTest(TArray<int32>* ItemIdList);
	void ConstructTreasureBox(int32 DropId);
	bool BOpened();
};

// 0x6E0 (0xCB0 - 0x5D0)
// Class Solarland.AirDropTreasureBox
class AAirDropTreasureBox : public ASolarTreasureBoxActor
{
public:
	bool                                         bPendingDestroy;                                   // 0x5D0(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsOpening;                                        // 0x5D1(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_158E[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OpenProgress;                                      // 0x5D4(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASolarCharacter*                       OpeningCharacter;                                  // 0x5D8(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OpenTime;                                          // 0x5E0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProtectionTime;                                    // 0x5E4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_158F[0xD];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bBoxLanded;                                        // 0x5F5(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1590[0x5A];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                SummonPlayerID;                                    // 0x650(0x10)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StartDropHeight;                                   // 0x660(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              TargetRotation;                                    // 0x664(0xC)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               TargetLocation;                                    // 0x670(0xC)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1591[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UParticleSystem>        OpenAirdropEffect;                                 // 0x680(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UParticleSystem>        LandHitEffect;                                     // 0x6A8(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UParticleSystem>        LandSmokeEffect;                                   // 0x6D0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UParticleSystem>        PendingDestroyEffect;                              // 0x6F8(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UParticleSystem>        DestroyEffect;                                     // 0x720(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UParticleSystem>        FallingEffect;                                     // 0x748(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UParticleSystem>        FallingImpulseEffect;                              // 0x770(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UParticleSystem>        LightBeamEffect;                                   // 0x798(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                            FallingEffectOffset;                               // 0x7C0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                            FallingImpulseEffectOffset;                        // 0x7F0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                            LightBeamEffectOffset;                             // 0x820(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                            PendingDestroyEffectOffset;                        // 0x850(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       LandAnimation;                                     // 0x880(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       OpenAnimation;                                     // 0x888(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DropGravity;                                       // 0x890(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDropSpeed;                                      // 0x894(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OriginHeight;                                      // 0x898(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DecelerateHeight;                                  // 0x89C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ShowLandSmokeHeight;                               // 0x8A0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DecelerateTime;                                    // 0x8A4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           DecelerateCurve;                                   // 0x8A8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AirDropSpawnDelay;                                 // 0x8B0(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AudioActorHeightOffset;                            // 0x8B4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AudioActorFallSpeed;                               // 0x8B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1593[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSoftClassPath                        AirDropGuideMeshBPClassPath;                       // 0x8C0(0x18)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DropApprochDuration;                               // 0x8D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FallingEffectDelay;                                // 0x8DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSummonBySkill;                                    // 0x8E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1595[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        YawOffset;                                         // 0x8E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAirDropMovementState             MovementState;                                     // 0x8E8(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAirDropOpenState                 OpenState;                                         // 0x8E9(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1596[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMeshComponent*                SkeletalMeshComp;                                  // 0x8F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1597[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UParticleSystemComponent*              FallingPSC;                                        // 0x948(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1598[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSolarDamageInfo                      DamageInfo;                                        // 0x968(0x40)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FString                                SNameAirDropOpen;                                  // 0x9A8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameLandHit;                                      // 0x9B8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameAirDropSpawn;                                 // 0x9C8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameAirDropSpawnWarning;                          // 0x9D8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameAirDropStopSpawnWarning;                      // 0x9E8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameAirDropApprochWarning;                        // 0x9F8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameAirDropStopApprochWarning;                    // 0xA08(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameStartDrop;                                    // 0xA18(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameStopDrop;                                     // 0xA28(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameDecelerateAudio;                              // 0xA38(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNamePlayLandedLoopAudio;                          // 0xA48(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameStopLandedLoopAudio;                          // 0xA58(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNamePlayOnGroundBroadcastLoopAudio;               // 0xA68(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameStopOnGroundBroadcastLoopAudio;               // 0xA78(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNamePlayStartHackAudio;                           // 0xA88(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameStopStartHackAudio;                           // 0xA98(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNamePlayHackingLoopAudio;                         // 0xAA8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameStopHackingLoopAudio;                         // 0xAB8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameStopHackingLoopAudioAux;                      // 0xAC8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PendingDestroyLoopStart;                           // 0xAD8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PendingDestroyLoopEnd;                             // 0xAE8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SNameDestroySound;                                 // 0xAF8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_159C[0x68];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ColorKeyTag1;                                      // 0xB70(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ColorKeyTag2;                                      // 0xB78(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ColorKeyGlow;                                      // 0xB80(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ColorKeyMesh;                                      // 0xB88(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  AlphaKey;                                          // 0xB90(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  LightBeamAlphaKey;                                 // 0xB98(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ColorKeyTagFlow1;                                  // 0xBA0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ColorKeyTagFlow2;                                  // 0xBA8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ColorKeyLightEffect;                               // 0xBB0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FadeTweenDuration;                                 // 0xBB8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        RedTweenDuration;                                  // 0xBBC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          BlueColorTag1;                                     // 0xBC0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          RedColorTag1;                                      // 0xBD0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          BlueColorTag2;                                     // 0xBE0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          RedColorTag2;                                      // 0xBF0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          BlueColorGlow;                                     // 0xC00(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          RedColorGlow;                                      // 0xC10(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          BlueColorMesh;                                     // 0xC20(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          RedColorMesh;                                      // 0xC30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          RedColorTagFlow1;                                  // 0xC40(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          RedColorTagFlow2;                                  // 0xC50(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          BlueColorTagFlow1;                                 // 0xC60(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          BlueColorTagFlow2;                                 // 0xC70(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          RedColorLightEffect;                               // 0xC80(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          BlueColorLightEffect;                              // 0xC90(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_159F[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAirDropTreasureBox* GetDefaultObj();

	void PlayLandingAnimation();
	bool OpenAirDropTreasureBox(class ASolarCharacter* _OpeningCharacter);
	void OnStateChanged();
	void OnRep_TargetLocation();
	void OnRep_SummonPlayerID();
	void OnRep_StartDropHeight();
	void OnRep_PendingDestroy();
	void OnRep_OpenState(enum class EAirDropOpenState OpenState);
	void OnRep_OpenProgressChange();
	void OnRep_OpenCharacterChange();
	void OnRep_MovementState(enum class EAirDropMovementState MovementState);
	void OnRep_IsOpening();
	void OnRep_bBoxLanded();
	void OnOpenStateChanged(enum class EAirDropOpenState InPrevOpenState, enum class EAirDropOpenState InCurrOpenState);
	void OnMovementStateChanged(enum class EAirDropMovementState InPrevMovementState, enum class EAirDropMovementState InCurrMovementState);
	void OnFadeOutFallingEffect();
	bool IsSummonedByCharacter();
	bool IsOpenningCharacterOffline();
	bool IsCharacterInRange(class ASolarCharacter* InCheckCharacter);
	bool CancelOpenAirDropTreasureBox(class ASolarCharacter* _OpeningCharacter);
};

// 0x0 (0x28 - 0x28)
// Class Solarland.AirlineCruiseCompInterface
class IAirlineCruiseCompInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAirlineCruiseCompInterface* GetDefaultObj();

	class UAirlineCruiseComponent* GetAirlineCruiseComponent();
};

// 0x20 (0xD0 - 0xB0)
// Class Solarland.GameModeCompBase
class UGameModeCompBase : public UActorComponent
{
public:
	uint8                                        Pad_15CA[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bPreStartPlay;                                     // 0xB8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTakeChargeStartPlay;                              // 0xB9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPostStartPlay;                                    // 0xBA(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15CB[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bPreHandleMatchHasStarted;                         // 0xBD(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTakeChargeHandleMatchHasStarted;                  // 0xBE(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPostHandleMatchHasStarted;                        // 0xBF(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15CC[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bPreRestartPlayer;                                 // 0xC2(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTakeChargeRestartPlayer;                          // 0xC3(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPostRestartPlayer;                                // 0xC4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15CE[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bPreEndPlay;                                       // 0xC7(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTakeChargeEndPlay;                                // 0xC8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPostEndPlay;                                      // 0xC9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15CF[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGameModeCompBase* GetDefaultObj();

	void PreStartPlayBind(TArray<class UGameModeCompBase*>& ComponentCollection);
	void PreRestartPlayerBind(TArray<class UGameModeCompBase*>& ComponentCollection, class AController* NewPlayer);
	void PreHandleMatchHasStartedBind(TArray<class UGameModeCompBase*>& ComponentCollection);
	void PreGameModeStartPlay(TArray<class UGameModeCompBase*>& ComponentCollection);
	void PreGameModeRestartPlayer(TArray<class UGameModeCompBase*>& ComponentCollection, class AController* NewPlayer);
	void PreGameModeHandleMatchHasStarted(TArray<class UGameModeCompBase*>& ComponentCollection);
	void PreGameModeEndPlay(TArray<class UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason);
	void PreEndPlayBind(TArray<class UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason);
	void PostStartPlayBind(TArray<class UGameModeCompBase*>& ComponentCollection);
	void PostRestartPlayerBind(TArray<class UGameModeCompBase*>& ComponentCollection, class AController* NewPlayer);
	void PostHandleMatchHasStartedBind(TArray<class UGameModeCompBase*>& ComponentCollection);
	void PostGameModeStartPlay(TArray<class UGameModeCompBase*>& ComponentCollection);
	void PostGameModeRestartPlayer(TArray<class UGameModeCompBase*>& ComponentCollection, class AController* NewPlayer);
	void PostGameModeHandleMatchHasStarted(TArray<class UGameModeCompBase*>& ComponentCollection);
	void PostGameModeEndPlay(TArray<class UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason);
	void PostEndPlayBind(TArray<class UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason);
	void OnGameModeStartPlay(bool* bOutSuccess, TArray<class UGameModeCompBase*>& ComponentCollection);
	void OnGameModeRestartPlayer(bool* bOutSuccess, TArray<class UGameModeCompBase*>& ComponentCollection, class AController* NewPlayer);
	void OnGameModeHandleMatchHasStarted(bool* bOutSuccess, TArray<class UGameModeCompBase*>& ComponentCollection);
	void OnGameModeEndPlay(bool* bOutSuccess, TArray<class UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason);
	class ASolarGameMode* GetGameModeOwner();
};

// 0x78 (0x148 - 0xD0)
// Class Solarland.AirlineCruiseComponent
class UAirlineCruiseComponent : public UGameModeCompBase
{
public:
	int32                                        UsedAirlineID;                                     // 0xD0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15D4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class ASolarCapsuleRoot>         CapsuleRootClass;                                  // 0xD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASolarCapsuleRoot*                     CapsuleRoot;                                       // 0xE0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<int32, struct FAirlineData>             AirlineDataList;                                   // 0xE8(0x50)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class ASolarCharacter*                       CruiseTemplate;                                    // 0x138(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15D5[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAirlineCruiseComponent* GetDefaultObj();

	void OnPlayerJoin(class ASCMPlayerState* PlayerState);
	void OnCruiseCompleted(class AActor* DestroyedRoot);
	void OnAIJoin(class ASCMPlayerState* PlayerState);
	int32 GetUsedAirlineData(struct FAirlineData* OutData);
};

// 0x6B0 (0x6E0 - 0x30)
// Class Solarland.AmmoConfig
class UAmmoConfig : public UDataAsset
{
public:
	enum class EHoldActionType                   HoldAction;                                        // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15E9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFireChargeData>               FireChargeDatas;                                   // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FireChargeStopSoundName;                           // 0x48(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChargingToleranceEndTime;                          // 0x58(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChargingWorkingEndTime;                            // 0x5C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChargingHoldingEndTime;                            // 0x60(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChargingTrajectoryTime;                            // 0x64(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bScaleHitEffectByChargingTime;                     // 0x68(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCostToChargeScale;                                // 0x69(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15EB[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FireCostFullShot;                                  // 0x6C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceFullShot;                                    // 0x70(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15EC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxChargingDamageScale;                            // 0x74(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DeltaAngle;                                        // 0x78(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15EE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x80(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Des;                                               // 0x90(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PropID;                                            // 0xA0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LifeTime;                                          // 0xA4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFireMethodType                   FireMethodType;                                    // 0xA8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETrajectoryType                   TrajectoryType;                                    // 0xA9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15EF[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CustomValue;                                       // 0xAC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASolarBullet>              BulletClass;                                       // 0xB0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBounceType                       BulletBounce;                                      // 0xB8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15F1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        BounceTimes;                                       // 0xBC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETriggerType                      TriggerType;                                       // 0xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15F2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxRange;                                          // 0xC4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EffRange;                                          // 0xC8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0xCC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InitSpeed;                                         // 0xD0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECostFireType                     FireCostType;                                      // 0xD4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15F3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FireCostPerAttack;                                 // 0xD8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FireSpeedChangeTime;                               // 0xDC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FireSpeedChangeCOP;                                // 0xE0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FastestFireInterval;                               // 0xE4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SlowestFireInterval;                               // 0xE8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BaseFireInterval;                                  // 0xEC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FireIntervalRevertPreTime;                         // 0xF0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FireIntervalReavertSpeed;                          // 0xF4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BoltActionTime;                                    // 0xF8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StartBoltDuration;                                 // 0xFC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AutoFireBreakTime;                                 // 0x100(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FirePrepareTime;                                   // 0x104(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FireStateBreakTime;                                // 0x108(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FireStreakBreakTime;                               // 0x10C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FireIdx;                                           // 0x110(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTimedExplode;                                     // 0x114(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15F8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BaseReloadTime;                                    // 0x118(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReloadBoltTime;                                    // 0x11C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PostFireOverload;                                  // 0x120(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPlayHitSound;                                     // 0x124(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPlayExplodeSound;                                 // 0x125(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15F9[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FlySoundReceiveRadius;                             // 0x128(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FlySoundIgnoreDistance;                            // 0x12C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SingleSoundCount;                                  // 0x130(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15FA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Play_Land_Common_Hit_1P;                           // 0x138(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Play_Land_Common_Hit_3P;                           // 0x148(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Play_Land_Common_Hit_3P_Enemy;                     // 0x158(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Play_Land_Fly_Once_3P;                             // 0x168(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Play_Land_Fly_Once_3P_Enemy;                       // 0x178(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Play_Land_Fly_Loop_1P;                             // 0x188(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Play_Land_Fly_Loop_3P;                             // 0x198(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Play_Land_Fly_Loop_3P_Enemy;                       // 0x1A8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Stop_Land_Fly_Loop_1P;                             // 0x1B8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Stop_Land_Fly_Loop_3P;                             // 0x1C8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Stop_Land_Fly_Loop_3P_Enemy;                       // 0x1D8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Play_Fire_Empty_1p;                                // 0x1E8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Play_Fire_Empty_3p;                                // 0x1F8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Play_Fire_Empty_3p_Enemy;                          // 0x208(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           PostFireSpreadCurveStruct;                         // 0x218(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VhADSSpreadCOP;                                    // 0x220(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ADSSpreadCOP;                                      // 0x224(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SpreadFirePreTime;                                 // 0x228(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SpreadPostFireSpeed;                               // 0x22C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SpreadRestorePreTime;                              // 0x230(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SpreadRestoreSpeed;                                // 0x234(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWeaponFireTPPAnimConfig              TPPRecoilConfig;                                   // 0x238(0x28)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FWeaponFireFPPAnimConfig              FPPRecoilConfigNoScope;                            // 0x260(0x70)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FWeaponFireFPPAnimConfig              FPPRecoilConfigWithScope;                          // 0x2D0(0x70)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FAmmonVerticalRecoilStruct            PitchRecoilStruct;                                 // 0x340(0x30)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FAmmonHorizontalRecoilStruct          YawRecoilStruct;                                   // 0x370(0x30)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FAmmonRecoilRollStruct                RollRecoilStruct;                                  // 0x3A0(0x40)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FAmmonRecoilScope                     ScopeRecoil;                                       // 0x3E0(0xB8)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	float                                        ADSRecoilCOP;                                      // 0x498(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15FE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FString, float>                   RecoilCOPMap;                                      // 0x4A0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<enum class EPhysicalSurface>          IgnoreEPhysicalSurface;                            // 0x4F0(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAutoBurstFire;                                    // 0x500(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15FF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BurstFireInterval;                                 // 0x504(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstFireInternalInterval;                         // 0x508(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FireAnimationPlayRate;                             // 0x50C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AmmoSoundType;                                     // 0x510(0x4)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProjectileMaxGravity;                              // 0x514(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ParticleStartDistance;                             // 0x518(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TrajectoryStartDistance;                           // 0x51C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPenetrable;                                       // 0x520(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTakeDamageAfterDeathVerge;                        // 0x521(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1601[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           PenetrationDamageMultiplierCurve;                  // 0x528(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           CylinderDamageMultiplierCurve;                     // 0x530(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                           TriggerIcon;                                       // 0x538(0x98)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	enum class EVirtualBulletType                VirtualBulletType;                                 // 0x5D0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStepOnServer;                                     // 0x5D1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1603[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAmmoConfig*                           TraceOverrideAmmo;                                 // 0x5D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        TraceTargetFlag;                                   // 0x5E0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1604[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTracerBulletData                     TracerData;                                        // 0x5E8(0x40)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UCurveFloat*                           BulletOffsetCurve;                                 // 0x628(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                     BulletOffsetAngles;                                // 0x630(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           BulletDamageCurve;                                 // 0x640(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           BulletScaleCurve;                                  // 0x648(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           BulletMovementCurve;                               // 0x650(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bThirdPesonViewXScaledByDistance;                  // 0x658(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceApplyAbility;                                // 0x659(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1605[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class ASolarAbility>>     AmmoAbilityClasses;                                // 0x660(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class ASolarAbility>>     AmmoAbilityClassesOnDestroyed;                     // 0x670(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASolarAbility>             AmmoAbilityClassesOnSelf;                          // 0x680(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SkillType;                                         // 0x688(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NameLocalTextIDNumber;                             // 0x68C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DescriptionLocalTextIDNumber;                      // 0x690(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RangeLocalTextID;                                  // 0x694(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DifficultyLocalTextID;                             // 0x698(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1607[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSolarDamageInfo                      DamageInfo;                                        // 0x6A0(0x40)(Edit, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAmmoConfig* GetDefaultObj();

	void InitVerticalRecoilStruct(float CostTime, int32 AIndex, float AMin, float AMax, int32 BIndex, float BMin, float BMax);
	void InitSpreadData(float Adscop, float Vhadscop, float Firepre, float Changespeed, float Restorepre, float Restorespeed);
	void InitScopeRollRecoilStruct(float CostTime, int32 AIndex, float AMin, float AMax, int32 BIndex, float BMin, float BMax, float Adscop);
	void InitScopeAndCrossHairVibration(float ScopeVMaxDistanceOffSet, float ScopeVVibrationDuration, float ScopeHMaxDistanceOffSet, float ScopeHVibrationDuration, float ScopeVContinuousFallingDuration, float ScopeVContinuousFallingPointIndex, float VMaxDistanceOffSetScale, float VVibrationDurationScale, float VSingleOffSetScale, float VContinuousOffSetScale, float HMaxDistanceOffSetScale, float HVibrationDurationScale, float HSingleOffSetScale, float HContinuousOffSetScale, float HOffSetProbabilityScale);
	void InitRollRecoilStruct(float CostTime, int32 AIndex, float AMin, float AMax, int32 BIndex, float BMin, float BMax, float Adscop);
	void InitRecoilCOPMap(TArray<class FString>& Keys, TArray<float>& Values);
	void InitPostFireSpreadCurveStruct(const class FString& Path);
	void InitHorizontalRecoilStruct(float CostTime, int32 AIndex, float AMin, float AMax, int32 BIndex, float BMin, float BMax);
	void InitBaseData(int32 Trigger);
};

// 0x10 (0x38 - 0x28)
// Class Solarland.AndroidInputManager
class UAndroidInputManager : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnAndroidBackPressed;                              // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAndroidInputManager* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class Solarland.AnimNotify_CharacterFootEffect
class UAnimNotify_CharacterFootEffect : public UAnimNotify
{
public:
	TArray<struct FFootEffect>                   FootEffectList;                                    // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_CharacterFootEffect* GetDefaultObj();

	void AddNewFootEffect(struct FFootEffect& NewEffect);
};

// 0x8 (0x40 - 0x38)
// Class Solarland.AnimNotify_CharacterPlaySoundGroup
class UAnimNotify_CharacterPlaySoundGroup : public UAnimNotify
{
public:
	class FName                                  SoundGroupName;                                    // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_CharacterPlaySoundGroup* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class Solarland.SolarAnimNotify
class USolarAnimNotify : public UAnimNotify
{
public:
	bool                                         bDynamic;                                          // 0x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_160B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USolarAnimNotify* GetDefaultObj();

};

// 0x40 (0x80 - 0x40)
// Class Solarland.AnimNotify_CharacterStartSound
class UAnimNotify_CharacterStartSound : public USolarAnimNotify
{
public:
	TArray<struct FCharacterSound>               SoundList;                                         // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseSwitch;                                        // 0x50(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1611[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        SwitchGroupNames;                                  // 0x58(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseRTPC;                                          // 0x68(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1612[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        RPTCNames;                                         // 0x70(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_CharacterStartSound* GetDefaultObj();

	int32 RemoveAllSwitches();
	int32 RemoveAllRPTCs();
	int32 RemoveAllCharacterSounds();
	void AddNewSwitch(const class FString& NewSwitch);
	void AddNewRPTC(const class FString& NewRTPC);
	void AddNewCharacterSound(struct FCharacterSound& NewSound);
};

// 0x10 (0x48 - 0x38)
// Class Solarland.AnimNotify_CharacterStopSound
class UAnimNotify_CharacterStopSound : public UAnimNotify
{
public:
	TArray<struct FCharacterSound>               StopList;                                          // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_CharacterStopSound* GetDefaultObj();

	int32 RemoveAllCharacterSoundStops();
	void AddNewCharacterSoundStop(struct FCharacterSound& NewStop);
};

// 0x8 (0x40 - 0x38)
// Class Solarland.AnimNotify_ExecuteGameplayCueLocal
class UAnimNotify_ExecuteGameplayCueLocal : public UAnimNotify
{
public:
	struct FGameplayCueTag                       GameplayCueTag;                                    // 0x38(0x8)(Edit, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_ExecuteGameplayCueLocal* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class Solarland.AnimNotify_FlyWaterEffect
class UAnimNotify_FlyWaterEffect : public UAnimNotify
{
public:
	class UParticleSystem*                       PSTemplate;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UParticleSystem>        PSTemplateSoft;                                    // 0x40(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SocketName;                                        // 0x68(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocationOffset;                                    // 0x70(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RotationOffset;                                    // 0x7C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_FlyWaterEffect* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class Solarland.AnimNotify_LegVehicleRiseDust
class UAnimNotify_LegVehicleRiseDust : public UAnimNotify
{
public:
	TArray<int32>                                NotifyFootIndex;                                   // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_LegVehicleRiseDust* GetDefaultObj();

};

// 0x78 (0xB0 - 0x38)
// Class Solarland.AnimNotify_PlayParticleAsync
class UAnimNotify_PlayParticleAsync : public UAnimNotify
{
public:
	class UParticleSystem*                       PSTemplate;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UParticleSystem>        PSTemplateSoft;                                    // 0x40(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocationOffset;                                    // 0x68(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RotationOffset;                                    // 0x74(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               Scale;                                             // 0x80(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1616[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        Attached : 1;                                      // Mask: 0x1, PropSize: 0x10xA0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_114 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1617[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  SocketName;                                        // 0xA4(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1618[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_PlayParticleAsync* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class Solarland.AnimNotify_PlayPickupSound
class UAnimNotify_PlayPickupSound : public UAnimNotify
{
public:
	class FString                                DefaultSoundEventName;                             // 0x38(0x10)(BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_PlayPickupSound* GetDefaultObj();

	class FString GetDefaultSoundEventName();
};

// 0x10 (0x48 - 0x38)
// Class Solarland.AnimNotify_ReloadClip
class UAnimNotify_ReloadClip : public UAnimNotify
{
public:
	class FName                                  HandBoneName;                                      // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAnimReloadNotifyType             StepType;                                          // 0x40(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1619[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_ReloadClip* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Solarland.AnimNotify_ServerRefreshBones
class UAnimNotify_ServerRefreshBones : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_ServerRefreshBones* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Solarland.AnimNotify_ShieldEndRecharge
class UAnimNotify_ShieldEndRecharge : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_ShieldEndRecharge* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Solarland.AnimNotify_ShieldHideRechargeFX
class UAnimNotify_ShieldHideRechargeFX : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_ShieldHideRechargeFX* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Solarland.AnimNotify_ShieldOperatorSet
class UAnimNotify_ShieldOperatorSet : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_ShieldOperatorSet* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Solarland.AnimNotify_ShieldShowRechargeFX
class UAnimNotify_ShieldShowRechargeFX : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_ShieldShowRechargeFX* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Solarland.AnimNotify_ShieldStartRecharge
class UAnimNotify_ShieldStartRecharge : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_ShieldStartRecharge* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Solarland.AnimNotify_ShieldUpgradeFinishFX
class UAnimNotify_ShieldUpgradeFinishFX : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_ShieldUpgradeFinishFX* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Solarland.AnimNotify_ThrowThrown
class UAnimNotify_ThrowThrown : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_ThrowThrown* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class Solarland.AnimNotify_VehicleCameraShake
class UAnimNotify_VehicleCameraShake : public UAnimNotify
{
public:
	TSubclassOf<class UCameraShake>              VehicleCameraShake;                                // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_VehicleCameraShake* GetDefaultObj();

};

// 0x28 (0x60 - 0x38)
// Class Solarland.AnimNotify_VehiclePlaySound
class UAnimNotify_VehiclePlaySound : public UAnimNotify
{
public:
	bool                                         bCheckEnemy;                                       // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1622[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                SameTeamSound;                                     // 0x40(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                EnemySound;                                        // 0x50(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_VehiclePlaySound* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class Solarland.AnimNotify_VehiclePreviewSound
class UAnimNotify_VehiclePreviewSound : public UAnimNotify
{
public:
	class FString                                Sound;                                             // 0x38(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_VehiclePreviewSound* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class Solarland.AnimNotify_VehicleVFX
class UAnimNotify_VehicleVFX : public UAnimNotify
{
public:
	TArray<struct FVehicleVFX>                   VehicleVFXes;                                      // 0x38(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAnimNotify_VehicleVFX* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Solarland.AnimNotify_WeaponBolt
class UAnimNotify_WeaponBolt : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_WeaponBolt* GetDefaultObj();

};

// 0x20 (0x50 - 0x30)
// Class Solarland.AnimNotifyState_AddLooseGameplayTag
class UAnimNotifyState_AddLooseGameplayTag : public UAnimNotifyState
{
public:
	struct FGameplayTagContainer                 GameplayTags;                                      // 0x30(0x20)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotifyState_AddLooseGameplayTag* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Solarland.AnimNotifyState_AllowPhysicsRotationDuringAnimRootMotion
class UAnimNotifyState_AllowPhysicsRotationDuringAnimRootMotion : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UAnimNotifyState_AllowPhysicsRotationDuringAnimRootMotion* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Solarland.AnimNotifyState_AutoCancelOnInputReleased
class UAnimNotifyState_AutoCancelOnInputReleased : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UAnimNotifyState_AutoCancelOnInputReleased* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class Solarland.SolarAnimNotifyState
class USolarAnimNotifyState : public UAnimNotifyState
{
public:
	bool                                         bDynamic;                                          // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_162D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USolarAnimNotifyState* GetDefaultObj();

};

// 0x20 (0x58 - 0x38)
// Class Solarland.AnimNotifyState_CharacterLoopedSound
class UAnimNotifyState_CharacterLoopedSound : public USolarAnimNotifyState
{
public:
	TArray<struct FCharacterSound>               EventListToPlay;                                   // 0x38(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCharacterSound>               EventListToStop;                                   // 0x48(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotifyState_CharacterLoopedSound* GetDefaultObj();

};

// 0x18 (0x48 - 0x30)
// Class Solarland.AnimNotifyState_HideCharacterMesh
class UAnimNotifyState_HideCharacterMesh : public UAnimNotifyState
{
public:
	struct FGameplayTag                          VisibilityTag;                                     // 0x30(0x8)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPropagateToChildren;                              // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1631[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class USceneComponent>           ChildrenExceptClass;                               // 0x40(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotifyState_HideCharacterMesh* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class Solarland.AnimNotifyState_InhibitAimOffset
class UAnimNotifyState_InhibitAimOffset : public UAnimNotifyState
{
public:
	float                                        InhibitSmoothTime;                                 // 0x30(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        RecoverSmoothTime;                                 // 0x34(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCalcRecoverSmoothTimeByRemainingTime;             // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1632[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_InhibitAimOffset* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class Solarland.AnimNotifyState_InhibitLeftHandWeaponAttach
class UAnimNotifyState_InhibitLeftHandWeaponAttach : public UAnimNotifyState
{
public:
	float                                        InhibitSmoothTime;                                 // 0x30(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        RecoverSmoothTime;                                 // 0x34(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCalcRecoverSmoothTimeByRemainingTime;             // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1633[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_InhibitLeftHandWeaponAttach* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Solarland.AnimNotifyState_OpenTreasureBox
class UAnimNotifyState_OpenTreasureBox : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UAnimNotifyState_OpenTreasureBox* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class Solarland.AnimNotifyState_OverrideHitEffectSurfaceType
class UAnimNotifyState_OverrideHitEffectSurfaceType : public UAnimNotifyState
{
public:
	enum class EPhysicalSurface                  SurfaceType;                                       // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1639[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_OverrideHitEffectSurfaceType* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class Solarland.AnimNotifyState_PlayGameplayCueLocal
class UAnimNotifyState_PlayGameplayCueLocal : public UAnimNotifyState
{
public:
	struct FGameplayCueTag                       GameplayCueTag;                                    // 0x30(0x8)(Edit, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotifyState_PlayGameplayCueLocal* GetDefaultObj();

};

// 0x28 (0x58 - 0x30)
// Class Solarland.AnimNotifyState_RechargeShield
class UAnimNotifyState_RechargeShield : public UAnimNotifyState
{
public:
	struct FGameplayTagContainer                 GameplayTags;                                      // 0x30(0x20)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bFXorMesh;                                         // 0x50(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_163D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_RechargeShield* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Solarland.AnimNotifyState_RepairVehicleWeakPoints
class UAnimNotifyState_RepairVehicleWeakPoints : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UAnimNotifyState_RepairVehicleWeakPoints* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Solarland.AnimNotifyState_ShieldUpgradeFX
class UAnimNotifyState_ShieldUpgradeFX : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UAnimNotifyState_ShieldUpgradeFX* GetDefaultObj();

};

// 0x20 (0x50 - 0x30)
// Class Solarland.AnimNotifyState_SolarSpawnMeshAndAttach
class UAnimNotifyState_SolarSpawnMeshAndAttach : public UAnimNotifyState
{
public:
	TArray<struct FAttachedMeshInfo>             MeshesInfo;                                        // 0x30(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UStaticMeshComponent*>          SpawnedMeshComps;                                  // 0x40(0x10)(ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotifyState_SolarSpawnMeshAndAttach* GetDefaultObj();

};

// 0x80 (0xB0 - 0x30)
// Class Solarland.AnimNotifyState_SolarTimedParticleEffect
class UAnimNotifyState_SolarTimedParticleEffect : public UAnimNotifyState
{
public:
	bool                                         bAsyncLoad;                                        // 0x30(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1645[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UParticleSystem*                       PSTemplate;                                        // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UParticleSystem>        PSTemplateSoft;                                    // 0x40(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Attached;                                          // 0x68(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1646[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  SocketName;                                        // 0x6C(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocationOffset;                                    // 0x74(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RotationOffset;                                    // 0x80(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               Scale;                                             // 0x8C(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDestroyAtEnd;                                     // 0x98(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLockRelativeRotation;                             // 0x99(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1649[0x16];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_SolarTimedParticleEffect* GetDefaultObj();

};

// 0x20 (0x50 - 0x30)
// Class Solarland.AnimNotifyState_UpgradeShield
class UAnimNotifyState_UpgradeShield : public UAnimNotifyState
{
public:
	struct FGameplayTagContainer                 GameplayTags;                                      // 0x30(0x20)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotifyState_UpgradeShield* GetDefaultObj();

};

// 0x28 (0x68 - 0x40)
// Class Solarland.AttributeSubExecCalc
class UAttributeSubExecCalc : public UGameplayEffectExecutionCalculation
{
public:
	TSubclassOf<class UAttributeSubExecProxy>    CDOProxyClass;                                     // 0x40(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAttributeSubExecProxy*                CDOProxy;                                          // 0x48(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_164C[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAttributeSubExecCalc* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Solarland.AttributeSubExecProxy
class UAttributeSubExecProxy : public UObject
{
public:
	TWeakObjectPtr<class UAttributeSubExecCalc>  CDOOwner;                                          // 0x28(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAttributeSubExecProxy* GetDefaultObj();

	void ModifyAttributeSub(class USolarAttributeSubComponent* AttrSubComp, enum class EAttributeSubBehavior Behavior, int32 AttributeSubID, class FName AttrSubTag, float ModifyValue);
	struct FGameplayModifierEvaluatedData MakeExecProxyEvaluated(const struct FGameplayAttribute& InAttribute, float InMagnitud);
	void ExecutePureAttributeSub(class USolarAttributeSubComponent* AttrSubComp, TArray<struct FAttributeSubSetting>& InAttributeSubs);
	void ExecuteAttributeCalculation(class USolarAttributeSubComponent* AttrSubComp, TArray<struct FAttributeSubSetting>& InAttributeSubs, TArray<struct FGameplayAttribute>& InAttribute, TArray<struct FGameplayModifierEvaluatedData>* OutModResults);
	class UAttributeSubExecProxy* CreateProxy(class UAttributeSubExecCalc* InCDOOwner, TSubclassOf<class UAttributeSubExecProxy> ProxyClass);
};

// 0x20 (0x868 - 0x848)
// Class Solarland.AttributeSubGameplayEffect
class UAttributeSubGameplayEffect : public UGameplayEffect
{
public:
	TArray<struct FAttributeSubSetting>          AttributeSubMods;                                  // 0x848(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAttributeSubSetting>          PureAttributeSubs;                                 // 0x858(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAttributeSubGameplayEffect* GetDefaultObj();

	void UpdateAttributeBySub(const struct FGameplayAttribute& Attribute);
	class UAttributeSubGameplayEffect* CreateAttributeSubEffectInstance(class UObject* Outer, TSubclassOf<class UAttributeSubExecCalc> AttributeSubCalcClass, TSubclassOf<class UAttributeSubGameplayEffect> Class);
	void CancelPureAttributeSub(int32 AttributeSubID);
	void CancelAttributeSubModify(const struct FGameplayAttribute& Attribute, int32 AttributeSubID);
	void AddPureAttributeSub(int32 AttributeSubID, float Value);
	void AddAttributeSubModify(const struct FGameplayAttribute& Attribute, int32 AttributeSubID, float Value);
};

// 0x0 (0x28 - 0x28)
// Class Solarland.AttributeSubInterface
class IAttributeSubInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAttributeSubInterface* GetDefaultObj();

	class USolarAttributeSubComponent* GetAttributeSubComponent();
};

// 0x30 (0x630 - 0x600)
// Class Solarland.VertAnimMeshComponent
class UVertAnimMeshComponent : public UStaticMeshComponent
{
public:
	uint8                                        Pad_168E[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UVertAnimMeshComponent* GetDefaultObj();

	void PlayInfo(struct FVertexAnimInfo& InAnimInfo);
	void Play(int32 InStartFrame, int32 InEndFrame, float InLength, bool InLoop);
};

// 0xE0 (0x710 - 0x630)
// Class Solarland.BackpackVertAnimMeshComponent
class UBackpackVertAnimMeshComponent : public UVertAnimMeshComponent
{
public:
	struct FVertexAnimInfo                       DefaultAnimInfo;                                   // 0x630(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TMap<enum class EBackPackAnimSubType, struct FVertexAnimInfo> BackPackAnimInfoMap;                               // 0x640(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class ASolarCharacter*                       SolarCharacter;                                    // 0x690(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ASolarBackpackActor*                   BackPackActor;                                     // 0x698(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1692[0x70];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBackpackVertAnimMeshComponent* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Solarland.SolarAttributeSet
class USolarAttributeSet : public UAttributeSet
{
public:

	static class UClass* StaticClass();
	static class USolarAttributeSet* GetDefaultObj();

	void K2_SetAttributeValue(class FName AttributeName, float NewVal);
	void K2_OnReplicationAttribute(struct FGameplayAttributeData& OldValue, struct FGameplayAttributeData& ReplicatedAttribute, class FName AttributeName);
	void K2_InitAttributeValue(struct FGameplayAttributeData& OriginAttribute, float NewVal);
	float K2_GetAttributeValue(struct FGameplayAttributeData& OriginAttribute);
	struct FGameplayAttribute K2_GetAttribute(class FName AttributeName);
};

// 0x20 (0x50 - 0x30)
// Class Solarland.BasalAttributeSet
class UBasalAttributeSet : public USolarAttributeSet
{
public:
	struct FGameplayAttributeData                MaxHealth;                                         // 0x30(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FGameplayAttributeData                CurrentHealth;                                     // 0x40(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBasalAttributeSet* GetDefaultObj();

	void OnRep_MaxHealth(struct FGameplayAttributeData& Previous);
	void OnRep_CurrentHealth(struct FGameplayAttributeData& Previous);
};

// 0xD8 (0x338 - 0x260)
// Class Solarland.BattleChat
class UBattleChat : public UUserWidget
{
public:
	class UGaugeImage*                           ChatCDMask;                                        // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                ImgBG;                                             // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBoxGroup*                        CBGroupOperation;                                  // 0x270(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                            PanelChatOptions;                                  // 0x278(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USolarCheckBox*                        CBoxChatSwitch;                                    // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      AnimChatCooldown;                                  // 0x288(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UQuickChatUnit>            ChatButtonClass;                                   // 0x290(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           SeparatorBrush;                                    // 0x298(0x98)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_16CB[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBattleChat* GetDefaultObj();

	void SetLogDisplay(bool bDisplay);
	void ReceiveQuickMessage(const class FString& InName, const class FString& InMessage1, bool bLocalPlayer, bool bSound, int32 PosInTeam, const class FString& InMessage2);
	void ReceiveQuickChatSending();
	void OnGroupOperationStateChanged(TArray<class UCheckBox*>& ChildChangedArray, int32 CheckedChildIndex);
};

// 0x0 (0x318 - 0x318)
// Class Solarland.SolarHUD
class ASolarHUD : public AHUD
{
public:

	static class UClass* StaticClass();
	static class ASolarHUD* GetDefaultObj();

};

// 0x80 (0x398 - 0x318)
// Class Solarland.BattleHUDBase
class ABattleHUDBase : public ASolarHUD
{
public:
	TSubclassOf<class UHUDDispatcherBase>        Dispatcher;                                        // 0x318(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHUDDispatcherBase*                    WidgetEventDispatcher;                             // 0x320(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseBattleDeathView;                               // 0x328(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16E3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USolarPlayersHPModel*                  PlayersHPModel;                                    // 0x330(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USolarPlayersShieldModel*              PlayersShieldModel;                                // 0x338(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USolarTeamInfoModel*                   TeamInfoModelModel;                                // 0x340(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16E5[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABattleHUDBase* GetDefaultObj();

	void ShowDiePage_Deprecated();
	void OnPlayerStateRepInController(enum class EPlayerStateRepType RepType, class APlayerState* PlayerState);
	void OnPlayerStateRepInCharacter(enum class EPlayerStateRepType RepType, class APlayerState* PlayerState);
	void OnNewTeamInfo(class ASolarTeamInfo* TeamInfo);
	void OnCharacterEndPlay(class ASolarCharacter* Character);
	class UUISubsystem* GetUISubSystem();
	void CloseDiePage_Deprecated(TSubclassOf<class UUserWidget> InDiePageClass);
};

// 0x0 (0x398 - 0x398)
// Class Solarland.BattleHUDForTechDesign
class ABattleHUDForTechDesign : public ABattleHUDBase
{
public:

	static class UClass* StaticClass();
	static class ABattleHUDForTechDesign* GetDefaultObj();

};

// 0x28 (0x370 - 0x348)
// Class Solarland.UINoticeBase
class UUINoticeBase : public USolarUserWidget
{
public:
	class USolarRichTextBlock*                   TextWidget;                                        // 0x348(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                TxtBg;                                             // 0x350(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                Icon;                                              // 0x358(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                IconBg;                                            // 0x360(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16F9[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UUINoticeBase* GetDefaultObj();

	void ShowEnterAnimation();
	void SetIconBrush(const class FString& IconPath);
	void SetColor(struct FNoticeColorData& InColorData);
	void ResetIsPlayingVoice(enum class EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo);
	class UWidgetAnimation* GetExitAnimation();
	class UWidgetAnimation* GetEnterAnimation();
	void DefaultClose();
	void CloseNotice();
};

// 0xE8 (0x458 - 0x370)
// Class Solarland.BattleNoticeEquipReplace
class UBattleNoticeEquipReplace : public UUINoticeBase
{
public:
	class UImage*                                Img_Item1;                                         // 0x370(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Img_Item2;                                         // 0x378(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Img_Item1_BG;                                      // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Img_Item2_BG;                                      // 0x388(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                            Quality1;                                          // 0x390(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                            Quality2;                                          // 0x398(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      Enter_Animation_0;                                 // 0x3A0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      Enter_Animation_1;                                 // 0x3A8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      Enter_Animation_2;                                 // 0x3B0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<enum class EItemType, TSoftObjectPtr<class UTexture2D>> DefaultEquipIcons;                                 // 0x3B8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<enum class EWeaponPartType, TSoftObjectPtr<class UTexture2D>> DefaultWeaponPartIcons;                            // 0x408(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBattleNoticeEquipReplace* GetDefaultObj();

	void OnEquipReplaceAnimFinished();
};

// 0x30 (0x3A0 - 0x370)
// Class Solarland.BattleNoticePickup
class UBattleNoticePickup : public UUINoticeBase
{
public:
	class USolarTextBlock*                       Txt_PickupNotice_ItemName;                         // 0x370(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USolarTextBlock*                       Txt_PickupNotice_Head;                             // 0x378(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USolarTextBlock*                       Txt_PickupNotice_Tail;                             // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Img_Txt_bg;                                        // 0x388(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FLinearColor>                  QualityColor;                                      // 0x390(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBattleNoticePickup* GetDefaultObj();

};

// 0x10 (0x3A8 - 0x398)
// Class Solarland.BattleOBHUD
class ABattleOBHUD : public ABattleHUDBase
{
public:
	uint8                                        Pad_170F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USolarOBUIModel*                       SolarOBUIModel;                                    // 0x3A0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ABattleOBHUD* GetDefaultObj();

	void SetBattleOBHUDType(enum class EBattleOBHUDType& Type);
	void OpenShortCutKeyboard();
	class UOBHUDDispatcher* GetOBHUDDispatcher();
	enum class EBattleOBHUDType GetBattleOBHUDType();
	void AddWidgetToOBRoot(class UPanelSlot** ResultSlot, class UWidget* InChildWidget, class FName& PanelName, bool bReplaceOld);
};

// 0x10 (0x38 - 0x28)
// Class Solarland.BattlePassConfigInfo
class UBattlePassConfigInfo : public UObject
{
public:
	TArray<struct FBattlePassLevelInfo>          BattlePassLevel;                                   // 0x28(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBattlePassConfigInfo* GetDefaultObj();

	bool IsMaxLevelWithExp(int32 BattlePassID, int32 TotalExp);
	void Initialize();
	int32 GetLevelByTestExp(int32 BattlePassID, int32 InTestExp);
	int32 GetExpNeedForLv(int32 BattlePassID, int32 Level);
	int32 GetBattllePassMaxLevel(int32 BattlePassID);
};

// 0x308 (0x650 - 0x348)
// Class Solarland.BattlePromptWidget
class UBattlePromptWidget : public USolarUserWidget
{
public:
	uint8                                        Pad_1729[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCanvasPanel*                          EnterAnimPanel;                                    // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshRectangleWidget*                  MeshWidget_Arrow;                                  // 0x360(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshRectangleWidget*                  MeshWidget_Detail;                                 // 0x368(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class EBattlePromptType, enum class EBattlePromptType> DisplayTypeMap;                                    // 0x370(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<enum class EBattlePromptType, int32>    TypeUVMap;                                         // 0x3C0(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                        ElemIconDifference;                                // 0x410(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_172B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EBattlePromptType, float>    ElemRadiusMap;                                     // 0x418(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        ThreatFactorDefault;                               // 0x468(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_172C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EBattlePromptType, class UCurveFloat*> ElemArrowColorCurveMap;                            // 0x470(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<enum class EBattlePromptType, class UCurveFloat*> ElemArrowLengthCurveMap;                           // 0x4C0(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<enum class EBattlePromptType, class UCurveFloat*> ElemIconScaleCurveMap;                             // 0x510(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        CloseCheckAngleDefault;                            // 0x560(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_172F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           CloseCheckAngleCurve;                              // 0x568(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ElemLerpSpeed;                                     // 0x570(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        EditorTestColorFactor;                             // 0x574(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        EditorTestLengthFactor;                            // 0x578(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        EditorTestAngle;                                   // 0x57C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class AActor*>                          EffectedNightmareActors;                           // 0x580(0x50)(NativeAccessSpecifierPublic)
	uint8                                        Pad_1730[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FPromptElemInfo>               Datas;                                             // 0x5F0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1731[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBattlePromptWidget* GetDefaultObj();

	void PlayForbidAnim(bool bQuickEnter);
	void OnSpecTargetChanged(class ASolarPlayerState* OldTarget, class ASolarPlayerState* NewTarget);
	void OnNightComesActorChanged(class AActor* InActor);
};

// 0x50 (0x398 - 0x348)
// Class Solarland.BattleSubSundry
class UBattleSubSundry : public USolarUserWidget
{
public:
	class UScrollBox*                            PanelInformation;                                  // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USolarRichTextBlock*                   TxtInformation03;                                  // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USolarRichTextBlock*                   TxtInformation02;                                  // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USolarRichTextBlock*                   TxtInformation01;                                  // 0x360(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      AnimInformationDisappear;                          // 0x368(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxMessageStock;                                   // 0x370(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ChatCoolDown;                                      // 0x374(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        InfoKeepDuration;                                  // 0x378(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1740[0x1C];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBattleSubSundry* GetDefaultObj();

	void ReceiveQuickMessage(const class FString& InName, const class FString& InMessage, bool bLocalPlayer, bool bSound, int32 PosInTeam, const class FString& InMessage2);
	void OnPlayerStateRep(enum class EPlayerStateRepType RepType, class APlayerState* PlayerState);
};

// 0x50 (0x80 - 0x30)
// Class Solarland.BattleUpgradeEffectCategoryData
class UBattleUpgradeEffectCategoryData : public UDataAsset
{
public:
	TMap<enum class EBattleUpgradeEffectCategory, struct FBattleUpgradeEffectCategoryConfig> CategoryConfigMap;                                 // 0x30(0x50)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBattleUpgradeEffectCategoryData* GetDefaultObj();

	void BreakBattleUpgradeEffectCategoryColorSet(struct FBattleUpgradeEffectCategoryColorSet& ColorSet, struct FLinearColor* BannerCategoryTextColor, struct FLinearColor* BannerIconColor, struct FLinearColor* BannerBorderColor, struct FLinearColor* BannerBackgroundColor, struct FLinearColor* BadgeIconColor, struct FLinearColor* BadgeBackgroundColor);
};

// 0x58 (0x90 - 0x38)
// Class Solarland.BattleUpgradeEffectSettings
class UBattleUpgradeEffectSettings : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UDataTable>             EffectTypeConfig;                                  // 0x38(0x28)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SelectEffectHintLocalTextID;                       // 0x60(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1751[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UBattleUpgradeEffectCategoryData> EffectCategoryData;                                // 0x68(0x28)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBattleUpgradeEffectSettings* GetDefaultObj();

};

// 0x168 (0x390 - 0x228)
// Class Solarland.BigWaterGun
class ABigWaterGun : public AActor
{
public:
	float                                        CylinderRadius;                                    // 0x228(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CylinderLength;                                    // 0x22C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TraceInterval;                                     // 0x230(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DamageChaPerInterval;                              // 0x234(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DamageVehPerInterval;                              // 0x238(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DamageDecayFirst;                                  // 0x23C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DamageDecaySecond;                                 // 0x240(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_175B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSoftObjectPath                       MeshPath;                                          // 0x248(0x18)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  MeshSocket;                                        // 0x260(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                              WaterColumnEffectRotator;                          // 0x268(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_175D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UParticleSystem*                       WaterColumnEffect;                                 // 0x278(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  InstigatorEffectID;                                // 0x280(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCameraShake>              CameraShakeClass;                                  // 0x288(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>               InCrossHairClass;                                  // 0x290(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        NearlyEndTime;                                     // 0x298(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowDebug;                                        // 0x29C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1760[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               TraceStartRelativeLocation;                        // 0x2A0(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               TraceStartRelativeLocation_Crouch;                 // 0x2AC(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MuzzleTraceOffset;                                 // 0x2B8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ShotAnimNotifyName;                                // 0x2BC(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  UnequipAnimNotifyName;                             // 0x2C4(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  UnequipAnimNotifyName_Gatling;                     // 0x2CC(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1764[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           DamageDecayCurve;                                  // 0x2D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          ChaSlowDownDecayDataTag;                           // 0x2E0(0x8)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           ChaSlowDownDecayCurve;                             // 0x2E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          VehSlowDownDecayDataTag;                           // 0x2F0(0x8)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           VehSlowDownDecayCurve;                             // 0x2F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        OcclusionCheckZOffset;                             // 0x300(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1768[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class ASummonItemBase>>   BlockDamageItemClasses;                            // 0x308(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                Mesh;                                              // 0x318(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInFire;                                           // 0x320(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bHitOther;                                         // 0x321(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_176A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UParticleSystemComponent*              ClientWaterColumnEffectHandle;                     // 0x328(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        InstigatorEffectHandle;                            // 0x330(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_176C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCameraShake*                          CameraShakeInstance;                               // 0x338(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_176E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCrossHairWidget*                      CrossHairWidget;                                   // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayEffectSpecHandle             SlowDownEffectHandle;                              // 0x350(0x10)(NativeAccessSpecifierPrivate)
	uint8                                        Pad_176F[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  LeftHandIKGripSocketName;                          // 0x380(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          BigWaterGunOrnamentTag;                            // 0x388(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ABigWaterGun* GetDefaultObj();

	void PlayNearlyEndSound();
	void OnRep_InFire();
	void OnRep_HitOther();
	void OnMontageNotifyCallBack(class FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
};

// 0x50 (0x278 - 0x228)
// Class Solarland.SpawnerInGuide
class ASpawnerInGuide : public AActor
{
public:
	int32                                        BotAISpawnerId;                                    // 0x228(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BotAICharacterId;                                  // 0x22C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TeamID;                                            // 0x230(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_177A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                AIName;                                            // 0x238(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSpawnDeathBox;                                    // 0x248(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSpawnBeginPlay;                                   // 0x249(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_177D[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DelaySec;                                          // 0x24C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               SpawnLocationOffset;                               // 0x250(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_177E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class ASolarBotAIController>     BotAIControllerClass;                              // 0x260(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_177F[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASpawnerInGuide* GetDefaultObj();

	class ASolarBotAIController* SpawnBotAI();
	void SetBotAIConfig(class ASolarBotAIController* Ctrl);
	class ASolarBotAIController* GetSpawnedAIController();
};

// 0x40 (0x2B8 - 0x278)
// Class Solarland.BotAISpawnerInGuide
class ABotAISpawnerInGuide : public ASpawnerInGuide
{
public:
	class UBehaviorTree*                         BehaviorTree;                                      // 0x278(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDeathBoxItemData>             DeathBoxItems;                                     // 0x280(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BotDefaultWeaponId;                                // 0x290(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                       BotShootDisperse;                                  // 0x294(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HitRate;                                           // 0x298(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActiveDamageRate;                                  // 0x29C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NoDamageLeftHP;                                    // 0x2A0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BotAttackRange;                                    // 0x2A4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               MoveTarget;                                        // 0x2A8(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_178B[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABotAISpawnerInGuide* GetDefaultObj();

};

// 0x8 (0xC8 - 0xC0)
// Class Solarland.BTDecorator_BlackboardDelay
class UBTDecorator_BlackboardDelay : public UBTDecorator_Blackboard
{
public:
	float                                        DelaySeconds;                                      // 0xC0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOnlyDelayLowerPri;                                // 0xC4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_178F[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_BlackboardDelay* GetDefaultObj();

};

// 0x8 (0x98 - 0x90)
// Class Solarland.BTDecorator_TickFlow
class UBTDecorator_TickFlow : public UBTDecorator_BlackboardBase
{
public:
	float                                        TickInterval;                                      // 0x90(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1791[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_TickFlow* GetDefaultObj();

};

// 0x10 (0xA8 - 0x98)
// Class Solarland.BTDecorator_BotAttributeCompare
class UBTDecorator_BotAttributeCompare : public UBTDecorator_TickFlow
{
public:
	enum class EBotAttrType                      AttrType;                                          // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBotAttrValueType                 ValueType;                                         // 0x99(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBotAttrOperator                  Operator;                                          // 0x9A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1793[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CompareValue;                                      // 0x9C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCheckVehicle;                                     // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1794[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EqualThreshold;                                    // 0xA4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTDecorator_BotAttributeCompare* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class Solarland.BTDecorator_BotCheck
class UBTDecorator_BotCheck : public UBTDecorator_TickFlow
{
public:
	enum class EBotCheckCondition                Condition;                                         // 0x98(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1796[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_BotCheck* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class Solarland.BTDecorator_BotCheckAIServer
class UBTDecorator_BotCheckAIServer : public UBTDecorator_TickFlow
{
public:
	enum class EBotCheckAIServer                 Action;                                            // 0x98(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1798[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_BotCheckAIServer* GetDefaultObj();

};

// 0x20 (0xB8 - 0x98)
// Class Solarland.BTDecorator_BotCheckGameplayTags
class UBTDecorator_BotCheckGameplayTags : public UBTDecorator_TickFlow
{
public:
	struct FGameplayTagContainer                 AbilityTags;                                       // 0x98(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTDecorator_BotCheckGameplayTags* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class Solarland.BTDecorator_BotCheckInEffectArea
class UBTDecorator_BotCheckInEffectArea : public UBTDecorator_TickFlow
{
public:
	enum class EPerceivableEffectAreaType        CheckInAreaType;                                   // 0x98(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCheckAreaTendency;                                // 0x99(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPerceivableEffectAreaTendency    AreaTendency;                                      // 0x9A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_179D[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_BotCheckInEffectArea* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class Solarland.BTDecorator_BotCheckNgaiMLAction
class UBTDecorator_BotCheckNgaiMLAction : public UBTDecorator_TickFlow
{
public:
	enum class EBotCheckNgaiMLAction             Action;                                            // 0x98(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17A1[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_BotCheckNgaiMLAction* GetDefaultObj();

};

// 0x8 (0x70 - 0x68)
// Class Solarland.BTDecorator_BotCheckRoleAbility
class UBTDecorator_BotCheckRoleAbility : public UBTDecorator
{
public:
	struct FGameplayTag                          AbilityTag;                                        // 0x68(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTDecorator_BotCheckRoleAbility* GetDefaultObj();

};

// 0x0 (0x68 - 0x68)
// Class Solarland.BTDecorator_BotCheckShieldUpgradeItem
class UBTDecorator_BotCheckShieldUpgradeItem : public UBTDecorator
{
public:

	static class UClass* StaticClass();
	static class UBTDecorator_BotCheckShieldUpgradeItem* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class Solarland.BTDecorator_BotCheckState
class UBTDecorator_BotCheckState : public UBTDecorator_TickFlow
{
public:
	enum class EBotCheckState                    CheckState;                                        // 0x98(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17A3[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_BotCheckState* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class Solarland.BTDecorator_BotCheckTeamMemberState
class UBTDecorator_BotCheckTeamMemberState : public UBTDecorator_TickFlow
{
public:
	enum class ESolarBotMemberState              CheckState;                                        // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17A5[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_BotCheckTeamMemberState* GetDefaultObj();

};

// 0x8 (0x98 - 0x90)
// Class Solarland.BTDecorator_BotCheckWeaponType
class UBTDecorator_BotCheckWeaponType : public UBTDecorator_BlackboardBase
{
public:
	enum class EWeaponType                       WeaponType;                                        // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCheckById;                                        // 0x91(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17A6[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Weaponid;                                          // 0x94(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTDecorator_BotCheckWeaponType* GetDefaultObj();

};

// 0x18 (0xB0 - 0x98)
// Class Solarland.BTDecorator_BotWasRecentlyDetectArea
class UBTDecorator_BotWasRecentlyDetectArea : public UBTDecorator_TickFlow
{
public:
	float                                        TimeThresholdMax;                                  // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeThresholdMin;                                  // 0x9C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeThresholdMinDeviation;                         // 0xA0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSpecifyAreaType;                                  // 0xA4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPerceivableEffectAreaType        SpecifiedAreaType;                                 // 0xA5(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSpecifyAreaTendency;                              // 0xA6(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPerceivableEffectAreaTendency    SpecifiedAreaTendency;                             // 0xA7(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MinInfluenceValue;                                 // 0xA8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17A8[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_BotWasRecentlyDetectArea* GetDefaultObj();

};

// 0x18 (0xB0 - 0x98)
// Class Solarland.BTDecorator_BotWasRecentlyHit
class UBTDecorator_BotWasRecentlyHit : public UBTDecorator_TickFlow
{
public:
	float                                        TimeThresholdMax;                                  // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIncludeHearingHit;                                // 0x9C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTriggerDelay;                                     // 0x9D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17AB[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TriggerDelaySeconds;                               // 0xA0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TriggerDelaySecondsDeviation;                      // 0xA4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TriggerExpiredSeconds;                             // 0xA8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17AC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_BotWasRecentlyHit* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class Solarland.BTDecorator_CheckGetOnPlayerVehicle
class UBTDecorator_CheckGetOnPlayerVehicle : public UBTDecorator_TickFlow
{
public:
	float                                        AcceptableRadius;                                  // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17AE[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_CheckGetOnPlayerVehicle* GetDefaultObj();

};

// 0x8 (0xC8 - 0xC0)
// Class Solarland.BTDecorator_CheckTagState
class UBTDecorator_CheckTagState : public UBTDecorator_Blackboard
{
public:
	struct FGameplayTag                          CheckStateTag;                                     // 0xC0(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTDecorator_CheckTagState* GetDefaultObj();

};

// 0x90 (0x128 - 0x98)
// Class Solarland.BTDecorator_DistanceCompare
class UBTDecorator_DistanceCompare : public UBTDecorator_TickFlow
{
public:
	enum class EDistanceComparison               Operator;                                          // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17B0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                BlackboardKeyFrom;                                 // 0xA0(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                BlackboardKeyTo;                                   // 0xC8(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                        DistanceToCompare;                                 // 0xF0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17B1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                BBK_DistanceToCompare;                             // 0xF8(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                         bDistance2D;                                       // 0x120(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17B2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EqualThreshold;                                    // 0x124(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTDecorator_DistanceCompare* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Solarland.BTDecorator_TimeLimitRand
class UBTDecorator_TimeLimitRand : public UBTDecorator_TimeLimit
{
public:
	float                                        RandDeviation;                                     // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17B4[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_TimeLimitRand* GetDefaultObj();

};

// 0x10 (0xA8 - 0x98)
// Class Solarland.BTDecorator_VehicleCheck
class UBTDecorator_VehicleCheck : public UBTDecorator_TickFlow
{
public:
	TArray<int32>                                VehicleIDs;                                        // 0x98(0x10)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTDecorator_VehicleCheck* GetDefaultObj();

};

// 0xB0 (0xD8 - 0x28)
// Class Solarland.BuffEffectActorGroupVO
class UBuffEffectActorGroupVO : public UObject
{
public:
	uint8                                        Pad_17B5[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, struct FBuffEffectActorElemList> InstantActorListMap;                               // 0x30(0x50)(Transient, NativeAccessSpecifierPublic)
	uint8                                        Pad_17B6[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, class UBuffEffectActorElem*> DurationActorMap;                                  // 0x88(0x50)(Transient, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBuffEffectActorGroupVO* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class Solarland.BuffEffectVO
class UBuffEffectVO : public UObject
{
public:
	uint8                                        Pad_17B8[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuffEffectVO* GetDefaultObj();

};

// 0x18 (0x58 - 0x40)
// Class Solarland.BuffEffectActorVO
class UBuffEffectActorVO : public UBuffEffectVO
{
public:
	uint8                                        Pad_17B9[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuffEffectActorVO* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class Solarland.BuffEffectActorElem
class UBuffEffectActorElem : public UObject
{
public:
	uint8                                        Pad_17BB[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuffEffectActorElem* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Solarland.BuffEffectLibrary
class UBuffEffectLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UBuffEffectLibrary* GetDefaultObj();

	void StopScreenEffect(class UObject* WorldContextObject, int32 InHandle);
	void StopActorEffect(class UObject* WorldContextObject, int32 InHandle);
	int32 StartScreenEffect(class UObject* WorldContextObject, const class FString& RowName);
	int32 StartActorEffect(class UObject* WorldContextObject, const class FString& RowName, class USceneComponent* AttachToComponent);
	TArray<class UParticleSystemComponent*> GetActorEffectPSComponents(class UObject* WorldContextObject, int32 InHandle);
};

// 0x1B0 (0x4F8 - 0x348)
// Class Solarland.BuffEffectScreenPanel
class UBuffEffectScreenPanel : public USolarUserWidget
{
public:
	uint8                                        Pad_17C6[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCanvasPanel*                          LayerDurationGroup;                                // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                          LayerDurationTwoSidePart;                          // 0x360(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                          LayerDurationBottomHalfPart;                       // 0x368(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                          LayerDurationBorderPart;                           // 0x370(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                          LayerDurationTopHalfPart;                          // 0x378(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                          LayerDurationFullPart;                             // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                          LayerInstantGroup;                                 // 0x388(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                          LayerInstantTwoSidePart;                           // 0x390(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                          LayerInstantBottomHalfPart;                        // 0x398(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                          LayerInstantBorderPart;                            // 0x3A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                          LayerInstantTopHalfPart;                           // 0x3A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                          LayerInstantFullPart;                              // 0x3B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17C7[0xA0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, class USolarScreenEffectWidget*> HandleToWidget;                                    // 0x458(0x50)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class USolarScreenEffectWidget>, struct FScreenEffectWidgetCacheInfo> WidgetsCanBeReused;                                // 0x4A8(0x50)(ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBuffEffectScreenPanel* GetDefaultObj();

};

// 0x1F0 (0x220 - 0x30)
// Class Solarland.BuffEffectSubsystem
class UBuffEffectSubsystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_17CF[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<uint32, class UBuffEffectActorGroupVO*> BuffEffectActorGroupMap;                           // 0x40(0x50)(Transient, NativeAccessSpecifierPrivate)
	TMap<uint32, class UBuffEffectActorElem*>    BuffEffectActorElemMap;                            // 0x90(0x50)(Transient, NativeAccessSpecifierPrivate)
	TMap<int32, class UBuffEffectActorVO*>       BuffEffectActorHandleMap;                          // 0xE0(0x50)(Transient, NativeAccessSpecifierPrivate)
	TMap<enum class EBuffEffectTagType, struct FScreenEffectGroup> ScreenEffectGroups;                                // 0x130(0x50)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17D0[0xA0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuffEffectSubsystem* GetDefaultObj();

	void StopScreenEffect(int32 InHandle);
	void StopActorEffect(int32 InHandle);
	int32 StartScreenEffectSafe(class FName& RowName);
	int32 StartScreenEffect(const class FString& RowName);
	int32 StartActorEffectSafe(class FName& RowName, class USceneComponent* AttachToComponent);
	int32 StartActorEffect(const class FString& RowName, class USceneComponent* AttachToComponent);
	void OnPSCompFinish(class UParticleSystemComponent* PSComponent);
	TArray<class UParticleSystemComponent*> GetActorEffectPSComponents(int32 InHandle);
};

// 0x70 (0xB8 - 0x48)
// Class Solarland.CameraModifier_CameraShakeWithCurve
class UCameraModifier_CameraShakeWithCurve : public UCameraModifier
{
public:
	TMap<TSubclassOf<class UCameraShakeWithCurve>, struct FCameraShakeWithCurvePool> ShakePoolByClass;                                  // 0x48(0x50)(NativeAccessSpecifierPrivate)
	TArray<struct FCameraShakeWithCurveTemplatePool> ShakePoolByTemplate;                               // 0x98(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FActiveCameraShakeWithCurve>   ActiveShakes;                                      // 0xA8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCameraModifier_CameraShakeWithCurve* GetDefaultObj();

};

// 0xB8 (0xE0 - 0x28)
// Class Solarland.CameraShakeWithCurve
class UCameraShakeWithCurve : public UObject
{
public:
	bool                                         bSingleInstance;                                   // 0x28(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableObjectPool;                                // 0x29(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17D5[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCameraModifier_CameraShakeWithCurve*  Modifier;                                          // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ShakeTime;                                         // 0x38(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17D6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    ShakeCurve;                                        // 0x40(0x88)(Edit, NativeAccessSpecifierPrivate)
	TArray<class UCameraShakeWithCurve_Element*> ShakeElements;                                     // 0xC8(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17D7[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraShakeWithCurve* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Solarland.CameraShakeWithCurve_Element
class UCameraShakeWithCurve_Element : public UObject
{
public:

	static class UClass* StaticClass();
	static class UCameraShakeWithCurve_Element* GetDefaultObj();

};

// 0x38 (0x60 - 0x28)
// Class Solarland.CameraShakeWithCurve_Location
class UCameraShakeWithCurve_Location : public UCameraShakeWithCurve_Element
{
public:
	struct FSymmetricRangeFloat                  XRange;                                            // 0x28(0xC)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FSymmetricRangeFloat                  YRange;                                            // 0x34(0xC)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FSymmetricRangeFloat                  ZRange;                                            // 0x40(0xC)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                         bLocalSpace;                                       // 0x4C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17D8[0x13];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraShakeWithCurve_Location* GetDefaultObj();

};

// 0x30 (0x58 - 0x28)
// Class Solarland.CameraShakeWithCurve_Rotation
class UCameraShakeWithCurve_Rotation : public UCameraShakeWithCurve_Element
{
public:
	struct FSymmetricRangeFloat                  PitchRange;                                        // 0x28(0xC)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FSymmetricRangeFloat                  YawRange;                                          // 0x34(0xC)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FSymmetricRangeFloat                  RollRange;                                         // 0x40(0xC)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17D9[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraShakeWithCurve_Rotation* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class Solarland.CameraShakeWithCurve_FOV
class UCameraShakeWithCurve_FOV : public UCameraShakeWithCurve_Element
{
public:
	struct FRangeFloat                           FOVRange;                                          // 0x28(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17DA[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraShakeWithCurve_FOV* GetDefaultObj();

};

// 0x60 (0x90 - 0x30)
// Class Solarland.CapsuleFormationData
class UCapsuleFormationData : public UDataAsset
{
public:
	TMap<uint8, struct FEchelonFormation>        TeamFormation;                                     // 0x30(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FCruiseFormation                      CruiseFormation;                                   // 0x80(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UCapsuleFormationData* GetDefaultObj();

	void OverrideTeamFormation(TMap<uint8, struct FEchelonFormation>& InNewFormation);
	void ClearTeamFormationData();
	void ClearCruiseFormationData();
	void AddTeamFormationLocation(uint8 InEchelon, struct FVector& InLocation);
	void AddLocationToTeamFormation(TMap<uint8, struct FEchelonFormation>& InFormation, uint8 InEchelon, struct FVector& InLocation);
	void AddEchelonFormation(uint8 InEchelon, struct FEchelonFormation& InFormation);
	void AddCruiseFormation(struct FCruiseFormation& InFormation);
};

// 0xF0 (0x228 - 0x138)
// Class Solarland.CardView
class UCardView : public UWidget
{
public:
	TSubclassOf<class UUserWidget>               EntryWidgetClass;                                  // 0x138(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUserWidgetPool                       EntryWidgetPool;                                   // 0x140(0x80)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	float                                        CenterScale;                                       // 0x1C0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CenterOffset;                                      // 0x1C4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PageSpacing;                                       // 0x1C8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AlignmentPercent;                                  // 0x1CC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EOrientation                      Orientation;                                       // 0x1D0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17E6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UObject*>                       ListItems;                                         // 0x1D8(0x10)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17E7[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            BP_OnItemClicked;                                  // 0x1F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            BP_OnSelectedItemChanged;                          // 0x208(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            BP_OnSelectedIndexChanged;                         // 0x218(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UCardView* GetDefaultObj();

	void SetListItems(TArray<class UObject*>& InListItems);
	void RemoveItem(class UObject* InItem);
	TArray<class UObject*> GetListItems();
	TArray<class UUserWidget*> GetDisplayedEntryWidgets();
	void ClearListItems();
	void BP_SetSelectedItem(class UObject* Item);
	void BP_SetSelectedIndex(int32 Index, bool bFromFirst);
	void BP_SetListItems(TArray<class UObject*>& InListItems);
	class UObject* BP_GetSelectedItem();
	int32 BP_GetSelectedIndex();
	void AddItem(class UObject* InItem);
};

// 0x0 (0x28 - 0x28)
// Class Solarland.CardViewDesignerPreviewItem
class UCardViewDesignerPreviewItem : public UObject
{
public:

	static class UClass* StaticClass();
	static class UCardViewDesignerPreviewItem* GetDefaultObj();

};

// 0x8 (0xD8 - 0xD0)
// Class Solarland.CGCustomeBattleRoyaleComponent
class UCGCustomeBattleRoyaleComponent : public UGameModeCompBase
{
public:
	uint8                                        Pad_17EF[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCGCustomeBattleRoyaleComponent* GetDefaultObj();

	void ChangeEnvironmentTime(class ASolarTimeLineManager* SolarTimeLineManager, int32 DaylightChange);
};

// 0x30 (0x258 - 0x228)
// Class Solarland.CGFormula
class ACGFormula : public AInfo
{
public:
	struct FKnockoutParams                       KnockoutParams;                                    // 0x228(0x28)(NativeAccessSpecifierPublic)
	bool                                         bInitKnockParams;                                  // 0x250(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_180C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACGFormula* GetDefaultObj();

	TArray<class FString> MakeStringForLuaByAnyStruct(class UObject* AnyStruct);
	bool IsSettlementBagItem(class ASolarPlayerState* InPS);
	void InitKnockoutPointParams(struct FKnockoutParams* InParams);
	int32 GetZomborg(class ASolarPlayerState* InPS);
	void GetWeeklyChallenge(const class FString& InSolarPlayerID, TArray<class FString>* OutChallengeName, TArray<int32>* OutChallengeValue);
	int32 GetWeaponExp(class ASolarPlayerState* InPS, int32 InWeaponID);
	void GetTeamScoreComparison(class ASolarPlayerState* InPS, class FString* OutTeamScore);
	void GetStrategyGuideConditions(class ASolarPlayerState* InPS, TArray<int32>* OutResult);
	void GetShowPageIndexs(class ASolarPlayerState* InPS, struct FSettlePageParam& InParam, TArray<int32>* OutResult);
	TArray<struct FSettlementReward> GetSettlementRewards(class ASolarPlayerState* InPS);
	TArray<class FString> GetPersonalResultPlayerExData(const class FString& SolarPlayerID, class FString* InPBName);
	float GetKDA(class ASolarPlayerState* InPS);
	TArray<class FString> GetGroupResultPlayerExData(const class FString& SolarPlayerID, class FString* InPBName);
	TArray<struct FSettlementParam_ExtraRewardInfo> GetExtraRewards(class ASolarPlayerState* InPS);
	int32 GetCombatCore(class ASolarPlayerState* InPS);
	void GetCharacterExp(class ASolarPlayerState* InPS, int32* OutGetExp, TArray<int32>* OutReason);
	int32 GetAccountExp(class ASolarPlayerState* InPS);
	int32 CalculateTeamRank(class ASolarPlayerState* InPS);
	TArray<enum class ESCMPlayerPunishType> CalculatePunish(class ASolarPlayerState* InPS);
	int32 CalculatePlayerRank(class ASolarPlayerState* InPS);
	float CalculateMVPScore(class ASolarPlayerState* InPS);
	int32 CalculateKnockoutPoints(int32 InTeamRank, int32 InKillNum, float InTotalDamage, float InTotalDamageTaken);
};

// 0x90 (0x160 - 0xD0)
// Class Solarland.SolarGameModeAIComponent
class USolarGameModeAIComponent : public UGameModeCompBase
{
public:
	uint8                                        Pad_1813[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class ASolarBotAIController>     BotAIControllerClass;                              // 0xE0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASolarAIControllerBase>    OfflinePlayerAIControllerClass;                    // 0xE8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASolarGameMode*                        GameModeOwner;                                     // 0xF0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableIrisAIStrategy;                             // 0xF8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bEnableMLSetting;                                  // 0xF9(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPreserveBotOnMatchStart;                          // 0xFA(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1814[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class USolarBotAITeamManager>    BotTeamManagerClass;                               // 0x100(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USolarPreservedBotManager> BotPreservedManagerClass;                          // 0x108(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USolarBotAIWarmServiceSystem> BotWarmServiceSystemClass;                         // 0x110(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USolarBotTimelineSystem>   BotTimelineSystemClass;                            // 0x118(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxNumPreservedBots;                               // 0x120(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxRatioPreservedBots;                             // 0x124(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1815[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class USolarBotAITeamManager*                BotTeamManager;                                    // 0x138(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USolarPreservedBotManager*             BotPreservedManager;                               // 0x140(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USolarBotAIWarmServiceSystem*          BotWarmServiceSystem;                              // 0x148(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USolarBotTimelineSystem*               BotTimelineSystem;                                 // 0x150(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInitBotByTeamPreset;                              // 0x158(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBotTeamRebirth;                                // 0x159(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanPlayerTeamRebirth;                             // 0x15A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBotTeamBuyRescue;                              // 0x15B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanPlayerTeamBuyRescue;                           // 0x15C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1817[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USolarGameModeAIComponent* GetDefaultObj();

	bool PreserveBot(class ASolarBotAIController* InBotController, struct FVector& InPreservedLocation);
	bool PopPreservedBot(class ASolarBotAIController** OutController, struct FVector& OutTeleportLocation, class ASolarBotAIController* InSpecificController);
	void OnAcquiredIrisAIFeedStrategy(TArray<struct FFeedBotStrategyInfo>& StrategyInfos);
	void GetDeathBoxExtraStuff(class ASolarPlayerState* BotState, class ASolarPlayerState* PlayerState, TMap<int32, int32>* Stuff);
};

// 0x0 (0x160 - 0x160)
// Class Solarland.CGMAIComponent
class UCGMAIComponent : public USolarGameModeAIComponent
{
public:

	static class UClass* StaticClass();
	static class UCGMAIComponent* GetDefaultObj();

};

// 0x50 (0x78 - 0x28)
// Class Solarland.CGMCrossLevelDataMgr
class UCGMCrossLevelDataMgr : public UObject
{
public:
	TMap<class FString, class UObject*>          CrossLevelData;                                    // 0x28(0x50)(NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCGMCrossLevelDataMgr* GetDefaultObj();

	void RegistryCrossLevelData(const class FString& InSoltName, class UObject* InDataObj);
	class UObject* GetCrossLevelData(const class FString& InSoltName);
};

// 0x0 (0xD0 - 0xD0)
// Class Solarland.CustomGameModeComponent
class UCustomGameModeComponent : public UGameModeCompBase
{
public:

	static class UClass* StaticClass();
	static class UCustomGameModeComponent* GetDefaultObj();

};

// 0x18 (0xE8 - 0xD0)
// Class Solarland.CGMDataComponent
class UCGMDataComponent : public UCustomGameModeComponent
{
public:
	class AGameDataManager*                      DataManager;                                       // 0xD0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                            DataTable;                                         // 0xD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ConfigRepDeltaTime;                                // 0xE0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ConfigRepMaxNum;                                   // 0xE4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UCGMDataComponent* GetDefaultObj();

};

// 0x0 (0xD0 - 0xD0)
// Class Solarland.CGMDeathComponent
class UCGMDeathComponent : public UCustomGameModeComponent
{
public:

	static class UClass* StaticClass();
	static class UCGMDeathComponent* GetDefaultObj();

	void ReceivePlayerResurrect(class ASolarCharacter* ResurrectCharacter, class ASCMPlayerState* ResurrectPlayer);
	void ReceivePlayerKill(class ASCMPlayerState* Killer, class ASCMPlayerState* Killed, TArray<class ASCMPlayerState*>& Assists, struct FSolarPointDamageEvent& InDamageEvent, class AActor* InDamageCauser);
	void ReceivePlayerDeathVerge(class ASCMPlayerState* InAttacker, class ASCMPlayerState* InDeathVergePlayer, struct FSolarPointDamageEvent& InDamageEvent, class AActor* InDamageCauser);
};

// 0x8 (0x38 - 0x30)
// Class Solarland.GameplayConfigBase
class UGameplayConfigBase : public UDataAsset
{
public:
	class UGameModeGlobalSetting*                GameModeSettingTemplate;                           // 0x30(0x8)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UGameplayConfigBase* GetDefaultObj();

};

// 0x240 (0x278 - 0x38)
// Class Solarland.CGMGameplayConfig
class UCGMGameplayConfig : public UGameplayConfigBase
{
public:
	TSubclassOf<class ACGFormula>                Formula;                                           // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USettlementPageConfig*                 SettlePageConfig;                                  // 0x40(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FSCMMapConfig>    MapConfig;                                         // 0x48(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FDataManagerConfig                    DataManagerConfig;                                 // 0x98(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FJobManagerConfig                     JobConfig;                                         // 0xA8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         EnableUltimateSkill;                               // 0xB0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERoleSkillOperation               UltimateSkillStateOperationOnInit;                 // 0xB1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         EnableTacticalSkill;                               // 0xB2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERoleSkillOperation               TacticalSkillStateOperationOnInit;                 // 0xB3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AirDropSkillMode;                                  // 0xB4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         EnableWeaponUpgrade;                               // 0xB8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1823[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        InitInGamePlayerLevel;                             // 0xBC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         EnablePlayerUpgrade;                               // 0xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1824[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FInGameLevelingConfig                 InGameLevelingConfig;                              // 0xC8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<enum class ESolarTablesEnum_BattleUpgradeEffectType> CharacterDamageUpgradeTypes;                       // 0xD0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExpItemConfig                        ExpItemConfig;                                     // 0xE0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FExpItemReduceRate                    ExpItemReduceRateConfig;                           // 0xF0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoxBurstItemConfig                   BoxBurstItemConfig;                                // 0xF8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bIfShouldSpawnDeathBox;                            // 0x100(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIfSupportDeathverge;                              // 0x101(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1825[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, int32>                           DeathBoxEnergyLimitConfig;                         // 0x108(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bAutoMarkDamagedEnemy;                             // 0x158(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         EnableSect;                                        // 0x159(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1826[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCustomRoomData                       CustomRoomData;                                    // 0x160(0x78)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bIsCustomRoomMode;                                 // 0x1D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableTracking;                                   // 0x1D9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1827[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        InitTrackingDelay;                                 // 0x1DC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TrackingTimeInterval;                              // 0x1E0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultTrackMaxRevealDistance;                     // 0x1E4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TrackReplaceDistance;                              // 0x1E8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinRevealDistance;                                 // 0x1EC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TrackTimeout;                                      // 0x1F0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxTrackNum;                                       // 0x1F4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFinalsBGMData                        FinalsBGMData;                                     // 0x1F8(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bEnableSkydivingTrail;                             // 0x220(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1828[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class AActor>                  FlyTrailClass;                                     // 0x228(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AActor>                  DebugTrailEffectClass;                             // 0x250(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCGMGameplayConfig* GetDefaultObj();

	bool IsEnableSect();
	bool IsCustomRoomMode();
	int32 GetRequiredExpForLevel(int32 InLevel);
	int32 GetMaxShieldMatCountToDeathbox(int32 InLevel);
	int32 GetMaxInGameLevel();
	float GetExpItemReduceRate(int32 DeathCount);
	int32 GetExpItemCountByLevel(int32 InLevel, int32 InLevelGap);
	struct FCustomRoomData GetCustomRoomData();
	TArray<int32> GetBurstItemSplitPiles(int32 ItemID);
	TArray<float> GetBurstItemModelScale(int32 ItemID);
	int32 GetBurstItemMaxPileNum(int32 ItemID);
	TArray<int32> GetBurstItemIDs();
};

// 0x68 (0x138 - 0xD0)
// Class Solarland.CGMLogicComponent
class UCGMLogicComponent : public UCustomGameModeComponent
{
public:
	float                                        TimeOutSeconds;                                    // 0xD0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1836[0x64];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCGMLogicComponent* GetDefaultObj();

	void ReceiveSpectatorJoinData(class ASCMPlayerState* Player);
	void ReceiveServerLevelLoaded(const class FString& LevelName);
	bool ReceivePlayerTeamPreJoinRequest(TArray<class ASCMPlayerState*>& PreJoinPlayers, int32 TeamID);
	bool ReceivePlayerReJoinRequest(const class FString& PlayerId, class FString* ErrorMsg);
	void ReceivePlayerReJoin(class ASCMPlayerState* NewPlayer);
	void ReceivePlayerPreLogin(const class FString& PlayerId, class ASCMPlayerState* OfflinePlayer, class FString* ErrorMsg);
	void ReceivePlayerNonSpectatorJoinData(class ASCMPlayerState* Player);
	void ReceivePlayerLevelLoaded(class ASCMPlayerController* Player, const class FString& LevelName);
	void ReceivePlayerJoinData(const class FString& PlayerId);
	void ReceivePlayerJoinBattle(class ASCMPlayerState* NewPlayer, bool IsAI);
	void ReceivePlayerJoin(class ASCMPlayerState* NewPlayer, bool IsAI);
	void ReceivePlayerCancelJoin(const class FString& PlayerId);
	void ReceivePlayerBattleEnd(class ASCMPlayerState* Player, enum class ESCMPlayerOutType OutType);
	void ReceiveOBPlayersChanged();
	void ReceiveGameModeInit();
	void ReceiveBattleTick(float BattleTime, float DeltaTime);
	void ReceiveBattleEnd();
	void ReceiveBattleBegin();
	void OnStartBattle();
	void OnPlayerSettled(class ASCMPlayerState* Player);
	void OnPlayerReconnect(class ASCMPlayerState* Player);
	void OnPlayerOfflineTimeOut(class ASCMPlayerState* OfflineTimeoutPlayer);
	void OnPlayerGiveUp(class ASCMPlayerState* OfflineTimeoutPlayer);
	void OnPlayerDisconnect(class ASCMPlayerState* OfflinePlayer);
	void OnPlayerCheat(class ASCMPlayerState* CheatPlayer);
	void OnPlayerAbnormal(class ASCMPlayerState* CheatPlayer);
	void OnMatchEnd(int32 RPCID);
	void OnDSClose();
	void OnBotAIDataReady(int32 AICount);
	bool IsAllowReconnectGame(class ASCMPlayerState* InPC);
};

// 0x28 (0xD8 - 0xB0)
// Class Solarland.SolarGameplayConfigComponent
class USolarGameplayConfigComponent : public UActorComponent
{
public:
	bool                                         EnableTestGameplayConfig;                          // 0xB0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1839[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UGameplayConfigBase>       CGMConfig;                                         // 0xB8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayConfigBase>       TestCGMConfig;                                     // 0xC0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayConfigBase*                   InstGameplayConfig;                                // 0xC8(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayConfigBase*                   InstTestGameplayConfig;                            // 0xD0(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class USolarGameplayConfigComponent* GetDefaultObj();

	class UGameplayConfigBase* GetConfigs();
};

// 0x0 (0xD8 - 0xD8)
// Class Solarland.CGMManagerConfigComponent
class UCGMManagerConfigComponent : public USolarGameplayConfigComponent
{
public:

	static class UClass* StaticClass();
	static class UCGMManagerConfigComponent* GetDefaultObj();

};

// 0xB0 (0x180 - 0xD0)
// Class Solarland.CGMMapInfo
class UCGMMapInfo : public UGameModeCompBase
{
public:
	TArray<struct FVector>                       AreaPosArray;                                      // 0xD0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MapID;                                             // 0xE0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UsedAirlineID;                                     // 0xE4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAirlineData                          UsedAirlineData;                                   // 0xE8(0x28)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_183B[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, struct FAirlineData>             AirlineDataList;                                   // 0x120(0x50)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	int32                                        MaskWidth;                                         // 0x170(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaskScale;                                         // 0x174(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MapWidth;                                          // 0x178(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MapHeight;                                         // 0x17C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UCGMMapInfo* GetDefaultObj();

	void LoadAirlineData();
	void InitInfo(int32 InMapID);
	int32 GetUsedAirlineData(struct FAirlineData* OutData);
	int32 GetMapIDByName(class ASCustomGameState* InGameState, const class FString& Name);
};

// 0x28 (0xD8 - 0xB0)
// Class Solarland.CGMSettlementComponent
class UCGMSettlementComponent : public UActorComponent
{
public:
	uint8                                        Pad_183E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USettlementPageConfig*                 PageConfig;                                        // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                PageIndexs;                                        // 0xC0(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsCustomRoom;                                      // 0xD0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_183F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCGMSettlementComponent* GetDefaultObj();

	bool SkipToTarget();
	bool ShowNextStage();
};

// 0x68 (0xE8 - 0x80)
// Class Solarland.ChaAT_AddSynchronizedForce
class UChaAT_AddSynchronizedForce : public UAbilityTask
{
public:
	uint8                                        Pad_1840[0x68];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_AddSynchronizedForce* GetDefaultObj();

};

// 0xB0 (0x130 - 0x80)
// Class Solarland.ChaAT_AltitudeQuery
class UChaAT_AltitudeQuery : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnResponsed;                                       // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1846[0xA0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_AltitudeQuery* GetDefaultObj();

	class UChaAT_AltitudeQuery* StartSphereAltitudeQuery(class UGameplayAbility* OwningAbility, float InAltitude, float Radius, TArray<enum class EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, TArray<class AActor*>& ActorsToIgnore, bool bIgnoreSelf, bool bUsingAsyncQuery, bool bInTriggerOnce);
	class UChaAT_AltitudeQuery* StartLineAltitudeQuery(class UGameplayAbility* OwningAbility, float InAltitude, TArray<enum class EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, TArray<class AActor*>& ActorsToIgnore, bool bIgnoreSelf, bool bUsingAsyncQuery, bool bInTriggerOnce);
};

// 0xD0 (0x150 - 0x80)
// Class Solarland.ChaAT_HighAlert
class UChaAT_HighAlert : public USolarAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnHighAlertDelegate;                               // 0x80(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_1847[0xC0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_HighAlert* GetDefaultObj();

};

// 0x20 (0xA0 - 0x80)
// Class Solarland.ChaAT_LimitCameraOnStickingOutOfVehicle
class UChaAT_LimitCameraOnStickingOutOfVehicle : public USolarAbilityTask
{
public:
	uint8                                        Pad_1848[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_LimitCameraOnStickingOutOfVehicle* GetDefaultObj();

	class UChaAT_LimitCameraOnStickingOutOfVehicle* CreateTask(class UGameplayAbility* OwningAbility);
};

// 0x10 (0x90 - 0x80)
// Class Solarland.ChaAT_ListenChaTakeDamage
class UChaAT_ListenChaTakeDamage : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnTakeDamageDelegate;                              // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UChaAT_ListenChaTakeDamage* GetDefaultObj();

	void OnCharacterTakeDamage(class ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HPDamage);
	class UChaAT_ListenChaTakeDamage* CreateTask(class UGameplayAbility* OwningAbility);
};

// 0x18 (0x98 - 0x80)
// Class Solarland.ChaAT_ListenScopeOpeningAction
class UChaAT_ListenScopeOpeningAction : public USolarAbilityTask
{
public:
	class UGameplayAbility*                      OwnerAbility;                                      // 0x80(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASolarCharacter*                       TaskCharacter;                                     // 0x88(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_184C[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_ListenScopeOpeningAction* GetDefaultObj();

	class UChaAT_ListenScopeOpeningAction* CreateTask(class UGameplayAbility* OwningAbility, class ASolarCharacter* InCharacter, float MaxWaitTime);
};

// 0x10 (0x90 - 0x80)
// Class Solarland.ChaAT_ListenSkydive
class UChaAT_ListenSkydive : public USolarAbilityTask
{
public:
	uint8                                        Pad_184E[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_ListenSkydive* GetDefaultObj();

	void OnSkydiveStageChanged(class ASolarCharacter* InCharacter, enum class ESkydiveStage InOldStage, enum class ESkydiveStage InNewStage);
};

// 0x10 (0x118 - 0x108)
// Class Solarland.ChaAT_PlayMontageAndWaitForNotify
class UChaAT_PlayMontageAndWaitForNotify : public UAbilityTask_PlayMontageAndWait
{
public:
	FMulticastInlineDelegateProperty_            OnMontageNotify;                                   // 0x108(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UChaAT_PlayMontageAndWaitForNotify* GetDefaultObj();

	void OnMontageNotifyCallBack(class FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointPayload);
	class UChaAT_PlayMontageAndWaitForNotify* CreateTask(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class UAnimMontage* InMontageToPlay, float InRate, class FName InStartSection, bool bInStopWhenAbilityEnds, float InAnimRootMotionTranslationScale);
};

// 0xD0 (0x150 - 0x80)
// Class Solarland.ChaAT_PlayMontageForMeshAndWaitForEvent
class UChaAT_PlayMontageForMeshAndWaitForEvent : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnCompleted;                                       // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBlendOut;                                        // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnInterrupted;                                     // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCancelled;                                       // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            EventReceived;                                     // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                Mesh;                                              // 0xD0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                          MontageToPlay;                                     // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                 EventTags;                                         // 0xE0(0x20)(NativeAccessSpecifierPrivate)
	float                                        Rate;                                              // 0x100(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  StartSection;                                      // 0x104(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        AnimRootMotionTranslationScale;                    // 0x10C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bStopWhenAbilityEnds;                              // 0x110(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bReplicateMontage;                                 // 0x111(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1855[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OverrideBlendOutTimeForCancelAbility;              // 0x114(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        OverrideBlendOutTimeForStopWhenEndAbility;         // 0x118(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bInterruptedCalledBeforeBlendingOut;               // 0x11C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1856[0x33];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_PlayMontageForMeshAndWaitForEvent* GetDefaultObj();

	class UChaAT_PlayMontageForMeshAndWaitForEvent* PlayMontageForMeshAndWaitForEvent(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class USkeletalMeshComponent* Mesh, class UAnimMontage* MontageToPlay, float Rate, class FName StartSection, bool bStopWhenAbilityEnds, float AnimRootMotionTranslationScale, bool bReplicateMontage, float OverrideBlendOutTimeForCancelAbility, float OverrideBlendOutTimeForStopWhenEndAbility);
};

// 0x30 (0xB0 - 0x80)
// Class Solarland.ChaAT_SkywardDiveTask
class UChaAT_SkywardDiveTask : public USolarAbilityTask
{
public:
	uint8                                        Pad_1858[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_SkywardDiveTask* GetDefaultObj();

	class UChaAT_SkywardDiveTask* CreateTask(class UGameplayAbility* OwningAbility, const struct FVector& InLauncherLocation, int32 InOccupyLaunchDeviceIndex);
};

// 0x8 (0x88 - 0x80)
// Class Solarland.ChaAT_UpdateSkydiveTrail
class UChaAT_UpdateSkydiveTrail : public USolarAbilityTask
{
public:
	uint8                                        Pad_1859[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_UpdateSkydiveTrail* GetDefaultObj();

	class UChaAT_UpdateSkydiveTrail* CreateTask(class UGameplayAbility* OwningAbility);
};

// 0x40 (0xC0 - 0x80)
// Class Solarland.ChaAT_UpdateZipline
class UChaAT_UpdateZipline : public USolarAbilityTask
{
public:
	uint8                                        Pad_185A[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_UpdateZipline* GetDefaultObj();

	class UChaAT_UpdateZipline* CreateTask(class UGameplayAbility* OwningAbility, struct FVector& InStartLoc, struct FVector& InEndLoc, float InSpeed, float InCheckDis);
};

// 0x10 (0x90 - 0x80)
// Class Solarland.ChaAT_WaitCharacterDeathEnd
class UChaAT_WaitCharacterDeathEnd : public USolarAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnCharacterDeathEnd;                               // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UChaAT_WaitCharacterDeathEnd* GetDefaultObj();

	class UChaAT_WaitCharacterDeathEnd* CreateTask(class UGameplayAbility* OwningAbility);
};

// 0x20 (0xA0 - 0x80)
// Class Solarland.ChaAT_WaitCharacterLaunchEnd
class UChaAT_WaitCharacterLaunchEnd : public USolarAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnCharacterLaunchEnd;                              // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_185C[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MoveModeCheckDelayTime;                            // 0x9C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UChaAT_WaitCharacterLaunchEnd* GetDefaultObj();

	class UChaAT_WaitCharacterLaunchEnd* CreateTask(class UGameplayAbility* OwningAbility, float InWaitLaunchingTime);
};

// 0x20 (0xA0 - 0x80)
// Class Solarland.ChaAT_WaitCharacterPostDeath
class UChaAT_WaitCharacterPostDeath : public USolarAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnDestroyCharacterCorpse;                          // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_185E[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_WaitCharacterPostDeath* GetDefaultObj();

	class UChaAT_WaitCharacterPostDeath* CreateTask(class UGameplayAbility* OwningAbility, float InDestroyCorpseTime);
};

// 0x10 (0x90 - 0x80)
// Class Solarland.ChaAT_WaitCharacterSprintCancel
class UChaAT_WaitCharacterSprintCancel : public USolarAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnCharacterSprintCancel;                           // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UChaAT_WaitCharacterSprintCancel* GetDefaultObj();

	class UChaAT_WaitCharacterSprintCancel* CreateTask(class UGameplayAbility* OwningAbility);
};

// 0x20 (0xA0 - 0x80)
// Class Solarland.ChaAT_WaitControlRotationYawOutOfRange
class UChaAT_WaitControlRotationYawOutOfRange : public UAbilityTask
{
public:
	uint8                                        Pad_185F[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_WaitControlRotationYawOutOfRange* GetDefaultObj();

	class UChaAT_WaitControlRotationYawOutOfRange* CreateTask(class UGameplayAbility* OwningAbility, float YawMin, float YawMax);
};

// 0x18 (0x98 - 0x80)
// Class Solarland.ChaAT_WaitDelay
class UChaAT_WaitDelay : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnFinish;                                          // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1861[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_WaitDelay* GetDefaultObj();

	class UChaAT_WaitDelay* WaitDelay(class UGameplayAbility* OwningAbility, float Time);
};

// 0x40 (0xC0 - 0x80)
// Class Solarland.ChaAT_WaitLandingSpot
class UChaAT_WaitLandingSpot : public UAbilityTask
{
public:
	uint8                                        Pad_1862[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_WaitLandingSpot* GetDefaultObj();

};

// 0x20 (0xA0 - 0x80)
// Class Solarland.ChaAT_WaitOverlapEx
class UChaAT_WaitOverlapEx : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnOverLap;                                         // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1864[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_WaitOverlapEx* GetDefaultObj();

	class UChaAT_WaitOverlapEx* WaitForOverlap(class UGameplayAbility* OwningAbility, const TArray<TSubclassOf<class AActor>>& InIgnoreClasses);
	void OnHitCallback(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
};

// 0x20 (0xA0 - 0x80)
// Class Solarland.ChaAT_WaitVehicleWeakPointRepairingEnd
class UChaAT_WaitVehicleWeakPointRepairingEnd : public USolarAbilityTask
{
public:
	uint8                                        Pad_1867[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnVehicleWeakPointRepairingEnd;                    // 0x88(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1868[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaAT_WaitVehicleWeakPointRepairingEnd* GetDefaultObj();

	class UChaAT_WaitVehicleWeakPointRepairingEnd* CreateTask(class UGameplayAbility* OwningAbility, struct FVehicleWeakPointSpec* RepairingVehicleWeakPoint);
};

// 0x18 (0x418 - 0x400)
// Class Solarland.SolarGameplayAbility
class USolarGameplayAbility : public UGameplayAbility
{
public:
	bool                                         bTryActivateWhenGranted;                           // 0x400(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ESolarGAInputID                   InputID;                                           // 0x401(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowReconnection;                                // 0x402(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bActiveOnPress;                                    // 0x403(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_186F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAbilityMeshMontage>           CurrentAbilityMeshMontages;                        // 0x408(0x10)(ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class USolarGameplayAbility* GetDefaultObj();

	void RemoveGameplayCueLocal(const struct FGameplayTag& GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters);
	void ReceivingGiven(struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayAbilitySpec& Spec);
	bool OnLevelUp(int32 OldLevel, struct FGameplayAbilitySpec& Spec);
	void MontageStopForMesh(class USkeletalMeshComponent* InMesh, float OverrideBlendOutTime);
	void MontageStopForAllMeshes(float OverrideBlendOutTime);
	void MontageSetNextSectionNameForMesh(class USkeletalMeshComponent* InMesh, class FName FromSectionName, class FName ToSectionName);
	void MontageJumpToSectionForMesh(class USkeletalMeshComponent* InMesh, class FName SectionName);
	int32 GetDefaultGrantedLevel(class AActor* InOwner, class AActor* InAvatar);
	class UAnimMontage* GetCurrentMontageForMesh(class USkeletalMeshComponent* InMesh);
	void ExecuteGameplayCueLocal(const struct FGameplayTag& GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters);
	void AddGameplayCueLocal(const struct FGameplayTag& GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters);
};

// 0x20 (0x438 - 0x418)
// Class Solarland.ResidentPassiveSkill
class UResidentPassiveSkill : public USolarGameplayAbility
{
public:
	TArray<TSubclassOf<class UGameplayEffect>>   ResidentEffectClasses;                             // 0x418(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1870[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UResidentPassiveSkill* GetDefaultObj();

};

// 0x0 (0x438 - 0x438)
// Class Solarland.ChaGA_AerialReconnaissance
class UChaGA_AerialReconnaissance : public UResidentPassiveSkill
{
public:

	static class UClass* StaticClass();
	static class UChaGA_AerialReconnaissance* GetDefaultObj();

	void OnSkydiveStageChanged(class ASolarCharacter* InCharacter, enum class ESkydiveStage InOldStage, enum class ESkydiveStage InNewStage);
};

// 0x48 (0x460 - 0x418)
// Class Solarland.SolarCharacterGameplayAbility
class USolarCharacterGameplayAbility : public USolarGameplayAbility
{
public:
	struct FGameplayTagContainer                 ActivationOwnedReplicatedTags;                     // 0x418(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSolarGameplayEffectConfig>    ActivationOwnedReplicatedGameplayEffects;          // 0x438(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1872[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USolarCharacterGameplayAbility* GetDefaultObj();

	class ASolarCharacter* GetOwningCharacterFromActorInfo();
	class ASolarCharacter* GetAvatarSolarCharacterFromActorInfo();
};

// 0x8 (0x468 - 0x460)
// Class Solarland.ChaGA_Aim
class UChaGA_Aim : public USolarCharacterGameplayAbility
{
public:
	TSubclassOf<class UGameplayEffect>           AimGameplayEffectClass;                            // 0x460(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UChaGA_Aim* GetDefaultObj();

};

// 0x60 (0x4C0 - 0x460)
// Class Solarland.ChaGA_ThrowSkill
class UChaGA_ThrowSkill : public USolarCharacterGameplayAbility
{
public:
	enum class ESkillAnimType                    SkillAnimType;                                     // 0x460(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ESkillAnimRightHandType           SkillAnimRightHandType;                            // 0x461(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldWaitMontageNotifyToThrow;                   // 0x462(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1878[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  MontageNotifyToWait;                               // 0x464(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanHoldWeapon;                                    // 0x46C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_187A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ActiveMontageNotifyToReady;                        // 0x470(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldWaitActiveMontageNotifyToPrepare;           // 0x478(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_187C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ActiveMontageNotifyToPrepare;                      // 0x47C(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldWaitActiveMontageNotifyToThrow;             // 0x484(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_187E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ActiveMontageNotifyToThrow;                        // 0x488(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  MontageSectionToJumpOnInputReleased;               // 0x490(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAbilityTask_NetworkSyncPoint*         WaitThrowTask;                                     // 0x498(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                          ActiveMontage;                                     // 0x4A0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                          FireMontage;                                       // 0x4A8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                          CancelMontage;                                     // 0x4B0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_187F[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChaGA_ThrowSkill* GetDefaultObj();

	void WaitToThrow();
	void StartToThrow();
	void PrepareToThrow();
	void OnRceiveWaitToThrow();
	void OnMontageNotify(class FName NotifyName);
	void OnMontageCompleted();
	void OnFireMontageStartBlendingOut();
	void OnActiveMontageNotify(class FName NotifyName);
	void OnActiveMontageCompleted();
};

// 0x128 (0x5E8 - 0x4C0)
// Class Solarland.SolarSkillGA_Projectile
class USolarSkillGA_Projectile : public UChaGA_ThrowSkill
{
public:
	struct FSolarSkillProjectileData             ProjectileData;                                    // 0x4C0(0xD0)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AGameplayAbilityTargetActor> GATargetActorClass;                                // 0x590(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AActor>>            SpawnActorClasses;                                 // 0x598(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>           GEToSelfClass;                                     // 0x5A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>           GEToTargetClass;                                   // 0x5B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseKeyUpLocation;                                 // 0x5B8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseKeyUpDirection;                                // 0x5B9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1885[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAbilityTask_WaitTargetData*           WaitTargetDataTask;                                // 0x5C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AActor*>                        SpawnActors;                                       // 0x5C8(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AGameplayAbilityTargetActor> TargetActorCache;                                  // 0x5D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1886[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USolarSkillGA_Projectile* GetDefaultObj();

	void OnWaitTargetDataTaskValid(struct FGameplayAbilityTargetDataHandle& InTargetData);
	void OnWaitTargetDataTaskCancelled(struct FGameplayAbilityTargetDataHandle& InTargetData);
};

// 0x30 (0x618 - 0x5E8)
// Class Solarland.SolarSkillGA_Summon
class USolarSkillGA_Summon : public USolarSkillGA_Projectile
{
public:
	class USolarSummonDetectionConfig*           SummonConfig;                                      // 0x5E8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SummonFailedNoticeID;                              // 0x5F0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseKeyUpLocationSummon;                           // 0x5F4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1888[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class ASolarSkillGATA_Summon> SummonTargetActor;                                 // 0x5F8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                          ActiveMontageForGunAim;                            // 0x600(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                          FireMontageForGunAim;                              // 0x608(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                          CancelMontageForGunAim;                            // 0x610(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class USolarSkillGA_Summon* GetDefaultObj();

};

// 0x78 (0x690 - 0x618)
// Class Solarland.ChaGA_AirDrop
class UChaGA_AirDrop : public USolarSkillGA_Summon
{
public:
	TSubclassOf<class ASolarTreasureBoxSpawner>  TreasureBoxSpawnerClass;                           // 0x618(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        OutcomeID;                                         // 0x620(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1889[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAirDropSkillDatas>            AirDropSkillSetting;                               // 0x628(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ChestID;                                           // 0x638(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        BoxType;                                           // 0x63C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CastTime;                                          // 0x640(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ReadyTime;                                         // 0x644(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          PrepareGameplayCue;                                // 0x648(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
