#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction SolarGameInstance.SolarGameInstance_C.OnRefreshFirebaseToken_45F5E6464AD7CE552AD40E86573CFD3F
	 */
	struct USolarGameInstance_C_OnRefreshFirebaseToken_45F5E6464AD7CE552AD40E86573CFD3F_Params
	{
	public:
		class FString                                              FirebaseToken;                                           // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction SolarGameInstance.SolarGameInstance_C.OnClearCommunityRedhint_CD5F6FBE4F6B9F84F882B1B6BBA79552
	 */
	struct USolarGameInstance_C_OnClearCommunityRedhint_CD5F6FBE4F6B9F84F882B1B6BBA79552_Params
	{
	public:
		class FString                                              ResultStr;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction SolarGameInstance.SolarGameInstance_C.OnGetCommunityRedhint_91AFE95F48FE071705E6C2B8EC1F039D
	 */
	struct USolarGameInstance_C_OnGetCommunityRedhint_91AFE95F48FE071705E6C2B8EC1F039D_Params
	{
	public:
		class FString                                              ResultStr;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction SolarGameInstance.SolarGameInstance_C.OnExitCommunity_EA611FB6489B33AEBE3A03A882524BE8
	 */
	struct USolarGameInstance_C_OnExitCommunity_EA611FB6489B33AEBE3A03A882524BE8_Params
	{
	public:
		class FString                                              ResultStr;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction SolarGameInstance.SolarGameInstance_C.OnInitCommunity_AAB93EEF46C6EAC3FC559D90728C0CC2
	 */
	struct USolarGameInstance_C_OnInitCommunity_AAB93EEF46C6EAC3FC559D90728C0CC2_Params
	{
	public:
		class FString                                              ResultStr;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction SolarGameInstance.SolarGameInstance_C.OnLimPCSDKLanguageChange_1170F2024D0543E3ED12298B9C8F7F97
	 */
	struct USolarGameInstance_C_OnLimPCSDKLanguageChange_1170F2024D0543E3ED12298B9C8F7F97_Params
	{
	public:
		class FString                                              Datas;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction SolarGameInstance.SolarGameInstance_C.OnLimPCSDKLogout_EB1D2F6A485162AB25AEF7A85F953AD9
	 */
	struct USolarGameInstance_C_OnLimPCSDKLogout_EB1D2F6A485162AB25AEF7A85F953AD9_Params
	{
	public:
		class FString                                              Datas;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction SolarGameInstance.SolarGameInstance_C.OnLimPCSDKLogin_80F8FBC240DEBE0BA287EF91CD89186F
	 */
	struct USolarGameInstance_C_OnLimPCSDKLogin_80F8FBC240DEBE0BA287EF91CD89186F_Params
	{
	public:
		class FString                                              Datas;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction SolarGameInstance.SolarGameInstance_C.OnLimPCSDKEventCallback_647026E6486AC48AF5DDF1B80E32E1B4
	 */
	struct USolarGameInstance_C_OnLimPCSDKEventCallback_647026E6486AC48AF5DDF1B80E32E1B4_Params
	{
	public:
		class FString                                              Datas;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction SolarGameInstance.SolarGameInstance_C.OnLimPCSDKInited_0B55AD8F46E687BEC58C379A13B5FC5B
	 */
	struct USolarGameInstance_C_OnLimPCSDKInited_0B55AD8F46E687BEC58C379A13B5FC5B_Params
	{
	public:
		class FString                                              Datas;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction SolarGameInstance.SolarGameInstance_C.OnLimPCPayApplied_7215EAEE4F7A4B0F290D8087192DB42B
	 */
	struct USolarGameInstance_C_OnLimPCPayApplied_7215EAEE4F7A4B0F290D8087192DB42B_Params
	{
	public:
		class FString                                              Datas;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction SolarGameInstance.SolarGameInstance_C.OnLimPCQueryPriceLadder_78D88F11411D0B8ACE78FDA0E07B7C3C
	 */
	struct USolarGameInstance_C_OnLimPCQueryPriceLadder_78D88F11411D0B8ACE78FDA0E07B7C3C_Params
	{
	public:
		class FString                                              Datas;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.OnDisconnect
	 */
	struct USolarGameInstance_C_OnDisconnect_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.CheckSavedDirFiles
	 */
	struct USolarGameInstance_C_CheckSavedDirFiles_Params
	{
	public:
		TArray<class FString>                                      Files;                                                   // 0x0000(0x0010)  (Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.LuaGetBroadcastHeroNameCopy
	 */
	struct USolarGameInstance_C_LuaGetBroadcastHeroNameCopy_Params
	{
	public:
		class FString                                              SolarPlayerID;                                           // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		class FString                                              BroadcastPlayerName;                                     // 0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.OnScopeChanged
	 */
	struct USolarGameInstance_C_OnScopeChanged_Params
	{
	public:
		EScope                                                     InLastScope;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EScope                                                     InCurScope;                                              // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.ShutDownPCSDK
	 */
	struct USolarGameInstance_C_ShutDownPCSDK_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.ShutdownAnoSDK
	 */
	struct USolarGameInstance_C_ShutdownAnoSDK_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.InitLuaClasses
	 */
	struct USolarGameInstance_C_InitLuaClasses_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.RegisterNetworkManager
	 */
	struct USolarGameInstance_C_RegisterNetworkManager_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.ExecuteChangeAudioModeLuaCall
	 */
	struct USolarGameInstance_C_ExecuteChangeAudioModeLuaCall_Params
	{
	public:
		bool                                                       bTurnOn;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.LuaStartGameFrameWork
	 */
	struct USolarGameInstance_C_LuaStartGameFrameWork_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.HandleNetworkError
	 */
	struct USolarGameInstance_C_HandleNetworkError_Params
	{
	public:
		ENetworkFailure                                            FailureType;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsServer;                                               // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.SolarGM_LobbyLua
	 */
	struct USolarGameInstance_C_SolarGM_LobbyLua_Params
	{
	public:
		class FString                                              CmdName;                                                 // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class FString>                                      Params;                                                  // 0x0010(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.LuaInitGameFrameWork
	 */
	struct USolarGameInstance_C_LuaInitGameFrameWork_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.SolarGM_TransmitGMLua
	 */
	struct USolarGameInstance_C_SolarGM_TransmitGMLua_Params
	{
	public:
		class FString                                              playerName;                                              // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class FString>                                      GmArray;                                                 // 0x0010(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.SolarGM_AddWeaponExpLua
	 */
	struct USolarGameInstance_C_SolarGM_AddWeaponExpLua_Params
	{
	public:
		int32_t                                                    weaponid;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    count;                                                   // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.ShutDownLimSdk
	 */
	struct USolarGameInstance_C_ShutDownLimSdk_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.GoHomeLuaCall
	 */
	struct USolarGameInstance_C_GoHomeLuaCall_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.SolarGM_AddItemLua
	 */
	struct USolarGameInstance_C_SolarGM_AddItemLua_Params
	{
	public:
		int32_t                                                    ItemID;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    count;                                                   // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.ReceiveShutdown
	 */
	struct USolarGameInstance_C_ReceiveShutdown_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.ExecuteBackKeyLuaCall
	 */
	struct USolarGameInstance_C_ExecuteBackKeyLuaCall_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.ReportLoadingInfoToBI
	 */
	struct USolarGameInstance_C_ReportLoadingInfoToBI_Params
	{
	public:
		TArray<class FString>                                      LoadingInfo;                                             // 0x0000(0x0010)  (Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      LoadingTime;                                             // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsFinished;                                             // 0x0014(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.LuaGetBroadcastPlayerNameCopy
	 */
	struct USolarGameInstance_C_LuaGetBroadcastPlayerNameCopy_Params
	{
	public:
		class FString                                              SolarPlayerID;                                           // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		class FString                                              BroadcastPlayerName;                                     // 0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.LuaOnBroadcastModeChanged
	 */
	struct USolarGameInstance_C_LuaOnBroadcastModeChanged_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.LuaGetBroadcastPlayerName
	 */
	struct USolarGameInstance_C_LuaGetBroadcastPlayerName_Params
	{
	public:
		class FString                                              SolarPlayerID;                                           // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		class FString                                              BroadcastPlayerName;                                     // 0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.LuaGetBroadcastHeroName
	 */
	struct USolarGameInstance_C_LuaGetBroadcastHeroName_Params
	{
	public:
		class FString                                              SolarPlayerID;                                           // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		class FString                                              BroadcastPlayerName;                                     // 0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.SolarGM_TestCrashWithBP
	 */
	struct USolarGameInstance_C_SolarGM_TestCrashWithBP_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.SolarGM_TestEnsureMsgWithBP
	 */
	struct USolarGameInstance_C_SolarGM_TestEnsureMsgWithBP_Params
	{	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.ExecuteUbergraph_SolarGameInstance
	 */
	struct USolarGameInstance_C_ExecuteUbergraph_SolarGameInstance_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function SolarGameInstance.SolarGameInstance_C.OnBroadcastModeChanged__DelegateSignature
	 */
	struct USolarGameInstance_C_OnBroadcastModeChanged__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
