#pragma once

/**
 * Name: FL84
 * Version: 1.15.1.6
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_BusinessInfo.UI_BusinessInfo_C.GetModuleName
	 */
	struct UUI_BusinessInfo_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_BusinessInfo.UI_BusinessInfo_C.Set Player Number
	 */
	struct UUI_BusinessInfo_C_SetPlayerNumber_Params
	{
	public:
		int32_t                                                    PlayerNumber;                                            // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_BusinessInfo.UI_BusinessInfo_C.PreConstruct
	 */
	struct UUI_BusinessInfo_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_BusinessInfo.UI_BusinessInfo_C.OnRefreshWidget
	 */
	struct UUI_BusinessInfo_C_OnRefreshWidget_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_BusinessInfo.UI_BusinessInfo_C.ExecuteUbergraph_UI_BusinessInfo
	 */
	struct UUI_BusinessInfo_C_ExecuteUbergraph_UI_BusinessInfo_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
