#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_6E78FC9E46B098A1927284AAA21E3D66
	 */
	struct UUI_Currency_Bar_C_OnClicked_6E78FC9E46B098A1927284AAA21E3D66_Params
	{	};

	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_400DD5ED40EAE2E734166B9DC44B2B56
	 */
	struct UUI_Currency_Bar_C_OnClicked_400DD5ED40EAE2E734166B9DC44B2B56_Params
	{	};

	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_4910C97048176A6F1C12D1B35CA71427
	 */
	struct UUI_Currency_Bar_C_OnClicked_4910C97048176A6F1C12D1B35CA71427_Params
	{	};

	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_CC9BE56D485D0C97063C3A838B18AEDA
	 */
	struct UUI_Currency_Bar_C_OnClicked_CC9BE56D485D0C97063C3A838B18AEDA_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.Construct
	 */
	struct UUI_Currency_Bar_C_Construct_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.OnSolarUIClosed
	 */
	struct UUI_Currency_Bar_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.OnSolarUIOpened
	 */
	struct UUI_Currency_Bar_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.GetModuleName
	 */
	struct UUI_Currency_Bar_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.SetStateDesktop
	 */
	struct UUI_Currency_Bar_C_SetStateDesktop_Params
	{
	public:
		E_Type_State_Desktop                                       StateDesktopDiamond;                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		E_Type_State_Desktop                                       StateDesktopVip;                                         // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.PreConstruct
	 */
	struct UUI_Currency_Bar_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.ExecuteUbergraph_UI_Currency_Bar
	 */
	struct UUI_Currency_Bar_C_ExecuteUbergraph_UI_Currency_Bar_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
