#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_9A6B4BE94F44D01EA93D5DA4624713A7
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_9A6B4BE94F44D01EA93D5DA4624713A7_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_B328F02F4D38A5B647A2E39787D6B7FF
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_B328F02F4D38A5B647A2E39787D6B7FF_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_9410E4A247228C5C49827BBCB14E2F8E
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_9410E4A247228C5C49827BBCB14E2F8E_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_FA9C8D9547DBE6A88F9B008052A3A8F2
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_FA9C8D9547DBE6A88F9B008052A3A8F2_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_CB75551744375AA1F10E42BA80552C2D
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_CB75551744375AA1F10E42BA80552C2D_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_563BDE8042B07315554FDFBACB5B34C0
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_563BDE8042B07315554FDFBACB5B34C0_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_58DD3A144447CA56A8D3D0BB3C0E96B3
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_58DD3A144447CA56A8D3D0BB3C0E96B3_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_241856C14251641959B442A242BB16DF
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_241856C14251641959B442A242BB16DF_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_FFF6BFC44164C7E9BB54E29BEA41BB00
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_FFF6BFC44164C7E9BB54E29BEA41BB00_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_EB8E49B04D2E1BCA16F4A7B14DC06E0E
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_EB8E49B04D2E1BCA16F4A7B14DC06E0E_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_7A5354184CB86F39B9BB22A8BB302BB6
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_7A5354184CB86F39B9BB22A8BB302BB6_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_7D33A1964244100AB7A8EE839CB9DF57
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_7D33A1964244100AB7A8EE839CB9DF57_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_545873B847E43044ECC1EF82C9DE4D19
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_545873B847E43044ECC1EF82C9DE4D19_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_1A195F374F5A412A3B09D8923CE756E8
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_1A195F374F5A412A3B09D8923CE756E8_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_E302B92447022AA409C54C923E7C6D2B
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_E302B92447022AA409C54C923E7C6D2B_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_2CB75A24451DA86183EEF890EC617A37
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_2CB75A24451DA86183EEF890EC617A37_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_16615A6C46179D8D081BA3B4BD6CBCAF
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_16615A6C46179D8D081BA3B4BD6CBCAF_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_7FC40CD94BF5573EA8FE1EAFB3A6984E
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_7FC40CD94BF5573EA8FE1EAFB3A6984E_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_8FD5EC384AA352EBFEBA4CAD76C5B7D3
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_8FD5EC384AA352EBFEBA4CAD76C5B7D3_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_4F392349457ACE3D7EDDA1A1C082FD9F
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_4F392349457ACE3D7EDDA1A1C082FD9F_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_289C7E364397D7F650914CAC981898A9
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_289C7E364397D7F650914CAC981898A9_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_C112F03F427767A2788DA1A0FE605606
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_C112F03F427767A2788DA1A0FE605606_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_DF420A9E4B45097267D13D98A919C953
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_DF420A9E4B45097267D13D98A919C953_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_9DC424E34EF40B9FAD27AB858826B030
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_9DC424E34EF40B9FAD27AB858826B030_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_BB87C8CB47862B834D7D7EA7A1BAE46E
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_BB87C8CB47862B834D7D7EA7A1BAE46E_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_1F1F21924CE0158CCCB2CAB6A8254E87
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_1F1F21924CE0158CCCB2CAB6A8254E87_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_97D911D0485E145BC64B9297E882FA94
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_97D911D0485E145BC64B9297E882FA94_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_0DCE3F114B791D029F41D49DB6BAC76F
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_0DCE3F114B791D029F41D49DB6BAC76F_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_D40A14D2430221C01DBFD0A0878F1F7B
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_D40A14D2430221C01DBFD0A0878F1F7B_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_2724956F48653905D41603B52BECEC30
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_2724956F48653905D41603B52BECEC30_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_D447F5A24B62D71D46994289C5598458
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_D447F5A24B62D71D46994289C5598458_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_798D852A424B61AC82077FB7944401B5
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_798D852A424B61AC82077FB7944401B5_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_22ADF35D4CF0A42E85F380BB2A2BA19A
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_22ADF35D4CF0A42E85F380BB2A2BA19A_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_C7C4F4504CB52C9FBCF1958FA053BB6F
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_C7C4F4504CB52C9FBCF1958FA053BB6F_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_45AFCA9240BC296EB19AAF8E680F27FA
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_45AFCA9240BC296EB19AAF8E680F27FA_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_0AB0C0C542F59F00C7976FAB557AD0EA
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_0AB0C0C542F59F00C7976FAB557AD0EA_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_D8E380FA4A27DCAAFE9644946A3A1ABC
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_D8E380FA4A27DCAAFE9644946A3A1ABC_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_F61DE4D8430D6B944A602A88E4CED181
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_F61DE4D8430D6B944A602A88E4CED181_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_53DDDC2D4B20E99735FB509238BD592C
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_53DDDC2D4B20E99735FB509238BD592C_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_AE6E0CB44CBB8D36A0948188849F30ED
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_AE6E0CB44CBB8D36A0948188849F30ED_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_8337630244C3BEA704B5EA8CE4DD9129
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_8337630244C3BEA704B5EA8CE4DD9129_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_988C1CD949B02F0868DF0D83010774F8
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_988C1CD949B02F0868DF0D83010774F8_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_B317BE5944263C460C0713AEA3FC4726
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_B317BE5944263C460C0713AEA3FC4726_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_4D31E5324F7DFEADA5553C91904E937C
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_4D31E5324F7DFEADA5553C91904E937C_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_74E7477D42BB3BDD62EB3FA41E4A3D5A
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_74E7477D42BB3BDD62EB3FA41E4A3D5A_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_3F8524AE42F6FB96D4512E9C4EF86DF3
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_3F8524AE42F6FB96D4512E9C4EF86DF3_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_E14485434CEE8D481629E3B7C581F139
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_E14485434CEE8D481629E3B7C581F139_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_591CA196437EA24DD8822C9F76BA9579
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_591CA196437EA24DD8822C9F76BA9579_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_7A43709E40803CA915CD1FA136279C39
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_7A43709E40803CA915CD1FA136279C39_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_5CE1700C4E4283E01F1A0C946A08F351
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_5CE1700C4E4283E01F1A0C946A08F351_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_3337739D44A0FDCFB13358961C192BAE
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_3337739D44A0FDCFB13358961C192BAE_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_46751CA94728720ADC1B39AE583C13DE
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_46751CA94728720ADC1B39AE583C13DE_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_1B446CBA4389FADF8004B2B31EFE7836
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_1B446CBA4389FADF8004B2B31EFE7836_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_3D1527334FA05CDF1DE7078F10D8469D
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_3D1527334FA05CDF1DE7078F10D8469D_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_06EB5AB9464B617A78FDB8AFB0F31419
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_06EB5AB9464B617A78FDB8AFB0F31419_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_312F9DDE49154D799B94BC9024181B3A
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_312F9DDE49154D799B94BC9024181B3A_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_0CAC9195468EACDEA9C86B9280903567
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_0CAC9195468EACDEA9C86B9280903567_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_41FF20FE43BB2F86469F7C9E84E59E6E
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_41FF20FE43BB2F86469F7C9E84E59E6E_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_F4BEEA8D43E2BDF07229C7B867684386
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_F4BEEA8D43E2BDF07229C7B867684386_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_0AD2890D408D00890C470E929C29D23F
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_0AD2890D408D00890C470E929C29D23F_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_2EDC41D14187E999487EC39FBBCC3F3F
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_2EDC41D14187E999487EC39FBBCC3F3F_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_C17C4DEC488CFEBBEE16EB9FD5D0E60D
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_C17C4DEC488CFEBBEE16EB9FD5D0E60D_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_676A50E34720596B53628FAC58034798
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_676A50E34720596B53628FAC58034798_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_820A811B4FC9EDAA8CF6D2A481A43B59
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_820A811B4FC9EDAA8CF6D2A481A43B59_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_FAF71C534CC1ADA36CE4CF9823238C14
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_FAF71C534CC1ADA36CE4CF9823238C14_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_279D3E3C4FC4AF5BCF0B968DC376B0E3
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_279D3E3C4FC4AF5BCF0B968DC376B0E3_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_223707904685E5F80F2C0994906F5C93
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_223707904685E5F80F2C0994906F5C93_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_1C612CDA4E0BF6FA9252FFBEEFD46687
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_1C612CDA4E0BF6FA9252FFBEEFD46687_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_254C5AF843053A5F936D69BE046EEB23
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_254C5AF843053A5F936D69BE046EEB23_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_C06C367E40D46F2972785D8B3B0E82C9
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_C06C367E40D46F2972785D8B3B0E82C9_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_28ED924E417D8BCC11EB03A1BF125CD4
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_28ED924E417D8BCC11EB03A1BF125CD4_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_BCA4D0E945C13C8143E7439857AA7097
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_BCA4D0E945C13C8143E7439857AA7097_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_4FD7288641A9573A2975058B941AD815
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_4FD7288641A9573A2975058B941AD815_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_BFEDB1734A016E3842C529B0CF8BB2A4
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_BFEDB1734A016E3842C529B0CF8BB2A4_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_017109A14906765B631320A4E22DE20A
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_017109A14906765B631320A4E22DE20A_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_A1D9A7694044E5592C57DAADABA5B218
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_A1D9A7694044E5592C57DAADABA5B218_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_F9537E3F4181C5AD0AF1B483608DD3A6
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_F9537E3F4181C5AD0AF1B483608DD3A6_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_593FB78648DC2DE6E780FE9A6B49881B
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_593FB78648DC2DE6E780FE9A6B49881B_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_F6B9FA9341DCFA2003C555A7B44B7B26
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_F6B9FA9341DCFA2003C555A7B44B7B26_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_9B02F0AC4D63F3B2C154758DD091BEC9
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_9B02F0AC4D63F3B2C154758DD091BEC9_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_0D03C270454AE681EAC77592541F7E6D
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_0D03C270454AE681EAC77592541F7E6D_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_DDAB824948585873B7A2B8A31A2EB49C
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_DDAB824948585873B7A2B8A31A2EB49C_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_05B81C5A4226DACCC82016A2BE10BE6F
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_05B81C5A4226DACCC82016A2BE10BE6F_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_8CEA3BDE430E680C0C7483B966C56D43
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_8CEA3BDE430E680C0C7483B966C56D43_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_64B70EBD4746DE3F6359608450F2FF1B
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_64B70EBD4746DE3F6359608450F2FF1B_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_3B3D975F46B17B8771B4A2934A09D0AD
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_3B3D975F46B17B8771B4A2934A09D0AD_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_E0C344544C006D1128A7A4BFEEBCE362
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_E0C344544C006D1128A7A4BFEEBCE362_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_3CFBD2724417EEDE2E075584BDAB2861
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_3CFBD2724417EEDE2E075584BDAB2861_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_9937F37F4329B47327011E953C01724D
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_9937F37F4329B47327011E953C01724D_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_1A298E7843861DED8606D6BB48CCD029
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_1A298E7843861DED8606D6BB48CCD029_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_6DEB32664EE0B923ACFCCF9D0FFF1EE7
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_6DEB32664EE0B923ACFCCF9D0FFF1EE7_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_6C8C27DA4DD48D3018A14F8A8E414FAA
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_6C8C27DA4DD48D3018A14F8A8E414FAA_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_70CDA4944D9D93006021A299AA4CE414
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_70CDA4944D9D93006021A299AA4CE414_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_DEAB9B2E4CA9071B85A7D09A46BD5392
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_DEAB9B2E4CA9071B85A7D09A46BD5392_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_436FF5DF40BCAB05F597F780E83674B7
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_436FF5DF40BCAB05F597F780E83674B7_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_30D2ACF74CD45F1C5FEFE0BB0C9139EB
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_30D2ACF74CD45F1C5FEFE0BB0C9139EB_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_C1498FDC46254BA9168E38B955AB7E3A
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_C1498FDC46254BA9168E38B955AB7E3A_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_B85BF14F46EAB6E434543BBAF589A771
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_B85BF14F46EAB6E434543BBAF589A771_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_C8D6CD194D94321BDF5E12ACF5871B49
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_C8D6CD194D94321BDF5E12ACF5871B49_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_A4DDCA8840C160DB196700B4F8FD232B
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_A4DDCA8840C160DB196700B4F8FD232B_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_85244A4E46C6145BDD5B1995EBBBE28D
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_85244A4E46C6145BDD5B1995EBBBE28D_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_5BAC156843C2214860E4019B36C324D1
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_5BAC156843C2214860E4019B36C324D1_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_48C9CC2E400F4D4987247DBD5050F2D0
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_48C9CC2E400F4D4987247DBD5050F2D0_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_C7DE17714F2192BC5E033D820749A090
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_C7DE17714F2192BC5E033D820749A090_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_77B720824715EB87A2AC64922ED3D153
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_77B720824715EB87A2AC64922ED3D153_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_FAD1E69644C241FA67CEF18243D87A17
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_FAD1E69644C241FA67CEF18243D87A17_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_CAA66F294462F5B97247078B1564B4FF
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_CAA66F294462F5B97247078B1564B4FF_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_3F80BAA04F6E9B1B8E1116BCA2B8A3F3
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_3F80BAA04F6E9B1B8E1116BCA2B8A3F3_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_3E3B44ED4D8CAB332A38498C2A93CA25
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_3E3B44ED4D8CAB332A38498C2A93CA25_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_5CA9E2234D73F9B5D380B9BA2CA0568B
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_5CA9E2234D73F9B5D380B9BA2CA0568B_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_763D2DDD4D0A306298EA98B394898017
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_763D2DDD4D0A306298EA98B394898017_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_D66A68F94BB6D2BF8E50BBAC08E19FD1
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_D66A68F94BB6D2BF8E50BBAC08E19FD1_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_24D3BCF2457AA3C228EB4DA0CF9A8F73
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_24D3BCF2457AA3C228EB4DA0CF9A8F73_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_A533369F40F9149F89C38B94EF87B16D
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_A533369F40F9149F89C38B94EF87B16D_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnOptionCheckStateChanged_6F8CC7484992FACCBBCDA6B5D77C4DFC
	 */
	struct UUI_Component_Option_C_OnOptionCheckStateChanged_6F8CC7484992FACCBBCDA6B5D77C4DFC_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnInitialized
	 */
	struct UUI_Component_Option_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnListItemObjectSetCopy
	 */
	struct UUI_Component_Option_C_OnListItemObjectSetCopy_Params
	{
	public:
		class UObject*                                             ListItemObject;                                          // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.GetModuleName
	 */
	struct UUI_Component_Option_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.SetTextID
	 */
	struct UUI_Component_Option_C_SetTextID_Params
	{
	public:
		int32_t                                                    LocTextID;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.SetText
	 */
	struct UUI_Component_Option_C_SetText_Params
	{
	public:
		class FString                                              NewParam;                                                // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.SetEnabled
	 */
	struct UUI_Component_Option_C_SetEnabled_Params
	{
	public:
		bool                                                       Enabled;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.SetOptionType
	 */
	struct UUI_Component_Option_C_SetOptionType_Params
	{
	public:
		int32_t                                                    OptionType;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.ManualOptionSetIsChecked
	 */
	struct UUI_Component_Option_C_ManualOptionSetIsChecked_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.BP_OnEntryReleased
	 */
	struct UUI_Component_Option_C_BP_OnEntryReleased_Params
	{	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.BP_OnItemExpansionChanged
	 */
	struct UUI_Component_Option_C_BP_OnItemExpansionChanged_Params
	{
	public:
		bool                                                       bIsExpanded;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.BP_OnItemSelectionChanged
	 */
	struct UUI_Component_Option_C_BP_OnItemSelectionChanged_Params
	{
	public:
		bool                                                       bIsSelected;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnListItemObjectSet
	 */
	struct UUI_Component_Option_C_OnListItemObjectSet_Params
	{
	public:
		class UObject*                                             ListItemObject;                                          // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.PreConstruct
	 */
	struct UUI_Component_Option_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.BndEvt__SolarCheckBox_Option_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
	 */
	struct UUI_Component_Option_C_BndEvt__SolarCheckBox_Option_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.OnSelected
	 */
	struct UUI_Component_Option_C_OnSelected_Params
	{
	public:
		bool                                                       bSelected;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.SetDisbaled
	 */
	struct UUI_Component_Option_C_SetDisbaled_Params
	{
	public:
		bool                                                       Disabled;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.RefreshOptionTxtUI
	 */
	struct UUI_Component_Option_C_RefreshOptionTxtUI_Params
	{	};

	/**
	 * Function UI_Component_Option.UI_Component_Option_C.ExecuteUbergraph_UI_Component_Option
	 */
