#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnValueChanged_46EC07A048C508BDA50723989F513ECD
	 */
	struct UUI_Component_Slider_C_OnValueChanged_46EC07A048C508BDA50723989F513ECD_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_4581E77F444E59C46212D4B044AB0775
	 */
	struct UUI_Component_Slider_C_OnClicked_4581E77F444E59C46212D4B044AB0775_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_F303ADD54EA2116D13C199926C7E4221
	 */
	struct UUI_Component_Slider_C_OnClicked_F303ADD54EA2116D13C199926C7E4221_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_7082D3B7429F3A0D25444695B106240C
	 */
	struct UUI_Component_Slider_C_OnClicked_7082D3B7429F3A0D25444695B106240C_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_F12A398B4E7B3FCC5B81498B30B0EF9E
	 */
	struct UUI_Component_Slider_C_OnClicked_F12A398B4E7B3FCC5B81498B30B0EF9E_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnValueChanged_ED8F60BD47E45F40238E47A2FD20494B
	 */
	struct UUI_Component_Slider_C_OnValueChanged_ED8F60BD47E45F40238E47A2FD20494B_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_D4201935475E85B728EC0D8BDB37081F
	 */
	struct UUI_Component_Slider_C_OnClicked_D4201935475E85B728EC0D8BDB37081F_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_D955AA2C4F18DCC35FBBF7B631787AFE
	 */
	struct UUI_Component_Slider_C_OnClicked_D955AA2C4F18DCC35FBBF7B631787AFE_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_F24A0149401ED22C1DE599AA8F133AA1
	 */
	struct UUI_Component_Slider_C_OnClicked_F24A0149401ED22C1DE599AA8F133AA1_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_A1224F4244C698726DAB569395D07141
	 */
	struct UUI_Component_Slider_C_OnClicked_A1224F4244C698726DAB569395D07141_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnValueChanged_99C11D344F66C6B0908AEDA35EB8CF84
	 */
	struct UUI_Component_Slider_C_OnValueChanged_99C11D344F66C6B0908AEDA35EB8CF84_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_58C72EC344D160438E66F2B2126FA46A
	 */
	struct UUI_Component_Slider_C_OnClicked_58C72EC344D160438E66F2B2126FA46A_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_55981774465774D02F7155919E947C42
	 */
	struct UUI_Component_Slider_C_OnClicked_55981774465774D02F7155919E947C42_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_3386FF144C9D8145FC8CC5BF5BA22EB5
	 */
	struct UUI_Component_Slider_C_OnClicked_3386FF144C9D8145FC8CC5BF5BA22EB5_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_30DCA3B445EF8B4A88190D8ACA4DACFA
	 */
	struct UUI_Component_Slider_C_OnClicked_30DCA3B445EF8B4A88190D8ACA4DACFA_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnValueChanged_7668AE4944FB733595F69884E51E925A
	 */
	struct UUI_Component_Slider_C_OnValueChanged_7668AE4944FB733595F69884E51E925A_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_3FBEFDFD434FE0146B74FAB600EB4BE5
	 */
	struct UUI_Component_Slider_C_OnClicked_3FBEFDFD434FE0146B74FAB600EB4BE5_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_6F5F6407423A22046233A9A3B636061C
	 */
	struct UUI_Component_Slider_C_OnClicked_6F5F6407423A22046233A9A3B636061C_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_E6C8853646AEB37B69B3A9B69523B5F8
	 */
	struct UUI_Component_Slider_C_OnClicked_E6C8853646AEB37B69B3A9B69523B5F8_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_B5158C494D580B04C3D83F880BDD9781
	 */
	struct UUI_Component_Slider_C_OnClicked_B5158C494D580B04C3D83F880BDD9781_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnValueChanged_565CF23B40FFB2CFB88C668F3BC8BB8D
	 */
	struct UUI_Component_Slider_C_OnValueChanged_565CF23B40FFB2CFB88C668F3BC8BB8D_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_B0C02A0840A75A949FECA88DB6322EDE
	 */
	struct UUI_Component_Slider_C_OnClicked_B0C02A0840A75A949FECA88DB6322EDE_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_D3D0B1334A100EB28309BC937106284B
	 */
	struct UUI_Component_Slider_C_OnClicked_D3D0B1334A100EB28309BC937106284B_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_A2B663C84E85E28ECAC069900DB55203
	 */
	struct UUI_Component_Slider_C_OnClicked_A2B663C84E85E28ECAC069900DB55203_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_AA481A8D4714BD25ADCFC78523054BBC
	 */
	struct UUI_Component_Slider_C_OnClicked_AA481A8D4714BD25ADCFC78523054BBC_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnValueChanged_A18BD8BD43E0C4251FD4DCA72FCAFA19
	 */
	struct UUI_Component_Slider_C_OnValueChanged_A18BD8BD43E0C4251FD4DCA72FCAFA19_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_3DDDC11B4367F3BF21E2C6A21AF5312B
	 */
	struct UUI_Component_Slider_C_OnClicked_3DDDC11B4367F3BF21E2C6A21AF5312B_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_71D49EEC4DFD212783606D8283EA6EF2
	 */
	struct UUI_Component_Slider_C_OnClicked_71D49EEC4DFD212783606D8283EA6EF2_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_FC35435847A64486FED92ABB2680D3E9
	 */
	struct UUI_Component_Slider_C_OnClicked_FC35435847A64486FED92ABB2680D3E9_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_65FF18C84394FA71DF6E94BB38A85DF4
	 */
	struct UUI_Component_Slider_C_OnClicked_65FF18C84394FA71DF6E94BB38A85DF4_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnValueChanged_DA10EC74497F33DBA716C38293CAE3C0
	 */
	struct UUI_Component_Slider_C_OnValueChanged_DA10EC74497F33DBA716C38293CAE3C0_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_DB3DCD394C092940701370AA0185E977
	 */
	struct UUI_Component_Slider_C_OnClicked_DB3DCD394C092940701370AA0185E977_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_645E7C1B4C3C06EF4C15DE9DC50DBF77
	 */
	struct UUI_Component_Slider_C_OnClicked_645E7C1B4C3C06EF4C15DE9DC50DBF77_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_EC34F5AD48E0AB33CA03FC963D730ED9
	 */
	struct UUI_Component_Slider_C_OnClicked_EC34F5AD48E0AB33CA03FC963D730ED9_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_4228790E4AE33AC14F6912B0EF8DD3E6
	 */
	struct UUI_Component_Slider_C_OnClicked_4228790E4AE33AC14F6912B0EF8DD3E6_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnValueChanged_5425448D4B2A767AF92F34A10D4A5898
	 */
	struct UUI_Component_Slider_C_OnValueChanged_5425448D4B2A767AF92F34A10D4A5898_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_2EA995ED43370B41FF5250A4339C46FD
	 */
	struct UUI_Component_Slider_C_OnClicked_2EA995ED43370B41FF5250A4339C46FD_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_FC70BB7341D0501A741C738A5F64C868
	 */
	struct UUI_Component_Slider_C_OnClicked_FC70BB7341D0501A741C738A5F64C868_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_D5D00F9E47A2ECB6C5EFDD9AE658CB9C
	 */
	struct UUI_Component_Slider_C_OnClicked_D5D00F9E47A2ECB6C5EFDD9AE658CB9C_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_12CF846D472B5F2BD7D85B942D094948
	 */
	struct UUI_Component_Slider_C_OnClicked_12CF846D472B5F2BD7D85B942D094948_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnValueChanged_899F293743279BBC8BD11988E4D28CD7
	 */
	struct UUI_Component_Slider_C_OnValueChanged_899F293743279BBC8BD11988E4D28CD7_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_CFB64EF844CD37F19CC005B97AD6F5F4
	 */
	struct UUI_Component_Slider_C_OnClicked_CFB64EF844CD37F19CC005B97AD6F5F4_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_20FF6B2E422D0C31A67A109AA55CB583
	 */
	struct UUI_Component_Slider_C_OnClicked_20FF6B2E422D0C31A67A109AA55CB583_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_51646745492111369CB37C84E09D0DF3
	 */
	struct UUI_Component_Slider_C_OnClicked_51646745492111369CB37C84E09D0DF3_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Slider.UI_Component_Slider_C.OnClicked_86770DAC47A4C7F2532334AF9E13CEC6
	 */
	struct UUI_Component_Slider_C_OnClicked_86770DAC47A4C7F2532334AF9E13CEC6_Params
	{	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.ConstructCopy
	 */
	struct UUI_Component_Slider_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.GetModuleName
	 */
	struct UUI_Component_Slider_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.SetDisabled
	 */
	struct UUI_Component_Slider_C_SetDisabled_Params
	{
	public:
		bool                                                       NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.Get_ProgressBar_Percent_1
	 */
	struct UUI_Component_Slider_C_Get_ProgressBar_Percent_1_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.SetOnlySlider
	 */
	struct UUI_Component_Slider_C_SetOnlySlider_Params
	{	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.SetTitleIsChecked
	 */
	struct UUI_Component_Slider_C_SetTitleIsChecked_Params
	{
	public:
		bool                                                       IsChecked;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.PreConstruct
	 */
	struct UUI_Component_Slider_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.Construct
	 */
	struct UUI_Component_Slider_C_Construct_Params
	{	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
	 */
	struct UUI_Component_Slider_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.BndEvt__CheckBox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
	 */
	struct UUI_Component_Slider_C_BndEvt__CheckBox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.BP_RefreshSliderUI
	 */
	struct UUI_Component_Slider_C_BP_RefreshSliderUI_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.BndEvt__Btn_Add_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUI_Component_Slider_C_BndEvt__Btn_Add_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.BndEvt__Btn_Max_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUI_Component_Slider_C_BndEvt__Btn_Max_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.BndEvt__Btn_Min_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUI_Component_Slider_C_BndEvt__Btn_Min_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.BndEvt__Btn_Minus_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUI_Component_Slider_C_BndEvt__Btn_Minus_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.OnLocalLangChangedEx
	 */
	struct UUI_Component_Slider_C_OnLocalLangChangedEx_Params
	{
	public:
		class FString                                              InLang;                                                  // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.ExecuteUbergraph_UI_Component_Slider
	 */
	struct UUI_Component_Slider_C_ExecuteUbergraph_UI_Component_Slider_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_OTJL[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_Slider.UI_Component_Slider_C.OnTitleCheckStateChanged__DelegateSignature
	 */
	struct UUI_Component_Slider_C_OnTitleCheckStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       IsChecked;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
