#pragma once

/**
 * Name: FL84
 * Version: 1.15.1.6
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Component_Friend.UI_Component_Friend_C.OnClicked_B2C0BD254FAF62D9AAAAF194FFFC469F
	 */
	struct UUI_Component_Friend_C_OnClicked_B2C0BD254FAF62D9AAAAF194FFFC469F_Params
	{	};

	/**
	 * DelegateFunction UI_Component_Friend.UI_Component_Friend_C.OnClicked_D9145C3F4B854E5AAFB6368BA7F9A8C8
	 */
	struct UUI_Component_Friend_C_OnClicked_D9145C3F4B854E5AAFB6368BA7F9A8C8_Params
	{	};

	/**
	 * Function UI_Component_Friend.UI_Component_Friend_C.Construct
	 */
	struct UUI_Component_Friend_C_Construct_Params
	{	};

	/**
	 * Function UI_Component_Friend.UI_Component_Friend_C.OnInitialized
	 */
	struct UUI_Component_Friend_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Component_Friend.UI_Component_Friend_C.InitWidgetCopy
	 */
	struct UUI_Component_Friend_C_InitWidgetCopy_Params
	{
	public:
		class FString                                              InPlayerID;                                              // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		bool                                                       InIsBotAI;                                               // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Friend.UI_Component_Friend_C.Destruct
	 */
	struct UUI_Component_Friend_C_Destruct_Params
	{	};

	/**
	 * Function UI_Component_Friend.UI_Component_Friend_C.GetModuleName
	 */
	struct UUI_Component_Friend_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_Friend.UI_Component_Friend_C.InitWidget
	 */
	struct UUI_Component_Friend_C_InitWidget_Params
	{
	public:
		class FString                                              InPlayerID;                                              // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		bool                                                       InIsBotAI;                                               // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Friend.UI_Component_Friend_C.SetTypeFriend
	 */
	struct UUI_Component_Friend_C_SetTypeFriend_Params
	{	};

	/**
	 * Function UI_Component_Friend.UI_Component_Friend_C.PreConstruct
	 */
	struct UUI_Component_Friend_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_Friend.UI_Component_Friend_C.ExecuteUbergraph_UI_Component_Friend
	 */
	struct UUI_Component_Friend_C_ExecuteUbergraph_UI_Component_Friend_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
