#pragma once

/**
 * Name: FL84
 * Version: 1.15.1.6
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_1995FCE24DB86075CFE03E8BF59E135E
	 */
	struct UUI_Currency_Bar_C_OnClicked_1995FCE24DB86075CFE03E8BF59E135E_Params
	{	};

	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_1213894448A672B09A411FBEF5C124F9
	 */
	struct UUI_Currency_Bar_C_OnClicked_1213894448A672B09A411FBEF5C124F9_Params
	{	};

	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_0BB85F7D46852D3CBF9C05BC39C99B32
	 */
	struct UUI_Currency_Bar_C_OnClicked_0BB85F7D46852D3CBF9C05BC39C99B32_Params
	{	};

	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_4214716E40832847915E3199654DED87
	 */
	struct UUI_Currency_Bar_C_OnClicked_4214716E40832847915E3199654DED87_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.OnSolarUIOpened
	 */
	struct UUI_Currency_Bar_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.OnSolarUIClosed
	 */
	struct UUI_Currency_Bar_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.Construct
	 */
	struct UUI_Currency_Bar_C_Construct_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.GetModuleName
	 */
	struct UUI_Currency_Bar_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.SetStateDesktop
	 */
	struct UUI_Currency_Bar_C_SetStateDesktop_Params
	{
	public:
		E_Type_State_Desktop                                       StateDesktopDiamond;                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		E_Type_State_Desktop                                       StateDesktopVip;                                         // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.PreConstruct
	 */
	struct UUI_Currency_Bar_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.ExecuteUbergraph_UI_Currency_Bar
	 */
	struct UUI_Currency_Bar_C_ExecuteUbergraph_UI_Currency_Bar_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
