#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_40384EEC489D7C38A70421A02EF7485A
	 */
	struct UUI_Currency_Bar_C_OnClicked_40384EEC489D7C38A70421A02EF7485A_Params
	{	};

	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_7785F5FB404C65C44C96349788254218
	 */
	struct UUI_Currency_Bar_C_OnClicked_7785F5FB404C65C44C96349788254218_Params
	{	};

	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_85F263354BF9D978B59A098245067120
	 */
	struct UUI_Currency_Bar_C_OnClicked_85F263354BF9D978B59A098245067120_Params
	{	};

	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_B9A0E05E4EABB4BDD5286D8EA263E4CB
	 */
	struct UUI_Currency_Bar_C_OnClicked_B9A0E05E4EABB4BDD5286D8EA263E4CB_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.OnSolarUIOpened
	 */
	struct UUI_Currency_Bar_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.OnSolarUIClosed
	 */
	struct UUI_Currency_Bar_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.Construct
	 */
	struct UUI_Currency_Bar_C_Construct_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.GetModuleName
	 */
	struct UUI_Currency_Bar_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.SetStateDesktop
	 */
	struct UUI_Currency_Bar_C_SetStateDesktop_Params
	{
	public:
		E_Type_State_Desktop                                       StateDesktopDiamond;                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		E_Type_State_Desktop                                       StateDesktopVip;                                         // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.PreConstruct
	 */
	struct UUI_Currency_Bar_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.ExecuteUbergraph_UI_Currency_Bar
	 */
	struct UUI_Currency_Bar_C_ExecuteUbergraph_UI_Currency_Bar_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
