#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_C952552C4D37C670846E6A8AEE428B09
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_C952552C4D37C670846E6A8AEE428B09_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_527D1B154D24F140D9DA5785D97F801B
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_527D1B154D24F140D9DA5785D97F801B_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_C34F19C843592691A9AE85BDEF5CF009
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_C34F19C843592691A9AE85BDEF5CF009_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_88E313C7445ECB66ED358FBA347D09C1
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_88E313C7445ECB66ED358FBA347D09C1_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_462E60E44124DC1B194B12AFA823DBFC
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_462E60E44124DC1B194B12AFA823DBFC_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_8F76342A494D0012470F84BC01782DE4
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_8F76342A494D0012470F84BC01782DE4_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_D8FF15AE437875053C3111B749A1E24F
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_D8FF15AE437875053C3111B749A1E24F_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_F180CD7F49E520599C663490F0AB82EC
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_F180CD7F49E520599C663490F0AB82EC_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_9278A4614991FF1CAF36258931CD4109
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_9278A4614991FF1CAF36258931CD4109_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_2A2E6377423153BB1FB709A74F65DCDF
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_2A2E6377423153BB1FB709A74F65DCDF_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_1F70369A43AD62A4D8535296BA424D52
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_1F70369A43AD62A4D8535296BA424D52_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_EFA58478436F16F121BBB38BF9D63802
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_EFA58478436F16F121BBB38BF9D63802_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_8C9C7E5A43CDEA9D66F9FF8A9AFD2F1E
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_8C9C7E5A43CDEA9D66F9FF8A9AFD2F1E_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_BA328C0346FD9D96348B73B490B78F63
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_BA328C0346FD9D96348B73B490B78F63_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_BEC9C8EE4BA412DEA06E56A21BDE7C17
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_BEC9C8EE4BA412DEA06E56A21BDE7C17_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_09C5CDEA4F7D292ACEE5B8A850DA9C77
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_09C5CDEA4F7D292ACEE5B8A850DA9C77_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_3FC88FD649EFA95ECA8493B5CBA18C5D
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_3FC88FD649EFA95ECA8493B5CBA18C5D_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_2A0EEE704DF99E44D61D85A3CBF79F7F
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_2A0EEE704DF99E44D61D85A3CBF79F7F_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_D6384FD74168AA6839A411905C974947
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_D6384FD74168AA6839A411905C974947_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_60BE132D44E33B4FEE859D8AB5B54693
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_60BE132D44E33B4FEE859D8AB5B54693_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_900DE5AE41E8B62E7ADC5C86017E55E6
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_900DE5AE41E8B62E7ADC5C86017E55E6_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_68D77842466635BEDA072EAD42F0FB59
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_68D77842466635BEDA072EAD42F0FB59_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_7CE7F961471903363450A2A8902F893C
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_7CE7F961471903363450A2A8902F893C_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_20BCA2364D03C43CD9EEBA9BAF07483A
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_20BCA2364D03C43CD9EEBA9BAF07483A_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.RefreshByPSCopy
	 */
	struct UUI_Component_PlayerHead_C_RefreshByPSCopy_Params
	{
	public:
		class ASolarPlayerState*                                   ps;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bWithoutGender;                                          // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ForceShowFrameCopy
	 */
	struct UUI_Component_PlayerHead_C_ForceShowFrameCopy_Params
	{
	public:
		int32_t                                                    FrameID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetVipTypeCopy
	 */
	struct UUI_Component_PlayerHead_C_SetVipTypeCopy_Params
	{
	public:
		unsigned char                                              VipType;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_GB4N[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnSolarUIClosed
	 */
	struct UUI_Component_PlayerHead_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnInitialized
	 */
	struct UUI_Component_PlayerHead_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.Destruct
	 */
	struct UUI_Component_PlayerHead_C_Destruct_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ConstructCopy
	 */
	struct UUI_Component_PlayerHead_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarCopy
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarCopy_Params
	{
	public:
		int32_t                                                    AvatarID;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_O2C0[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              AvatarUrl;                                               // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnSolarUIOpened
	 */
	struct UUI_Component_PlayerHead_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.GetModuleName
	 */
	struct UUI_Component_PlayerHead_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ForceShowFrame
	 */
	struct UUI_Component_PlayerHead_C_ForceShowFrame_Params
	{
	public:
		int32_t                                                    FrameID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.RefreshByPS
	 */
	struct UUI_Component_PlayerHead_C_RefreshByPS_Params
	{
	public:
		class ASolarPlayerState*                                   ps;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bWithoutGender;                                          // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarSize
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarSize_Params
	{
	public:
		bool                                                       IsCustom;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatar
	 */
	struct UUI_Component_PlayerHead_C_SetAvatar_Params
	{
	public:
		int32_t                                                    AvatarID;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_8EY0[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              AvatarUrl;                                               // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetStateHD
	 */
	struct UUI_Component_PlayerHead_C_SetStateHD_Params
	{
	public:
		E_TabLobbyItemState                                        StateHD;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetDefaultSteamAvatar
	 */
	struct UUI_Component_PlayerHead_C_SetDefaultSteamAvatar_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetVipType
	 */
	struct UUI_Component_PlayerHead_C_SetVipType_Params
	{
	public:
		unsigned char                                              VipType;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_OASH[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnTouchMoved
	 */
	struct UUI_Component_PlayerHead_C_OnTouchMoved_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		struct FPointerEvent                                       InTouchEvent;                                            // 0x0038(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarState
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarState_Params
	{
	public:
		bool                                                       IsCollapsed;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarIcon
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarIcon_Params
	{
	public:
		int32_t                                                    InAvatarID;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_O900[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetEmptyState
	 */
	struct UUI_Component_PlayerHead_C_SetEmptyState_Params
	{
	public:
		bool                                                       IsEmpty;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetPlayerGender
	 */
	struct UUI_Component_PlayerHead_C_SetPlayerGender_Params
	{
	public:
		E_Type_Gender                                              Gender;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetSocialIcon
	 */
	struct UUI_Component_PlayerHead_C_SetSocialIcon_Params
	{
	public:
		E_Type_Social                                              Social;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.Update
	 */
	struct UUI_Component_PlayerHead_C_Update_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.PreConstruct
	 */
	struct UUI_Component_PlayerHead_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.Construct
	 */
	struct UUI_Component_PlayerHead_C_Construct_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ExecuteUbergraph_UI_Component_PlayerHead
	 */
	struct UUI_Component_PlayerHead_C_ExecuteUbergraph_UI_Component_PlayerHead_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnReleased__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_OnReleased__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_OnClicked__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
