#pragma once

/**
 * Name: FL84
 * Version: 1.15.1.6
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_702130DA4684381AA4E6998480BBD7D7
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_702130DA4684381AA4E6998480BBD7D7_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_C39A39B440985C87411E2596C33BA36F
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_C39A39B440985C87411E2596C33BA36F_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_23C53E1D4EA49DC9A79E278F62F900BE
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_23C53E1D4EA49DC9A79E278F62F900BE_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_89473C7043396430FD079CA24F768C2C
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_89473C7043396430FD079CA24F768C2C_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_096FEA9745DE64C71B2C2E98FF8595A2
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_096FEA9745DE64C71B2C2E98FF8595A2_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_2015CCF64D958974C844B2B8DCB9342D
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_2015CCF64D958974C844B2B8DCB9342D_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_390119F64DCADC441A7103B3B7D9C77F
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_390119F64DCADC441A7103B3B7D9C77F_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_E78CFA4045B945149D7853A98E5A2007
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_E78CFA4045B945149D7853A98E5A2007_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_CC8E505F4C832B8E84AABDB6C9F0811D
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_CC8E505F4C832B8E84AABDB6C9F0811D_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_25986DD444DD858297D0A6A2475AA22B
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_25986DD444DD858297D0A6A2475AA22B_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_9323F4844E1252066F3EE588909E65B1
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_9323F4844E1252066F3EE588909E65B1_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_FE7871F64D0B78CAB9D56E801667B628
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_FE7871F64D0B78CAB9D56E801667B628_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_574CF6BB4D7D749E5A749A8BEC070E41
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_574CF6BB4D7D749E5A749A8BEC070E41_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_6D9CD0724B9D3B15AEE1009A08FC1449
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_6D9CD0724B9D3B15AEE1009A08FC1449_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_D1EAF98C4C2418553512DAA9B96E8735
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_D1EAF98C4C2418553512DAA9B96E8735_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_6EA6B61140005EFB08983A894F528513
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_6EA6B61140005EFB08983A894F528513_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_8289AA53403A3888034D0B90638156A2
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_8289AA53403A3888034D0B90638156A2_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_5517652643295B80491040BE1CD33335
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_5517652643295B80491040BE1CD33335_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_D3B73F964AB5B16B7F7E9E9551888913
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_D3B73F964AB5B16B7F7E9E9551888913_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_D5AB1124456AC126307009858FEFBF67
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_D5AB1124456AC126307009858FEFBF67_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_459D68154D57943D1CF99D867ECBEE13
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_459D68154D57943D1CF99D867ECBEE13_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_B3999BC04E86AA61F3F72EAE587502BC
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_B3999BC04E86AA61F3F72EAE587502BC_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_E28118AE4EBCC837A686EF91AA8B3C76
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_E28118AE4EBCC837A686EF91AA8B3C76_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_C271A0E343347CFF2EAAB096F5A1E151
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_C271A0E343347CFF2EAAB096F5A1E151_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.Destruct
	 */
	struct UUI_Component_PlayerHead_C_Destruct_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ConstructCopy
	 */
	struct UUI_Component_PlayerHead_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarCopy
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarCopy_Params
	{
	public:
		int32_t                                                    AvatarID;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_1AAU[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              AvatarUrl;                                               // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.RefreshByPSCopy
	 */
	struct UUI_Component_PlayerHead_C_RefreshByPSCopy_Params
	{
	public:
		class ASolarPlayerState*                                   ps;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bWithoutGender;                                          // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetVipTypeCopy
	 */
	struct UUI_Component_PlayerHead_C_SetVipTypeCopy_Params
	{
	public:
		unsigned char                                              VipType;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_DZEL[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnSolarUIOpened
	 */
	struct UUI_Component_PlayerHead_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnInitialized
	 */
	struct UUI_Component_PlayerHead_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ForceShowFrameCopy
	 */
	struct UUI_Component_PlayerHead_C_ForceShowFrameCopy_Params
	{
	public:
		int32_t                                                    FrameID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnSolarUIClosed
	 */
	struct UUI_Component_PlayerHead_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.GetModuleName
	 */
	struct UUI_Component_PlayerHead_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ForceShowFrame
	 */
	struct UUI_Component_PlayerHead_C_ForceShowFrame_Params
	{
	public:
		int32_t                                                    FrameID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.RefreshByPS
	 */
	struct UUI_Component_PlayerHead_C_RefreshByPS_Params
	{
	public:
		class ASolarPlayerState*                                   ps;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bWithoutGender;                                          // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarSize
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarSize_Params
	{
	public:
		bool                                                       IsCustom;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatar
	 */
	struct UUI_Component_PlayerHead_C_SetAvatar_Params
	{
	public:
		int32_t                                                    AvatarID;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_MDWI[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              AvatarUrl;                                               // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetStateHD
	 */
	struct UUI_Component_PlayerHead_C_SetStateHD_Params
	{
	public:
		E_TabLobbyItemState                                        StateHD;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetDefaultSteamAvatar
	 */
	struct UUI_Component_PlayerHead_C_SetDefaultSteamAvatar_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetVipType
	 */
	struct UUI_Component_PlayerHead_C_SetVipType_Params
	{
	public:
		unsigned char                                              VipType;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_NTLB[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnTouchMoved
	 */
	struct UUI_Component_PlayerHead_C_OnTouchMoved_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		struct FPointerEvent                                       InTouchEvent;                                            // 0x0038(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarState
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarState_Params
	{
	public:
		bool                                                       IsCollapsed;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarIcon
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarIcon_Params
	{
	public:
		int32_t                                                    InAvatarID;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_QLTK[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetEmptyState
	 */
	struct UUI_Component_PlayerHead_C_SetEmptyState_Params
	{
	public:
		bool                                                       IsEmpty;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetPlayerGender
	 */
	struct UUI_Component_PlayerHead_C_SetPlayerGender_Params
	{
	public:
		E_Type_Gender                                              Gender;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetSocialIcon
	 */
	struct UUI_Component_PlayerHead_C_SetSocialIcon_Params
	{
	public:
		E_Type_Social                                              Social;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.Update
	 */
	struct UUI_Component_PlayerHead_C_Update_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.PreConstruct
	 */
	struct UUI_Component_PlayerHead_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.Construct
	 */
	struct UUI_Component_PlayerHead_C_Construct_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ExecuteUbergraph_UI_Component_PlayerHead
	 */
	struct UUI_Component_PlayerHead_C_ExecuteUbergraph_UI_Component_PlayerHead_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnReleased__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_OnReleased__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_OnClicked__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
