#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_905ECB4E400C59B2EEA511A7E631FCA0
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_905ECB4E400C59B2EEA511A7E631FCA0_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_A87EF6284E3F7FD6443D238B7FB3F993
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_A87EF6284E3F7FD6443D238B7FB3F993_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_71B0BA724457443FB3B1ECBE833CBE2E
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_71B0BA724457443FB3B1ECBE833CBE2E_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_938BE2E64523713EA004EB869FFD445B
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_938BE2E64523713EA004EB869FFD445B_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_162B4227470603B1B3B0058E2FD3DF0F
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_162B4227470603B1B3B0058E2FD3DF0F_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_0D66074A4F4BE887E5D39F88977E8336
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_0D66074A4F4BE887E5D39F88977E8336_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_529325D64E379E5A370500B750FA038D
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_529325D64E379E5A370500B750FA038D_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_F352034C4F0E2CBAC4D052AC57CEB0D5
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_F352034C4F0E2CBAC4D052AC57CEB0D5_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_050FEEE3404D3957EC8C3D8AD98F3D2F
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_050FEEE3404D3957EC8C3D8AD98F3D2F_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_C2A78B724B7B84297A965E9C3767ECEA
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_C2A78B724B7B84297A965E9C3767ECEA_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_8DA8FFE54CE4EE0E0646ADBC8BE91725
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_8DA8FFE54CE4EE0E0646ADBC8BE91725_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_2E933EAD4DDEDAE1126B0887A9389F95
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_2E933EAD4DDEDAE1126B0887A9389F95_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_F41E7E374CC42AB810B87A90B4DDFECE
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_F41E7E374CC42AB810B87A90B4DDFECE_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_31F3378342888AA10D0BE7A40FA02491
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_31F3378342888AA10D0BE7A40FA02491_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_B05249104A6B7853FBC093A9B9F6711F
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_B05249104A6B7853FBC093A9B9F6711F_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_6F1C95C84BB2D623CB81D5838AAAA14E
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_6F1C95C84BB2D623CB81D5838AAAA14E_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_04E7D2F14CF4D8B3796F639BD31FD745
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_04E7D2F14CF4D8B3796F639BD31FD745_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_87F7F4F748B586216477B995C62C5708
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_87F7F4F748B586216477B995C62C5708_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_DD59E3D043D724B27485899C78B23E5D
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_DD59E3D043D724B27485899C78B23E5D_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_F34BB93A4C97141E2EB3D1A07393469C
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_F34BB93A4C97141E2EB3D1A07393469C_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_5CCEF38D488E71FFC51259AFD715077E
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_5CCEF38D488E71FFC51259AFD715077E_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_A17D39904796E71641B6BF8CACB969A3
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_A17D39904796E71641B6BF8CACB969A3_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_F415743C4C3DEF0F2ADEF682C7873D1B
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_F415743C4C3DEF0F2ADEF682C7873D1B_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_51E3B3AE4DD3FC9B013D519595D07E49
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_51E3B3AE4DD3FC9B013D519595D07E49_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarCopy
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarCopy_Params
	{
	public:
		int32_t                                                    AvatarID;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_I6BT[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              AvatarUrl;                                               // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetVipTypeCopy
	 */
	struct UUI_Component_PlayerHead_C_SetVipTypeCopy_Params
	{
	public:
		unsigned char                                              VipType;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_2K5A[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.Destruct
	 */
	struct UUI_Component_PlayerHead_C_Destruct_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnSolarUIOpened
	 */
	struct UUI_Component_PlayerHead_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnSolarUIClosed
	 */
	struct UUI_Component_PlayerHead_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnInitialized
	 */
	struct UUI_Component_PlayerHead_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.RefreshByPSCopy
	 */
	struct UUI_Component_PlayerHead_C_RefreshByPSCopy_Params
	{
	public:
		class ASolarPlayerState*                                   ps;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bWithoutGender;                                          // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ConstructCopy
	 */
	struct UUI_Component_PlayerHead_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ForceShowFrameCopy
	 */
	struct UUI_Component_PlayerHead_C_ForceShowFrameCopy_Params
	{
	public:
		int32_t                                                    FrameID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.GetModuleName
	 */
	struct UUI_Component_PlayerHead_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ForceShowFrame
	 */
	struct UUI_Component_PlayerHead_C_ForceShowFrame_Params
	{
	public:
		int32_t                                                    FrameID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.RefreshByPS
	 */
	struct UUI_Component_PlayerHead_C_RefreshByPS_Params
	{
	public:
		class ASolarPlayerState*                                   ps;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bWithoutGender;                                          // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarSize
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarSize_Params
	{
	public:
		bool                                                       IsCustom;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatar
	 */
	struct UUI_Component_PlayerHead_C_SetAvatar_Params
	{
	public:
		int32_t                                                    AvatarID;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_FXU1[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              AvatarUrl;                                               // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetStateHD
	 */
	struct UUI_Component_PlayerHead_C_SetStateHD_Params
	{
	public:
		E_TabLobbyItemState                                        StateHD;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetDefaultSteamAvatar
	 */
	struct UUI_Component_PlayerHead_C_SetDefaultSteamAvatar_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetVipType
	 */
	struct UUI_Component_PlayerHead_C_SetVipType_Params
	{
	public:
		unsigned char                                              VipType;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_0OH7[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnTouchMoved
	 */
	struct UUI_Component_PlayerHead_C_OnTouchMoved_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		struct FPointerEvent                                       InTouchEvent;                                            // 0x0038(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarState
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarState_Params
	{
	public:
		bool                                                       IsCollapsed;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarIcon
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarIcon_Params
	{
	public:
		int32_t                                                    InAvatarID;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_7PI2[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetEmptyState
	 */
	struct UUI_Component_PlayerHead_C_SetEmptyState_Params
	{
	public:
		bool                                                       IsEmpty;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetPlayerGender
	 */
	struct UUI_Component_PlayerHead_C_SetPlayerGender_Params
	{
	public:
		E_Type_Gender                                              Gender;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetSocialIcon
	 */
	struct UUI_Component_PlayerHead_C_SetSocialIcon_Params
	{
	public:
		E_Type_Social                                              Social;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.Update
	 */
	struct UUI_Component_PlayerHead_C_Update_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.PreConstruct
	 */
	struct UUI_Component_PlayerHead_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.Construct
	 */
	struct UUI_Component_PlayerHead_C_Construct_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ExecuteUbergraph_UI_Component_PlayerHead
	 */
	struct UUI_Component_PlayerHead_C_ExecuteUbergraph_UI_Component_PlayerHead_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnReleased__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_OnReleased__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_OnClicked__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
