#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_F6C7D5B14BCDB48EDDCFE68655F624CD
	 */
	struct UUI_Currency_Bar_C_OnClicked_F6C7D5B14BCDB48EDDCFE68655F624CD_Params
	{	};

	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_43DFC3584FBE60F6FB4BE48F8B22A43F
	 */
	struct UUI_Currency_Bar_C_OnClicked_43DFC3584FBE60F6FB4BE48F8B22A43F_Params
	{	};

	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_BD20B7254B1C837EEECCA8A9296B26A7
	 */
	struct UUI_Currency_Bar_C_OnClicked_BD20B7254B1C837EEECCA8A9296B26A7_Params
	{	};

	/**
	 * DelegateFunction UI_Currency_Bar.UI_Currency_Bar_C.OnClicked_72B700524913923585A4939B2C681E73
	 */
	struct UUI_Currency_Bar_C_OnClicked_72B700524913923585A4939B2C681E73_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.OnSolarUIClosed
	 */
	struct UUI_Currency_Bar_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.Construct
	 */
	struct UUI_Currency_Bar_C_Construct_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.OnSolarUIOpened
	 */
	struct UUI_Currency_Bar_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.GetModuleName
	 */
	struct UUI_Currency_Bar_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.SetStateDesktop
	 */
	struct UUI_Currency_Bar_C_SetStateDesktop_Params
	{
	public:
		E_Type_State_Desktop                                       StateDesktopDiamond;                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		E_Type_State_Desktop                                       StateDesktopVip;                                         // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.PreConstruct
	 */
	struct UUI_Currency_Bar_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Currency_Bar.UI_Currency_Bar_C.ExecuteUbergraph_UI_Currency_Bar
	 */
	struct UUI_Currency_Bar_C_ExecuteUbergraph_UI_Currency_Bar_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
