#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_840E607E48716F5C26BEACAC213F0AB9
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_840E607E48716F5C26BEACAC213F0AB9_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_8C16112C476CA60AA45A2898B33B3EC0
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_8C16112C476CA60AA45A2898B33B3EC0_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_E1347CB94C95B398B0B107B30B606A0F
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_E1347CB94C95B398B0B107B30B606A0F_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_7C63ED5341D48D894DC01CB1EA450F2E
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_7C63ED5341D48D894DC01CB1EA450F2E_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_B71006564FE431CA03CF138E753E96F9
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_B71006564FE431CA03CF138E753E96F9_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_D9EBE6AD4EBDA97BBC4ADEAF15BC5640
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_D9EBE6AD4EBDA97BBC4ADEAF15BC5640_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_524AEA4A40DFBF844E7AFFB9522573FA
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_524AEA4A40DFBF844E7AFFB9522573FA_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_C36263C54CDF829F60B63D95DA78162B
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_C36263C54CDF829F60B63D95DA78162B_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_A2128E4049A80A40562D7A9E4842D8A1
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_A2128E4049A80A40562D7A9E4842D8A1_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_4615C9964BD48EE3087B72B1AEE55A9B
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_4615C9964BD48EE3087B72B1AEE55A9B_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_83CA2BF84E5D53861742DABD488CB07A
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_83CA2BF84E5D53861742DABD488CB07A_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_AB626E5540B54DC4D82655889086BBD9
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_AB626E5540B54DC4D82655889086BBD9_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_0BD8260B4E23EC088FE2E88E54221FF4
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_0BD8260B4E23EC088FE2E88E54221FF4_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_5B5BCDD04D55005825D9399C46126FBF
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_5B5BCDD04D55005825D9399C46126FBF_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_8D45F32D4B7ABBA9213ADAAAAF0C2EDB
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_8D45F32D4B7ABBA9213ADAAAAF0C2EDB_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_7C58640F4601E4E49BED2493A553F5C7
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_7C58640F4601E4E49BED2493A553F5C7_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_0E7F8BC1452F38D3F21B9A952FC2702D
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_0E7F8BC1452F38D3F21B9A952FC2702D_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_43A76DC645292C1551CDE5B00357B197
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_43A76DC645292C1551CDE5B00357B197_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_72DC0FDB40091489E714F289DBF6AC34
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_72DC0FDB40091489E714F289DBF6AC34_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_3B89A263444AEC7A319120B0145E7D88
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_3B89A263444AEC7A319120B0145E7D88_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_2F4B9BFC4481959170224891D6703F39
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_2F4B9BFC4481959170224891D6703F39_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_455F932D4FEB483FC4E2DD8A125A5FD6
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_455F932D4FEB483FC4E2DD8A125A5FD6_Params
	{	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnURLDownloadFinish_D79CD6B44A6A6319E5326E94788374CD
	 */
	struct UUI_Component_PlayerHead_C_OnURLDownloadFinish_D79CD6B44A6A6319E5326E94788374CD_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked_339229C444121CB5EC9F19B52833E4D6
	 */
	struct UUI_Component_PlayerHead_C_OnClicked_339229C444121CB5EC9F19B52833E4D6_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnInitialized
	 */
	struct UUI_Component_PlayerHead_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarCopy
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarCopy_Params
	{
	public:
		int32_t                                                    AvatarID;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_0XEI[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              AvatarUrl;                                               // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetVipTypeCopy
	 */
	struct UUI_Component_PlayerHead_C_SetVipTypeCopy_Params
	{
	public:
		unsigned char                                              VipType;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_9UG6[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnSolarUIOpened
	 */
	struct UUI_Component_PlayerHead_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnSolarUIClosed
	 */
	struct UUI_Component_PlayerHead_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.Destruct
	 */
	struct UUI_Component_PlayerHead_C_Destruct_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ForceShowFrameCopy
	 */
	struct UUI_Component_PlayerHead_C_ForceShowFrameCopy_Params
	{
	public:
		int32_t                                                    FrameID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ConstructCopy
	 */
	struct UUI_Component_PlayerHead_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.RefreshByPSCopy
	 */
	struct UUI_Component_PlayerHead_C_RefreshByPSCopy_Params
	{
	public:
		class ASolarPlayerState*                                   ps;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bWithoutGender;                                          // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.GetModuleName
	 */
	struct UUI_Component_PlayerHead_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ForceShowFrame
	 */
	struct UUI_Component_PlayerHead_C_ForceShowFrame_Params
	{
	public:
		int32_t                                                    FrameID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.RefreshByPS
	 */
	struct UUI_Component_PlayerHead_C_RefreshByPS_Params
	{
	public:
		class ASolarPlayerState*                                   ps;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bWithoutGender;                                          // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarSize
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarSize_Params
	{
	public:
		bool                                                       IsCustom;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatar
	 */
	struct UUI_Component_PlayerHead_C_SetAvatar_Params
	{
	public:
		int32_t                                                    AvatarID;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_JDVM[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              AvatarUrl;                                               // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetStateHD
	 */
	struct UUI_Component_PlayerHead_C_SetStateHD_Params
	{
	public:
		E_TabLobbyItemState                                        StateHD;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetDefaultSteamAvatar
	 */
	struct UUI_Component_PlayerHead_C_SetDefaultSteamAvatar_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetVipType
	 */
	struct UUI_Component_PlayerHead_C_SetVipType_Params
	{
	public:
		unsigned char                                              VipType;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_ZV8R[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnTouchMoved
	 */
	struct UUI_Component_PlayerHead_C_OnTouchMoved_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		struct FPointerEvent                                       InTouchEvent;                                            // 0x0038(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarState
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarState_Params
	{
	public:
		bool                                                       IsCollapsed;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetAvatarIcon
	 */
	struct UUI_Component_PlayerHead_C_SetAvatarIcon_Params
	{
	public:
		int32_t                                                    InAvatarID;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_DEBV[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetEmptyState
	 */
	struct UUI_Component_PlayerHead_C_SetEmptyState_Params
	{
	public:
		bool                                                       IsEmpty;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetPlayerGender
	 */
	struct UUI_Component_PlayerHead_C_SetPlayerGender_Params
	{
	public:
		E_Type_Gender                                              Gender;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.SetSocialIcon
	 */
	struct UUI_Component_PlayerHead_C_SetSocialIcon_Params
	{
	public:
		E_Type_Social                                              Social;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.Update
	 */
	struct UUI_Component_PlayerHead_C_Update_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.PreConstruct
	 */
	struct UUI_Component_PlayerHead_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_BndEvt__Btn_PlayerInfo_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.Construct
	 */
	struct UUI_Component_PlayerHead_C_Construct_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.ExecuteUbergraph_UI_Component_PlayerHead
	 */
	struct UUI_Component_PlayerHead_C_ExecuteUbergraph_UI_Component_PlayerHead_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnReleased__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_OnReleased__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Component_PlayerHead.UI_Component_PlayerHead_C.OnClicked__DelegateSignature
	 */
	struct UUI_Component_PlayerHead_C_OnClicked__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
