#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_6196CB3843FF32CCFA980487EE7DEF0C
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_6196CB3843FF32CCFA980487EE7DEF0C_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_2D738ACB495BB10ED035FA835E29F841
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_2D738ACB495BB10ED035FA835E29F841_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_B67A8B9841A07DD60E7A4FAD437D111A
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_B67A8B9841A07DD60E7A4FAD437D111A_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_0D04B918421FB8FA6752A990C6BC532A
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_0D04B918421FB8FA6752A990C6BC532A_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_92CF1FAF43009877B2A4389F13CCB1F2
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_92CF1FAF43009877B2A4389F13CCB1F2_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_F14B777D42AF17BA56B9129A617F9DD9
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_F14B777D42AF17BA56B9129A617F9DD9_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_D88AEC054ABDEEDA494A8B910C473261
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_D88AEC054ABDEEDA494A8B910C473261_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Destruct
	 */
	struct UUI_Lobby_StartBtn_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnSolarUIOpened
	 */
	struct UUI_Lobby_StartBtn_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnSolarUIClosed
	 */
	struct UUI_Lobby_StartBtn_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.ConstructCopy
	 */
	struct UUI_Lobby_StartBtn_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.GetModuleName
	 */
	struct UUI_Lobby_StartBtn_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.SetStateDesktop
	 */
	struct UUI_Lobby_StartBtn_C_SetStateDesktop_Params
	{
	public:
		E_Type_State_Desktop                                       StateDesktopStart;                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       IsDesktop;                                               // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.UpdatePlatformBlendState
	 */
	struct UUI_Lobby_StartBtn_C_UpdatePlatformBlendState_Params
	{
	public:
		bool                                                       NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.UpdatePanelState
	 */
	struct UUI_Lobby_StartBtn_C_UpdatePanelState_Params
	{
	public:
		bool                                                       Leader;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Matching;                                                // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Ready;                                                   // 0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Disable;                                                 // 0x0003(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Update All Widgets
	 */
	struct UUI_Lobby_StartBtn_C_UpdateAllWidgets_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.PreConstruct
	 */
	struct UUI_Lobby_StartBtn_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Construct
	 */
	struct UUI_Lobby_StartBtn_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.ExecuteUbergraph_UI_Lobby_StartBtn
	 */
	struct UUI_Lobby_StartBtn_C_ExecuteUbergraph_UI_Lobby_StartBtn_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
