#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_3C4DC47943BBD8A7B3F2D28E7AB34271
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_3C4DC47943BBD8A7B3F2D28E7AB34271_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_1EB1AC054C9AF21A96692C99EEFE568C
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_1EB1AC054C9AF21A96692C99EEFE568C_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_0CF13CBE479411EC9217A0B87968A0D4
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_0CF13CBE479411EC9217A0B87968A0D4_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_7D91CD7B4DCE79A261A01AB58CD935EF
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_7D91CD7B4DCE79A261A01AB58CD935EF_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_3ADFADC94EEC29B64D993C9FE709A167
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_3ADFADC94EEC29B64D993C9FE709A167_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_274F4F6D44915E65A9ADAF86DA85B14D
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_274F4F6D44915E65A9ADAF86DA85B14D_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_ABE3ED324B93A7B8D81E99811D0D4397
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_ABE3ED324B93A7B8D81E99811D0D4397_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_A1E2DF5549E89F9A82B9048347F0A87F
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_A1E2DF5549E89F9A82B9048347F0A87F_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.ConstructCopy
	 */
	struct UUI_Lobby_TeamMember_Operation_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnInitialized
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.Destruct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.GetModuleName
	 */
	struct UUI_Lobby_TeamMember_Operation_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetHD_Params
	{
	public:
		bool                                                       IsHD;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_1XHD[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetStateQuitHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetStateQuitHD_Params
	{
	public:
		E_Type_State_Desktop                                       StateQuitHD;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetStatePlayernameHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetStatePlayernameHD_Params
	{
	public:
		E_Type_State_Desktop                                       StatePlayernameHD;                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.PreConstruct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.Construct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.ExecuteUbergraph_UI_Lobby_TeamMember_Operation
	 */
	struct UUI_Lobby_TeamMember_Operation_C_ExecuteUbergraph_UI_Lobby_TeamMember_Operation_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
