#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_3402CC4E4E2A1E0C5B112FA657582408
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_3402CC4E4E2A1E0C5B112FA657582408_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_93E510DB497BA572893C65987CFFAB54
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_93E510DB497BA572893C65987CFFAB54_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_38CDD83A40EEA139B67C5CA50102B6E5
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_38CDD83A40EEA139B67C5CA50102B6E5_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_F9B42E0647F25A1516B40B9F7856190E
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_F9B42E0647F25A1516B40B9F7856190E_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_90C68C9B47430A70702E1D9D682853FC
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_90C68C9B47430A70702E1D9D682853FC_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_171C7D8F4BB73B07E777469C728AA4C9
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_171C7D8F4BB73B07E777469C728AA4C9_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_E3638D744239EA0538FDE0911D1B1959
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_E3638D744239EA0538FDE0911D1B1959_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_961B8BAF4830C71F12C0B7B56AAEE43D
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_961B8BAF4830C71F12C0B7B56AAEE43D_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.ConstructCopy
	 */
	struct UUI_Lobby_TeamMember_Operation_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnInitialized
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.Destruct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.GetModuleName
	 */
	struct UUI_Lobby_TeamMember_Operation_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetHD_Params
	{
	public:
		bool                                                       IsHD;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_RG9Z[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetStateQuitHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetStateQuitHD_Params
	{
	public:
		E_Type_State_Desktop                                       StateQuitHD;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetStatePlayernameHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetStatePlayernameHD_Params
	{
	public:
		E_Type_State_Desktop                                       StatePlayernameHD;                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.PreConstruct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.Construct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.ExecuteUbergraph_UI_Lobby_TeamMember_Operation
	 */
	struct UUI_Lobby_TeamMember_Operation_C_ExecuteUbergraph_UI_Lobby_TeamMember_Operation_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
