#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Delegate_9F31278B48E620C03A6DFEB83F69E342
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Delegate_9F31278B48E620C03A6DFEB83F69E342_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.OnClicked_F9D8D9824900FE2FC73C67AEE1F4ED17
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_OnClicked_F9D8D9824900FE2FC73C67AEE1F4ED17_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.OnClicked_FE0B0CCF409DF3793B041199631D798B
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_OnClicked_FE0B0CCF409DF3793B041199631D798B_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.OnClicked_2DC3E53C435D201391F165A8A958BA70
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_OnClicked_2DC3E53C435D201391F165A8A958BA70_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Destruct
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Construct
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.GetModuleName
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Update_Btn
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Update_Btn_Params
	{
	public:
		ET_Type_Button                                             NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.SetType
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_SetType_Params
	{
	public:
		ET_Type_System_Push                                        NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.PreConstruct
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.ExecuteUbergraph_UI_Lobby_RoomInvite_Popup
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_ExecuteUbergraph_UI_Lobby_RoomInvite_Popup_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
