#pragma once

/**
 * Name: FL84
 * Version: 1.15.1.6
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_F309829646821B0033F35FB3A33B60B7
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_F309829646821B0033F35FB3A33B60B7_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_E32E7F1840637E26ABA9EF8D2A7516F3
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_E32E7F1840637E26ABA9EF8D2A7516F3_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_CEFF11F448E82C565391B187BD97914B
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_CEFF11F448E82C565391B187BD97914B_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_1ED364A34F33FFBC1E2F28B4923064A4
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_1ED364A34F33FFBC1E2F28B4923064A4_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_8C256945474D576C28CBA68C61028E6E
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_8C256945474D576C28CBA68C61028E6E_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_6A2C5E3F47419E5C9BED6EB6351354A9
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_6A2C5E3F47419E5C9BED6EB6351354A9_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_D2519FCA482D17A53CB8E9B54D414004
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_D2519FCA482D17A53CB8E9B54D414004_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_28A264BC44E0ADB7836696B54B45F797
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_28A264BC44E0ADB7836696B54B45F797_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.ConstructCopy
	 */
	struct UUI_Lobby_TeamMember_Operation_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.Destruct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnInitialized
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.GetModuleName
	 */
	struct UUI_Lobby_TeamMember_Operation_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetHD_Params
	{
	public:
		bool                                                       IsHD;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_PR2F[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetStateQuitHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetStateQuitHD_Params
	{
	public:
		E_Type_State_Desktop                                       StateQuitHD;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetStatePlayernameHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetStatePlayernameHD_Params
	{
	public:
		E_Type_State_Desktop                                       StatePlayernameHD;                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.PreConstruct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.Construct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.ExecuteUbergraph_UI_Lobby_TeamMember_Operation
	 */
	struct UUI_Lobby_TeamMember_Operation_C_ExecuteUbergraph_UI_Lobby_TeamMember_Operation_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
