#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnRegisterEvent_F06BC5774E770BAED0B1BA84F0F29F4F
	 */
	struct UUI_Lobby_C_OnRegisterEvent_F06BC5774E770BAED0B1BA84F0F29F4F_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_661179B14141792C59FB90B156343A83
	 */
	struct UUI_Lobby_C_OnClicked_661179B14141792C59FB90B156343A83_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_F952B45841BBE0E834EA6CB7DAE0D72F
	 */
	struct UUI_Lobby_C_OnClicked_F952B45841BBE0E834EA6CB7DAE0D72F_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_3FE4FF9E41D3AB8EF399DF87C7059025
	 */
	struct UUI_Lobby_C_OnClicked_3FE4FF9E41D3AB8EF399DF87C7059025_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_A546ADE542BD82ED59A86AA5786665C2
	 */
	struct UUI_Lobby_C_OnClicked_A546ADE542BD82ED59A86AA5786665C2_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_6963013A4B66CEBC66B0108A5BB95C2F
	 */
	struct UUI_Lobby_C_OnClicked_6963013A4B66CEBC66B0108A5BB95C2F_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_1673A2184D3EF6C3528D609B4D98D900
	 */
	struct UUI_Lobby_C_OnClicked_1673A2184D3EF6C3528D609B4D98D900_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_846B7DCB44F40890B41528BD476B71B4
	 */
	struct UUI_Lobby_C_OnClicked_846B7DCB44F40890B41528BD476B71B4_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_FE532E30480FC8181827EAA8E9C73726
	 */
	struct UUI_Lobby_C_OnClicked_FE532E30480FC8181827EAA8E9C73726_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_944E04C54D9982616F995FB20032EA5B
	 */
	struct UUI_Lobby_C_OnClicked_944E04C54D9982616F995FB20032EA5B_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_4DEA7A6B4AEDB319507592BB74973B6D
	 */
	struct UUI_Lobby_C_OnClicked_4DEA7A6B4AEDB319507592BB74973B6D_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnBrowserClosed_298405CB432D9DF92790A399C2878F15
	 */
	struct UUI_Lobby_C_OnBrowserClosed_298405CB432D9DF92790A399C2878F15_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnBtnNetBarClicked_5844CFBE4264937EC707FE92ACE8D288
	 */
	struct UUI_Lobby_C_OnBtnNetBarClicked_5844CFBE4264937EC707FE92ACE8D288_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_47AF94AA46EE875F64522EACEFC0E87D
	 */
	struct UUI_Lobby_C_OnClicked_47AF94AA46EE875F64522EACEFC0E87D_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_548B3F6F432A555A31660ABA48357F04
	 */
	struct UUI_Lobby_C_OnClicked_548B3F6F432A555A31660ABA48357F04_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_BC0CEDC54330BE0C346347804355091F
	 */
	struct UUI_Lobby_C_OnClicked_BC0CEDC54330BE0C346347804355091F_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnCheckStateChanged_D813D82E42750C9F4B723F886D9934A7
	 */
	struct UUI_Lobby_C_OnCheckStateChanged_D813D82E42750C9F4B723F886D9934A7_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_B39E0DB448D72030D6C31BB7646936A5
	 */
	struct UUI_Lobby_C_OnClicked_B39E0DB448D72030D6C31BB7646936A5_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_45948B28472FB8E0EAF28BB3DDC74782
	 */
	struct UUI_Lobby_C_OnClicked_45948B28472FB8E0EAF28BB3DDC74782_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_DA802C6D4E1B079E4F22E0B287E41D65
	 */
	struct UUI_Lobby_C_OnClicked_DA802C6D4E1B079E4F22E0B287E41D65_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_CE78E1264CCBCC2ACAC39D9F1570E5A9
	 */
	struct UUI_Lobby_C_OnClicked_CE78E1264CCBCC2ACAC39D9F1570E5A9_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_E5FD68234D81B70B5BC433A525953DA2
	 */
	struct UUI_Lobby_C_OnClicked_E5FD68234D81B70B5BC433A525953DA2_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_365E52C64BE62E6A57215EAC32E2417F
	 */
	struct UUI_Lobby_C_OnClicked_365E52C64BE62E6A57215EAC32E2417F_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_3450C0FE4A5C42F140F291B87FB49B0A
	 */
	struct UUI_Lobby_C_OnClicked_3450C0FE4A5C42F140F291B87FB49B0A_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_EF49CE6D45722A4071645986A90F9401
	 */
	struct UUI_Lobby_C_OnClicked_EF49CE6D45722A4071645986A90F9401_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_04BC9C834F6003DEE02FC395A5535E76
	 */
	struct UUI_Lobby_C_OnClicked_04BC9C834F6003DEE02FC395A5535E76_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_914B606148088D81CD3C99831E2A9068
	 */
	struct UUI_Lobby_C_OnClicked_914B606148088D81CD3C99831E2A9068_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_49B310C44FFD138567E49489DF9DB7D2
	 */
	struct UUI_Lobby_C_OnClicked_49B310C44FFD138567E49489DF9DB7D2_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_600352CE4F9CBA80DEAAB5839F495477
	 */
	struct UUI_Lobby_C_OnClicked_600352CE4F9CBA80DEAAB5839F495477_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_898519714E24CE6A8F0C529FE70BAF21
	 */
	struct UUI_Lobby_C_OnClicked_898519714E24CE6A8F0C529FE70BAF21_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_6FE7DA414C563E61608B2FB765718F4A
	 */
	struct UUI_Lobby_C_OnClicked_6FE7DA414C563E61608B2FB765718F4A_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_26CFAA0F461FE1F384FA5C9BA5B82322
	 */
	struct UUI_Lobby_C_OnClicked_26CFAA0F461FE1F384FA5C9BA5B82322_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_A423B59A4F77BA04C785B58669C9F5DA
	 */
	struct UUI_Lobby_C_OnClicked_A423B59A4F77BA04C785B58669C9F5DA_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_9208137248D61CE402669687EC7F472F
	 */
	struct UUI_Lobby_C_OnClicked_9208137248D61CE402669687EC7F472F_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_844CB0FA488E5F8D512E0CA072CB7C75
	 */
	struct UUI_Lobby_C_OnClicked_844CB0FA488E5F8D512E0CA072CB7C75_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_F07BA2DB4B537F6C966130B8D1B91E8D
	 */
	struct UUI_Lobby_C_OnClicked_F07BA2DB4B537F6C966130B8D1B91E8D_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnShow
	 */
	struct UUI_Lobby_C_OnShow_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnAnimationFinished
	 */
	struct UUI_Lobby_C_OnAnimationFinished_Params
	{
	public:
		class UWidgetAnimation*                                    Animation;                                               // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnSolarUIOpened
	 */
	struct UUI_Lobby_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ConstructCopy
	 */
	struct UUI_Lobby_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnHide
	 */
	struct UUI_Lobby_C_OnHide_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnSolarUIClosed
	 */
	struct UUI_Lobby_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnInitialized
	 */
	struct UUI_Lobby_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnBackKey
	 */
	struct UUI_Lobby_C_OnBackKey_Params
	{
	public:
		EWidgetBackKeyType                                         BackKeyType;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.Destruct
	 */
	struct UUI_Lobby_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.GetModuleName
	 */
	struct UUI_Lobby_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.SetLevel
	 */
	struct UUI_Lobby_C_SetLevel_Params
	{
	public:
		int32_t                                                    Level;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.GetAnimTargetLocation
	 */
	struct UUI_Lobby_C_GetAnimTargetLocation_Params
	{
	public:
		class UWidget*                                             TargetObject;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UWidget*                                             UserObject;                                              // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FVector2D                                           TargetLocation;                                          // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.PreConstruct
	 */
	struct UUI_Lobby_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.Construct
	 */
	struct UUI_Lobby_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ReceiveShow
	 */
	struct UUI_Lobby_C_ReceiveShow_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ExecuteUbergraph_UI_Lobby
	 */
	struct UUI_Lobby_C_ExecuteUbergraph_UI_Lobby_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_473F[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
