#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnRegisterEvent_EC6EF71243863FE2BC1264BE6C1E9C2A
	 */
	struct UUI_Lobby_C_OnRegisterEvent_EC6EF71243863FE2BC1264BE6C1E9C2A_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_7EC9E1AE4B2F93DB453CAAA3E8D8A7B9
	 */
	struct UUI_Lobby_C_OnClicked_7EC9E1AE4B2F93DB453CAAA3E8D8A7B9_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_1D63B501443B779454CFBB98C120A1CA
	 */
	struct UUI_Lobby_C_OnClicked_1D63B501443B779454CFBB98C120A1CA_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_7C4AB8304A04FA9D4F2447866A008268
	 */
	struct UUI_Lobby_C_OnClicked_7C4AB8304A04FA9D4F2447866A008268_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_7CAD58974E90D6700DE8F2B2F5AE8425
	 */
	struct UUI_Lobby_C_OnClicked_7CAD58974E90D6700DE8F2B2F5AE8425_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_280658524DA9EE763F259C9790F5B598
	 */
	struct UUI_Lobby_C_OnClicked_280658524DA9EE763F259C9790F5B598_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_B93E2C834C6E19D4702EC6807AE3F991
	 */
	struct UUI_Lobby_C_OnClicked_B93E2C834C6E19D4702EC6807AE3F991_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_E0DD4BF6404AC6D2B4B402AA018297FB
	 */
	struct UUI_Lobby_C_OnClicked_E0DD4BF6404AC6D2B4B402AA018297FB_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_2836577A4F6405ABD442A9A4E65A65E1
	 */
	struct UUI_Lobby_C_OnClicked_2836577A4F6405ABD442A9A4E65A65E1_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_9B3815D4458906FEF2C304B8506F2DC3
	 */
	struct UUI_Lobby_C_OnClicked_9B3815D4458906FEF2C304B8506F2DC3_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_8392F9EF4785E7677F28DCA1201E11AB
	 */
	struct UUI_Lobby_C_OnClicked_8392F9EF4785E7677F28DCA1201E11AB_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnBrowserClosed_A07C251B44CFA99363EADCAAD3C7C18B
	 */
	struct UUI_Lobby_C_OnBrowserClosed_A07C251B44CFA99363EADCAAD3C7C18B_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnBtnNetBarClicked_2CA8DA1F4C8D13374DF9F0B7460E7DB4
	 */
	struct UUI_Lobby_C_OnBtnNetBarClicked_2CA8DA1F4C8D13374DF9F0B7460E7DB4_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_EA7142EB4627648214AED9BE8A4BABD4
	 */
	struct UUI_Lobby_C_OnClicked_EA7142EB4627648214AED9BE8A4BABD4_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_C44F5FCC476F05C74A2590ADB2D3D331
	 */
	struct UUI_Lobby_C_OnClicked_C44F5FCC476F05C74A2590ADB2D3D331_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_98D6C0CC472D233C384BD59D0403F5C2
	 */
	struct UUI_Lobby_C_OnClicked_98D6C0CC472D233C384BD59D0403F5C2_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnCheckStateChanged_932AB4DA44E366F9627F76B60B5676DA
	 */
	struct UUI_Lobby_C_OnCheckStateChanged_932AB4DA44E366F9627F76B60B5676DA_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_E4422813484FD5F3041A3DB1857A9BCB
	 */
	struct UUI_Lobby_C_OnClicked_E4422813484FD5F3041A3DB1857A9BCB_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_B2E640344107DDE1619BF498219C1C88
	 */
	struct UUI_Lobby_C_OnClicked_B2E640344107DDE1619BF498219C1C88_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_17E242CE41A468193A0F2ABAA467FB4E
	 */
	struct UUI_Lobby_C_OnClicked_17E242CE41A468193A0F2ABAA467FB4E_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_FB41BFE74929284953ED1689891C00D8
	 */
	struct UUI_Lobby_C_OnClicked_FB41BFE74929284953ED1689891C00D8_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_76DE8A2C4726CE080F5757BC97F340BE
	 */
	struct UUI_Lobby_C_OnClicked_76DE8A2C4726CE080F5757BC97F340BE_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_1D97BCDA44613355D74D80AADD74D789
	 */
	struct UUI_Lobby_C_OnClicked_1D97BCDA44613355D74D80AADD74D789_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_CFFEF74A4B930F2AFBC0DEB413E104D5
	 */
	struct UUI_Lobby_C_OnClicked_CFFEF74A4B930F2AFBC0DEB413E104D5_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_76081BE44DFE4919891CB9A1DE0ADF9E
	 */
	struct UUI_Lobby_C_OnClicked_76081BE44DFE4919891CB9A1DE0ADF9E_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_1B963DEF482610A30075DBB24982F34D
	 */
	struct UUI_Lobby_C_OnClicked_1B963DEF482610A30075DBB24982F34D_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_4C0852A0443150E943BC1CB7EC70C855
	 */
	struct UUI_Lobby_C_OnClicked_4C0852A0443150E943BC1CB7EC70C855_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_57F3773442C57E91A832CA8D1E15BED9
	 */
	struct UUI_Lobby_C_OnClicked_57F3773442C57E91A832CA8D1E15BED9_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_0B0D5E0F4DAD8DA243A1B08C26309455
	 */
	struct UUI_Lobby_C_OnClicked_0B0D5E0F4DAD8DA243A1B08C26309455_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_DA83667C4A4B4CBA5C7B219B69B5F643
	 */
	struct UUI_Lobby_C_OnClicked_DA83667C4A4B4CBA5C7B219B69B5F643_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_BAE43A45400C92BCC171B5B255E74E44
	 */
	struct UUI_Lobby_C_OnClicked_BAE43A45400C92BCC171B5B255E74E44_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_56268D494C218EABDDED418A42AF7D33
	 */
	struct UUI_Lobby_C_OnClicked_56268D494C218EABDDED418A42AF7D33_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_603FA9B748269E3788F483B02273AD4E
	 */
	struct UUI_Lobby_C_OnClicked_603FA9B748269E3788F483B02273AD4E_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_BE2421D74FFDBD27B68A24B32AD8B215
	 */
	struct UUI_Lobby_C_OnClicked_BE2421D74FFDBD27B68A24B32AD8B215_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_2DDC8A3C4D6BC27D850FACA8C82F07F4
	 */
	struct UUI_Lobby_C_OnClicked_2DDC8A3C4D6BC27D850FACA8C82F07F4_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_72C29EDF4DB4B5D710B6278435BF38D4
	 */
	struct UUI_Lobby_C_OnClicked_72C29EDF4DB4B5D710B6278435BF38D4_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnBackKey
	 */
	struct UUI_Lobby_C_OnBackKey_Params
	{
	public:
		EWidgetBackKeyType                                         BackKeyType;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnSolarUIClosed
	 */
	struct UUI_Lobby_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnSolarUIOpened
	 */
	struct UUI_Lobby_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.Destruct
	 */
	struct UUI_Lobby_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnHide
	 */
	struct UUI_Lobby_C_OnHide_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnShow
	 */
	struct UUI_Lobby_C_OnShow_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnInitialized
	 */
	struct UUI_Lobby_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnAnimationFinished
	 */
	struct UUI_Lobby_C_OnAnimationFinished_Params
	{
	public:
		class UWidgetAnimation*                                    Animation;                                               // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ConstructCopy
	 */
	struct UUI_Lobby_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.GetModuleName
	 */
	struct UUI_Lobby_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.SetLevel
	 */
	struct UUI_Lobby_C_SetLevel_Params
	{
	public:
		int32_t                                                    Level;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.GetAnimTargetLocation
	 */
	struct UUI_Lobby_C_GetAnimTargetLocation_Params
	{
	public:
		class UWidget*                                             TargetObject;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UWidget*                                             UserObject;                                              // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FVector2D                                           TargetLocation;                                          // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.PreConstruct
	 */
	struct UUI_Lobby_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.Construct
	 */
	struct UUI_Lobby_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ReceiveShow
	 */
	struct UUI_Lobby_C_ReceiveShow_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ExecuteUbergraph_UI_Lobby
	 */
	struct UUI_Lobby_C_ExecuteUbergraph_UI_Lobby_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_A487[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
