#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_B0699F7442820A48D6D646BC6E6791A5
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_B0699F7442820A48D6D646BC6E6791A5_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_6EC4B20B4BA8B73B386CB8A2C93A0592
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_6EC4B20B4BA8B73B386CB8A2C93A0592_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_F7D78B74437C33EA2210B094501CCC13
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_F7D78B74437C33EA2210B094501CCC13_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_770F78E04DDFB19A88DE81ABCC1AD36D
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_770F78E04DDFB19A88DE81ABCC1AD36D_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_1B6C90D3467D0214D627FC9D0AF4BF71
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_1B6C90D3467D0214D627FC9D0AF4BF71_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_8F970EC74BF554C28BF21B8C30364935
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_8F970EC74BF554C28BF21B8C30364935_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_C0736CCF45EEDB36E6BB86993381036C
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_C0736CCF45EEDB36E6BB86993381036C_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_3054E1EB41EF28330EBF5FA55C489959
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_3054E1EB41EF28330EBF5FA55C489959_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnInitialized
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.Destruct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.ConstructCopy
	 */
	struct UUI_Lobby_TeamMember_Operation_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.GetModuleName
	 */
	struct UUI_Lobby_TeamMember_Operation_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetHD_Params
	{
	public:
		bool                                                       IsHD;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_W68F[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetStateQuitHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetStateQuitHD_Params
	{
	public:
		E_Type_State_Desktop                                       StateQuitHD;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetStatePlayernameHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetStatePlayernameHD_Params
	{
	public:
		E_Type_State_Desktop                                       StatePlayernameHD;                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.PreConstruct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.Construct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.ExecuteUbergraph_UI_Lobby_TeamMember_Operation
	 */
	struct UUI_Lobby_TeamMember_Operation_C_ExecuteUbergraph_UI_Lobby_TeamMember_Operation_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
