#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.OnClicked_B8F83EDD4AD4524B8793E4AB9AF525AE
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_OnClicked_B8F83EDD4AD4524B8793E4AB9AF525AE_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.OnClicked_F9D6D86245E381E1E5A5F3B03D8BF523
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_OnClicked_F9D6D86245E381E1E5A5F3B03D8BF523_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.OnClicked_B33CD8E3433A64C2EDD897A47C18C314
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_OnClicked_B33CD8E3433A64C2EDD897A47C18C314_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.Destruct
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.Construct
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.GetModuleName
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.Update_Btn
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_Update_Btn_Params
	{
	public:
		ET_Type_Button                                             NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.SetType
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_SetType_Params
	{
	public:
		ET_Type_System_Push                                        Type;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.PreConstruct
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.ExecuteUbergraph_UI_Lobby_RoomInvite_MIni_Popup
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_ExecuteUbergraph_UI_Lobby_RoomInvite_MIni_Popup_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
