#pragma once

/**
 * Name: FL84
 * Version: 1.15.1.6
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnRegisterEvent_CA4C542D490BBB03B4116B9DC6180AA7
	 */
	struct UUI_Lobby_C_OnRegisterEvent_CA4C542D490BBB03B4116B9DC6180AA7_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_76B25F234E4ECDFC134800BBB4E7CDDA
	 */
	struct UUI_Lobby_C_OnClicked_76B25F234E4ECDFC134800BBB4E7CDDA_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_C14744E147358D63A8AE3B997B88D9D3
	 */
	struct UUI_Lobby_C_OnClicked_C14744E147358D63A8AE3B997B88D9D3_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_BA11F8A94D0495DB740C9586726E8274
	 */
	struct UUI_Lobby_C_OnClicked_BA11F8A94D0495DB740C9586726E8274_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_8EBB4EF34DC936A89F88A0A08FC797C8
	 */
	struct UUI_Lobby_C_OnClicked_8EBB4EF34DC936A89F88A0A08FC797C8_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_B8E6B60C4BFEC427AEDF759D75F5A406
	 */
	struct UUI_Lobby_C_OnClicked_B8E6B60C4BFEC427AEDF759D75F5A406_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_CFB6752B49F7950B22C26DA6A7604E21
	 */
	struct UUI_Lobby_C_OnClicked_CFB6752B49F7950B22C26DA6A7604E21_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_D836FD314A472FF6D2FC839E1E341530
	 */
	struct UUI_Lobby_C_OnClicked_D836FD314A472FF6D2FC839E1E341530_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_10A9E8E944B53768494ED8A8D7B5F7D8
	 */
	struct UUI_Lobby_C_OnClicked_10A9E8E944B53768494ED8A8D7B5F7D8_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_399E67F0462EA4E270B372B463985951
	 */
	struct UUI_Lobby_C_OnClicked_399E67F0462EA4E270B372B463985951_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_0D90C6894227E7192F37409AB780D0A8
	 */
	struct UUI_Lobby_C_OnClicked_0D90C6894227E7192F37409AB780D0A8_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnBrowserClosed_793AA2A143830DEF162C2B8CCB90066E
	 */
	struct UUI_Lobby_C_OnBrowserClosed_793AA2A143830DEF162C2B8CCB90066E_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnBtnNetBarClicked_63AD1A324C9BE19765A32F90E66DA54E
	 */
	struct UUI_Lobby_C_OnBtnNetBarClicked_63AD1A324C9BE19765A32F90E66DA54E_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_33C0775F486247024B9E03B69A8EBECE
	 */
	struct UUI_Lobby_C_OnClicked_33C0775F486247024B9E03B69A8EBECE_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_FA2FC57742245DE56FDA2399E1D3ED5B
	 */
	struct UUI_Lobby_C_OnClicked_FA2FC57742245DE56FDA2399E1D3ED5B_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_F26A0CCC4E4ADE2DEC2BC9861227EBA1
	 */
	struct UUI_Lobby_C_OnClicked_F26A0CCC4E4ADE2DEC2BC9861227EBA1_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnCheckStateChanged_8F5557C94EF7ABB9D8FC3A9BD9658154
	 */
	struct UUI_Lobby_C_OnCheckStateChanged_8F5557C94EF7ABB9D8FC3A9BD9658154_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_7A3DC5B342B555FC080174AE92E4C87E
	 */
	struct UUI_Lobby_C_OnClicked_7A3DC5B342B555FC080174AE92E4C87E_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_5359B0C14B3536282183A993C4EEFF04
	 */
	struct UUI_Lobby_C_OnClicked_5359B0C14B3536282183A993C4EEFF04_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_BCCE845F46D395A389A6AC874660A2FC
	 */
	struct UUI_Lobby_C_OnClicked_BCCE845F46D395A389A6AC874660A2FC_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_EABD438241B056F171D71F830F80F4BF
	 */
	struct UUI_Lobby_C_OnClicked_EABD438241B056F171D71F830F80F4BF_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_BE67EC1B46BB8FE59CC6A8B8EAEAF2CF
	 */
	struct UUI_Lobby_C_OnClicked_BE67EC1B46BB8FE59CC6A8B8EAEAF2CF_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_DDA7BAFC45F557B98FFDD4873532279B
	 */
	struct UUI_Lobby_C_OnClicked_DDA7BAFC45F557B98FFDD4873532279B_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_C6B8D9EE43814D28796A14BADF82D4B3
	 */
	struct UUI_Lobby_C_OnClicked_C6B8D9EE43814D28796A14BADF82D4B3_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_3D266F514192EC7144C1DCBCF2E0E7C4
	 */
	struct UUI_Lobby_C_OnClicked_3D266F514192EC7144C1DCBCF2E0E7C4_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_5235AC05406577848DB5D59399E722FA
	 */
	struct UUI_Lobby_C_OnClicked_5235AC05406577848DB5D59399E722FA_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_E1D866DB48B4962065F462AA8151DBDB
	 */
	struct UUI_Lobby_C_OnClicked_E1D866DB48B4962065F462AA8151DBDB_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_2D9DF9BD426F153761D7D39523019A38
	 */
	struct UUI_Lobby_C_OnClicked_2D9DF9BD426F153761D7D39523019A38_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_5409830E445679E6C885D8AE34EF0ED6
	 */
	struct UUI_Lobby_C_OnClicked_5409830E445679E6C885D8AE34EF0ED6_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_A926D46645AF948DCC7238A715080E3E
	 */
	struct UUI_Lobby_C_OnClicked_A926D46645AF948DCC7238A715080E3E_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_17AF56304AA3173368D94DA6E7C8FC1E
	 */
	struct UUI_Lobby_C_OnClicked_17AF56304AA3173368D94DA6E7C8FC1E_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_129A50FA47390C7B20B4DDA134B7ADD9
	 */
	struct UUI_Lobby_C_OnClicked_129A50FA47390C7B20B4DDA134B7ADD9_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_B58F63404A8B257897B0E68FC66DB6F7
	 */
	struct UUI_Lobby_C_OnClicked_B58F63404A8B257897B0E68FC66DB6F7_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_769617B44B93EE33CE9DA8AC1FFE04AC
	 */
	struct UUI_Lobby_C_OnClicked_769617B44B93EE33CE9DA8AC1FFE04AC_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_F0392453405AA66270DA1EB760750118
	 */
	struct UUI_Lobby_C_OnClicked_F0392453405AA66270DA1EB760750118_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_1CFE7225458519D783BE478C71369E4B
	 */
	struct UUI_Lobby_C_OnClicked_1CFE7225458519D783BE478C71369E4B_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnInitialized
	 */
	struct UUI_Lobby_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ConstructCopy
	 */
	struct UUI_Lobby_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnAnimationFinished
	 */
	struct UUI_Lobby_C_OnAnimationFinished_Params
	{
	public:
		class UWidgetAnimation*                                    Animation;                                               // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnHide
	 */
	struct UUI_Lobby_C_OnHide_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnShow
	 */
	struct UUI_Lobby_C_OnShow_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnSolarUIOpened
	 */
	struct UUI_Lobby_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnBackKey
	 */
	struct UUI_Lobby_C_OnBackKey_Params
	{
	public:
		EWidgetBackKeyType                                         BackKeyType;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnSolarUIClosed
	 */
	struct UUI_Lobby_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.Destruct
	 */
	struct UUI_Lobby_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.GetModuleName
	 */
	struct UUI_Lobby_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.SetLevel
	 */
	struct UUI_Lobby_C_SetLevel_Params
	{
	public:
		int32_t                                                    Level;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.GetAnimTargetLocation
	 */
	struct UUI_Lobby_C_GetAnimTargetLocation_Params
	{
	public:
		class UWidget*                                             TargetObject;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UWidget*                                             UserObject;                                              // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FVector2D                                           TargetLocation;                                          // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.PreConstruct
	 */
	struct UUI_Lobby_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.Construct
	 */
	struct UUI_Lobby_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ReceiveShow
	 */
	struct UUI_Lobby_C_ReceiveShow_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ExecuteUbergraph_UI_Lobby
	 */
	struct UUI_Lobby_C_ExecuteUbergraph_UI_Lobby_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_J9OO[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
