#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_A776C32643E1EF4A17FCFEB9F8B06413
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_A776C32643E1EF4A17FCFEB9F8B06413_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_80A7CC814C20FB086B2E0F8B75A5108B
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_80A7CC814C20FB086B2E0F8B75A5108B_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_D4CB9F8442E5EF2DF16E2FA9611B992A
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_D4CB9F8442E5EF2DF16E2FA9611B992A_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_0DD8D9904C37C371CC668A83299AB3B0
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_0DD8D9904C37C371CC668A83299AB3B0_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_D2B132814D09E3DD533976AAA23D0D2A
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_D2B132814D09E3DD533976AAA23D0D2A_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_E3B348724BFA128BE80987829971C7E3
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_E3B348724BFA128BE80987829971C7E3_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_B4B055DD45E3B426C3B491A9F559A6D5
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_B4B055DD45E3B426C3B491A9F559A6D5_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Destruct
	 */
	struct UUI_Lobby_StartBtn_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnSolarUIOpened
	 */
	struct UUI_Lobby_StartBtn_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnSolarUIClosed
	 */
	struct UUI_Lobby_StartBtn_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.ConstructCopy
	 */
	struct UUI_Lobby_StartBtn_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.GetModuleName
	 */
	struct UUI_Lobby_StartBtn_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.SetStateDesktop
	 */
	struct UUI_Lobby_StartBtn_C_SetStateDesktop_Params
	{
	public:
		E_Type_State_Desktop                                       StateDesktopStart;                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       IsDesktop;                                               // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.UpdatePlatformBlendState
	 */
	struct UUI_Lobby_StartBtn_C_UpdatePlatformBlendState_Params
	{
	public:
		bool                                                       NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.UpdatePanelState
	 */
	struct UUI_Lobby_StartBtn_C_UpdatePanelState_Params
	{
	public:
		bool                                                       Leader;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Matching;                                                // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Ready;                                                   // 0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Disable;                                                 // 0x0003(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Update All Widgets
	 */
	struct UUI_Lobby_StartBtn_C_UpdateAllWidgets_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.PreConstruct
	 */
	struct UUI_Lobby_StartBtn_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Construct
	 */
	struct UUI_Lobby_StartBtn_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.ExecuteUbergraph_UI_Lobby_StartBtn
	 */
	struct UUI_Lobby_StartBtn_C_ExecuteUbergraph_UI_Lobby_StartBtn_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
