#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnRegisterEvent_D6078DC34798213D802961A3E4BF2670
	 */
	struct UUI_Lobby_C_OnRegisterEvent_D6078DC34798213D802961A3E4BF2670_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_5C12F9634904B83B222D9BAAE009DE9F
	 */
	struct UUI_Lobby_C_OnClicked_5C12F9634904B83B222D9BAAE009DE9F_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_7502C96A4442B37187234480DEDD5B85
	 */
	struct UUI_Lobby_C_OnClicked_7502C96A4442B37187234480DEDD5B85_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_0216656E427FE11DBD5565AC7CFD4D25
	 */
	struct UUI_Lobby_C_OnClicked_0216656E427FE11DBD5565AC7CFD4D25_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_B8D6372D493E328119F0F0873E0E377B
	 */
	struct UUI_Lobby_C_OnClicked_B8D6372D493E328119F0F0873E0E377B_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_210C09CA4D7B71090D46E4B8A6E330B8
	 */
	struct UUI_Lobby_C_OnClicked_210C09CA4D7B71090D46E4B8A6E330B8_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_3226560F42297971A30C8B9484540A88
	 */
	struct UUI_Lobby_C_OnClicked_3226560F42297971A30C8B9484540A88_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_FD55193E4A3E8680F399B5A72BFDBC96
	 */
	struct UUI_Lobby_C_OnClicked_FD55193E4A3E8680F399B5A72BFDBC96_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_E1A171914A137589CBE857BC61089335
	 */
	struct UUI_Lobby_C_OnClicked_E1A171914A137589CBE857BC61089335_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_282FF95749788FBCC8F5DFB84DC50278
	 */
	struct UUI_Lobby_C_OnClicked_282FF95749788FBCC8F5DFB84DC50278_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_1F17666342DE6D75538A98AD0D989ABB
	 */
	struct UUI_Lobby_C_OnClicked_1F17666342DE6D75538A98AD0D989ABB_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnBrowserClosed_C28141964FF0E9A6458E278CD9C21BD3
	 */
	struct UUI_Lobby_C_OnBrowserClosed_C28141964FF0E9A6458E278CD9C21BD3_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnBtnNetBarClicked_20ED363A467B5026CB7640B349DED1A3
	 */
	struct UUI_Lobby_C_OnBtnNetBarClicked_20ED363A467B5026CB7640B349DED1A3_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_62A4169A4D392ECA3DA25E88C121CC42
	 */
	struct UUI_Lobby_C_OnClicked_62A4169A4D392ECA3DA25E88C121CC42_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_E25E3F8F4F3AC60822D007BDCFCFE33A
	 */
	struct UUI_Lobby_C_OnClicked_E25E3F8F4F3AC60822D007BDCFCFE33A_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_E70CF8ED40507E90130D4D97C034D220
	 */
	struct UUI_Lobby_C_OnClicked_E70CF8ED40507E90130D4D97C034D220_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnCheckStateChanged_B9D1F08D46CE58441346A18AEB9012BC
	 */
	struct UUI_Lobby_C_OnCheckStateChanged_B9D1F08D46CE58441346A18AEB9012BC_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_E44804F24D19A73239C4CDA9E83F5F27
	 */
	struct UUI_Lobby_C_OnClicked_E44804F24D19A73239C4CDA9E83F5F27_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_CA551E9C4E01BA4EBBC1FBBD6B09AD80
	 */
	struct UUI_Lobby_C_OnClicked_CA551E9C4E01BA4EBBC1FBBD6B09AD80_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_B37C57084BCB355DF369A1B12736A51B
	 */
	struct UUI_Lobby_C_OnClicked_B37C57084BCB355DF369A1B12736A51B_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_A7368C6D4F9E2D1478BD2EA325E9000D
	 */
	struct UUI_Lobby_C_OnClicked_A7368C6D4F9E2D1478BD2EA325E9000D_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_5557E44B404A2D0BB6B81F809DFC503A
	 */
	struct UUI_Lobby_C_OnClicked_5557E44B404A2D0BB6B81F809DFC503A_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_810540264A5F36CD562DC4A23B271908
	 */
	struct UUI_Lobby_C_OnClicked_810540264A5F36CD562DC4A23B271908_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_518582D443689F1E23E9EC95912DE1E5
	 */
	struct UUI_Lobby_C_OnClicked_518582D443689F1E23E9EC95912DE1E5_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_5AA3AD3F4C485976BF9C2AB129957C1A
	 */
	struct UUI_Lobby_C_OnClicked_5AA3AD3F4C485976BF9C2AB129957C1A_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_30148FB94AF543C6EE905FA754FA925D
	 */
	struct UUI_Lobby_C_OnClicked_30148FB94AF543C6EE905FA754FA925D_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_6A17532744579A31A9CAC59B7D972A80
	 */
	struct UUI_Lobby_C_OnClicked_6A17532744579A31A9CAC59B7D972A80_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_48F7468A446442F7ED764889B858C515
	 */
	struct UUI_Lobby_C_OnClicked_48F7468A446442F7ED764889B858C515_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_F58F07D248A6692A4E53A5BFC4D584AC
	 */
	struct UUI_Lobby_C_OnClicked_F58F07D248A6692A4E53A5BFC4D584AC_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_DAF3B915430D00492C2CEE932E71C279
	 */
	struct UUI_Lobby_C_OnClicked_DAF3B915430D00492C2CEE932E71C279_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_FCFE69174C841BC714F3BE95C85F8242
	 */
	struct UUI_Lobby_C_OnClicked_FCFE69174C841BC714F3BE95C85F8242_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_2EE3C350477B756A1EB552AE3034DD02
	 */
	struct UUI_Lobby_C_OnClicked_2EE3C350477B756A1EB552AE3034DD02_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_E19BDFE74B822B63C20E6489FAC60325
	 */
	struct UUI_Lobby_C_OnClicked_E19BDFE74B822B63C20E6489FAC60325_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_BAF3203D440479789B4DD5A4C0CE8A17
	 */
	struct UUI_Lobby_C_OnClicked_BAF3203D440479789B4DD5A4C0CE8A17_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_6363C00D4128A86EC09BF882B03E0AEB
	 */
	struct UUI_Lobby_C_OnClicked_6363C00D4128A86EC09BF882B03E0AEB_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_288A42744F4C62424A36FBA748F8A0A8
	 */
	struct UUI_Lobby_C_OnClicked_288A42744F4C62424A36FBA748F8A0A8_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnAnimationFinished
	 */
	struct UUI_Lobby_C_OnAnimationFinished_Params
	{
	public:
		class UWidgetAnimation*                                    Animation;                                               // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnSolarUIOpened
	 */
	struct UUI_Lobby_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.Destruct
	 */
	struct UUI_Lobby_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnBackKey
	 */
	struct UUI_Lobby_C_OnBackKey_Params
	{
	public:
		EWidgetBackKeyType                                         BackKeyType;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnInitialized
	 */
	struct UUI_Lobby_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ConstructCopy
	 */
	struct UUI_Lobby_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnShow
	 */
	struct UUI_Lobby_C_OnShow_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnHide
	 */
	struct UUI_Lobby_C_OnHide_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnSolarUIClosed
	 */
	struct UUI_Lobby_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.GetModuleName
	 */
	struct UUI_Lobby_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.SetLevel
	 */
	struct UUI_Lobby_C_SetLevel_Params
	{
	public:
		int32_t                                                    Level;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.GetAnimTargetLocation
	 */
	struct UUI_Lobby_C_GetAnimTargetLocation_Params
	{
	public:
		class UWidget*                                             TargetObject;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UWidget*                                             UserObject;                                              // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FVector2D                                           TargetLocation;                                          // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.PreConstruct
	 */
	struct UUI_Lobby_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.Construct
	 */
	struct UUI_Lobby_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ReceiveShow
	 */
	struct UUI_Lobby_C_ReceiveShow_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ExecuteUbergraph_UI_Lobby
	 */
	struct UUI_Lobby_C_ExecuteUbergraph_UI_Lobby_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_CSHB[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
