#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Delegate_E10E804242E41C24547A9085B8CA03D0
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Delegate_E10E804242E41C24547A9085B8CA03D0_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.OnClicked_BE6C2E0842D90957D3E82EB3B0880014
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_OnClicked_BE6C2E0842D90957D3E82EB3B0880014_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.OnClicked_F38AC1AB4CE67AB75D9131AA5A775A31
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_OnClicked_F38AC1AB4CE67AB75D9131AA5A775A31_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.OnClicked_1217C7F04BEAA850E33699B003FC39C0
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_OnClicked_1217C7F04BEAA850E33699B003FC39C0_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Construct
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Destruct
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.GetModuleName
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Update_Btn
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Update_Btn_Params
	{
	public:
		ET_Type_Button                                             NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.SetType
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_SetType_Params
	{
	public:
		ET_Type_System_Push                                        NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.PreConstruct
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.ExecuteUbergraph_UI_Lobby_RoomInvite_Popup
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_ExecuteUbergraph_UI_Lobby_RoomInvite_Popup_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
