#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_91C89FBB43B1A444D589C19C08B12B39
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_91C89FBB43B1A444D589C19C08B12B39_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_7CA735FE4E5E7980A740AD86F4A2AB04
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_7CA735FE4E5E7980A740AD86F4A2AB04_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_ECB361C44DEEF64B0BE49DBBF912FDF1
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_ECB361C44DEEF64B0BE49DBBF912FDF1_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_D437528E4183F3C27EA70A9FFD4C16CB
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_D437528E4183F3C27EA70A9FFD4C16CB_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_651CFFB74F45905A25AB2F8AB82B5558
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_651CFFB74F45905A25AB2F8AB82B5558_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_860A5CE54930F62AE119DF986E670B97
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_860A5CE54930F62AE119DF986E670B97_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_0032978A4DFB9EE2D5F1C5B9B17DBA8B
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_0032978A4DFB9EE2D5F1C5B9B17DBA8B_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnClicked_D2CE4CA6408754616C1F5FA56DFDD040
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnClicked_D2CE4CA6408754616C1F5FA56DFDD040_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.Destruct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.OnInitialized
	 */
	struct UUI_Lobby_TeamMember_Operation_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.ConstructCopy
	 */
	struct UUI_Lobby_TeamMember_Operation_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.GetModuleName
	 */
	struct UUI_Lobby_TeamMember_Operation_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetHD_Params
	{
	public:
		bool                                                       IsHD;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_D9BF[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetStateQuitHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetStateQuitHD_Params
	{
	public:
		E_Type_State_Desktop                                       StateQuitHD;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.SetStatePlayernameHD
	 */
	struct UUI_Lobby_TeamMember_Operation_C_SetStatePlayernameHD_Params
	{
	public:
		E_Type_State_Desktop                                       StatePlayernameHD;                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.PreConstruct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.Construct
	 */
	struct UUI_Lobby_TeamMember_Operation_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_TeamMember_Operation.UI_Lobby_TeamMember_Operation_C.ExecuteUbergraph_UI_Lobby_TeamMember_Operation
	 */
	struct UUI_Lobby_TeamMember_Operation_C_ExecuteUbergraph_UI_Lobby_TeamMember_Operation_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
