#pragma once

/**
 * Name: FL84
 * Version: 1.15.1.6
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Delegate_7EB6874348A8CC23152D51ACBEA98A4F
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Delegate_7EB6874348A8CC23152D51ACBEA98A4F_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.OnClicked_49D2DA5841C359A411E2A391A32DD556
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_OnClicked_49D2DA5841C359A411E2A391A32DD556_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.OnClicked_2B316B914E2536BAADDCB8824259B192
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_OnClicked_2B316B914E2536BAADDCB8824259B192_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.OnClicked_E9B7008C4B33FE81FCDF76943C062670
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_OnClicked_E9B7008C4B33FE81FCDF76943C062670_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Construct
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Destruct
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.GetModuleName
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Update_Btn
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Update_Btn_Params
	{
	public:
		ET_Type_Button                                             NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.SetType
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_SetType_Params
	{
	public:
		ET_Type_System_Push                                        NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.PreConstruct
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.ExecuteUbergraph_UI_Lobby_RoomInvite_Popup
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_ExecuteUbergraph_UI_Lobby_RoomInvite_Popup_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
