#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_9810337B4848410C325E4BB8A05E1F0B
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_9810337B4848410C325E4BB8A05E1F0B_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_75752A4A43533465D2C1BBA58AB945B5
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_75752A4A43533465D2C1BBA58AB945B5_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_913A88E849C725C1A5DE1CB2F49C05C7
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_913A88E849C725C1A5DE1CB2F49C05C7_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_B13E006746909034205AE4BC813A3853
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_B13E006746909034205AE4BC813A3853_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_8E7F29F54A331884FC6257A41031F872
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_8E7F29F54A331884FC6257A41031F872_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_CA97B00D4C16620C831B66A5A5D90CF6
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_CA97B00D4C16620C831B66A5A5D90CF6_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_76A6C3AA485FB16E2094D0A53F547A32
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_76A6C3AA485FB16E2094D0A53F547A32_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Destruct
	 */
	struct UUI_Lobby_StartBtn_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.ConstructCopy
	 */
	struct UUI_Lobby_StartBtn_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnSolarUIOpened
	 */
	struct UUI_Lobby_StartBtn_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnSolarUIClosed
	 */
	struct UUI_Lobby_StartBtn_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.GetModuleName
	 */
	struct UUI_Lobby_StartBtn_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.SetStateDesktop
	 */
	struct UUI_Lobby_StartBtn_C_SetStateDesktop_Params
	{
	public:
		E_Type_State_Desktop                                       StateDesktopStart;                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       IsDesktop;                                               // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.UpdatePlatformBlendState
	 */
	struct UUI_Lobby_StartBtn_C_UpdatePlatformBlendState_Params
	{
	public:
		bool                                                       NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.UpdatePanelState
	 */
	struct UUI_Lobby_StartBtn_C_UpdatePanelState_Params
	{
	public:
		bool                                                       Leader;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Matching;                                                // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Ready;                                                   // 0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Disable;                                                 // 0x0003(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Update All Widgets
	 */
	struct UUI_Lobby_StartBtn_C_UpdateAllWidgets_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.PreConstruct
	 */
	struct UUI_Lobby_StartBtn_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Construct
	 */
	struct UUI_Lobby_StartBtn_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.ExecuteUbergraph_UI_Lobby_StartBtn
	 */
	struct UUI_Lobby_StartBtn_C_ExecuteUbergraph_UI_Lobby_StartBtn_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
