#pragma once

/**
 * Name: FL84
 * Version: 1.15.1.6
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_E708C9A84FD17DEA366718BB1BAF677B
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_E708C9A84FD17DEA366718BB1BAF677B_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_AB90CD0549CCD21CE01154977D18AD82
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_AB90CD0549CCD21CE01154977D18AD82_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_089E1C274596ECFEF85E2BADC72C27E3
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_089E1C274596ECFEF85E2BADC72C27E3_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_F032B1584C60DCB14D75DD9D07B6A12C
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_F032B1584C60DCB14D75DD9D07B6A12C_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_6F04D16A4CF8E3E4F66A75859A7C0142
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_6F04D16A4CF8E3E4F66A75859A7C0142_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_714A273F4250B868A44DE984D10B6037
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_714A273F4250B868A44DE984D10B6037_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_8387045A449D7275EE6054A293DEF923
	 */
	struct UUI_Lobby_StartBtn_C_OnClicked_8387045A449D7275EE6054A293DEF923_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Destruct
	 */
	struct UUI_Lobby_StartBtn_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnSolarUIOpened
	 */
	struct UUI_Lobby_StartBtn_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.ConstructCopy
	 */
	struct UUI_Lobby_StartBtn_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnSolarUIClosed
	 */
	struct UUI_Lobby_StartBtn_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.GetModuleName
	 */
	struct UUI_Lobby_StartBtn_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.SetStateDesktop
	 */
	struct UUI_Lobby_StartBtn_C_SetStateDesktop_Params
	{
	public:
		E_Type_State_Desktop                                       StateDesktopStart;                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       IsDesktop;                                               // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.UpdatePlatformBlendState
	 */
	struct UUI_Lobby_StartBtn_C_UpdatePlatformBlendState_Params
	{
	public:
		bool                                                       NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.UpdatePanelState
	 */
	struct UUI_Lobby_StartBtn_C_UpdatePanelState_Params
	{
	public:
		bool                                                       Leader;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Matching;                                                // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Ready;                                                   // 0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Disable;                                                 // 0x0003(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Update All Widgets
	 */
	struct UUI_Lobby_StartBtn_C_UpdateAllWidgets_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.PreConstruct
	 */
	struct UUI_Lobby_StartBtn_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Construct
	 */
	struct UUI_Lobby_StartBtn_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.ExecuteUbergraph_UI_Lobby_StartBtn
	 */
	struct UUI_Lobby_StartBtn_C_ExecuteUbergraph_UI_Lobby_StartBtn_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
