#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Delegate_257BA2E4401D20AEF310968CC4EE53D9
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Delegate_257BA2E4401D20AEF310968CC4EE53D9_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.OnClicked_A1D0FCCF4892234C795311B8817A78FE
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_OnClicked_A1D0FCCF4892234C795311B8817A78FE_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.OnClicked_46E616AD487DEAF1E1461B96E3AE8E87
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_OnClicked_46E616AD487DEAF1E1461B96E3AE8E87_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.OnClicked_36FB118F4F2F59E29F990D927862CC21
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_OnClicked_36FB118F4F2F59E29F990D927862CC21_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Destruct
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Construct
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.GetModuleName
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Update_Btn
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_Update_Btn_Params
	{
	public:
		ET_Type_Button                                             NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.SetType
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_SetType_Params
	{
	public:
		ET_Type_System_Push                                        NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.PreConstruct
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.ExecuteUbergraph_UI_Lobby_RoomInvite_Popup
	 */
	struct UUI_Lobby_RoomInvite_Popup_C_ExecuteUbergraph_UI_Lobby_RoomInvite_Popup_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
