#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.OnClicked_B5A36A8B490D1E4DFABE44BE8AA7DA70
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_OnClicked_B5A36A8B490D1E4DFABE44BE8AA7DA70_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.OnClicked_00868CDE49C0C5982DC1A89F1054F6F0
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_OnClicked_00868CDE49C0C5982DC1A89F1054F6F0_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.OnClicked_E9F0DAC84A9216E0A4AEEB9123E2EA56
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_OnClicked_E9F0DAC84A9216E0A4AEEB9123E2EA56_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.Construct
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.Destruct
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.GetModuleName
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.Update_Btn
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_Update_Btn_Params
	{
	public:
		ET_Type_Button                                             NewParam;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.SetType
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_SetType_Params
	{
	public:
		ET_Type_System_Push                                        Type;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.PreConstruct
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.ExecuteUbergraph_UI_Lobby_RoomInvite_MIni_Popup
	 */
	struct UUI_Lobby_RoomInvite_MIni_Popup_C_ExecuteUbergraph_UI_Lobby_RoomInvite_MIni_Popup_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
