#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnRegisterEvent_3ADD7F004680A8653ABB109BA7461FDC
	 */
	struct UUI_Lobby_C_OnRegisterEvent_3ADD7F004680A8653ABB109BA7461FDC_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_C41C65554266E70CF5042CBACAF4B305
	 */
	struct UUI_Lobby_C_OnClicked_C41C65554266E70CF5042CBACAF4B305_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_1CD5D2BE47E40D85F40B6E981FD0C8DF
	 */
	struct UUI_Lobby_C_OnClicked_1CD5D2BE47E40D85F40B6E981FD0C8DF_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_2C2069F9429AB2171EACE0BDA3EABB37
	 */
	struct UUI_Lobby_C_OnClicked_2C2069F9429AB2171EACE0BDA3EABB37_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_051039E743F663EED03B2EB6471A9F83
	 */
	struct UUI_Lobby_C_OnClicked_051039E743F663EED03B2EB6471A9F83_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_D845C33241A21A00501343A0A709F854
	 */
	struct UUI_Lobby_C_OnClicked_D845C33241A21A00501343A0A709F854_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_EAC114994F0B920B88A1718C39C16AFF
	 */
	struct UUI_Lobby_C_OnClicked_EAC114994F0B920B88A1718C39C16AFF_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_B814192541DEB35CA11121904D9244D4
	 */
	struct UUI_Lobby_C_OnClicked_B814192541DEB35CA11121904D9244D4_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_7AFADAB04FFB34572F94D790B894C578
	 */
	struct UUI_Lobby_C_OnClicked_7AFADAB04FFB34572F94D790B894C578_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_C9CA2D844789E501D1FFA3867CF1765D
	 */
	struct UUI_Lobby_C_OnClicked_C9CA2D844789E501D1FFA3867CF1765D_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_7F0963E14D90634DD8D0DEB65A85DBF4
	 */
	struct UUI_Lobby_C_OnClicked_7F0963E14D90634DD8D0DEB65A85DBF4_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnBrowserClosed_9E216CCF42E6AD9E12BD8D98C4E5F057
	 */
	struct UUI_Lobby_C_OnBrowserClosed_9E216CCF42E6AD9E12BD8D98C4E5F057_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnBtnNetBarClicked_9B9EA19949BD3B4DBD574AAED4B2F514
	 */
	struct UUI_Lobby_C_OnBtnNetBarClicked_9B9EA19949BD3B4DBD574AAED4B2F514_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_5599082247D06FC88C7716A0D14DC07E
	 */
	struct UUI_Lobby_C_OnClicked_5599082247D06FC88C7716A0D14DC07E_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_ABB2EFAA45DA443993AFF5A5E90CA0BB
	 */
	struct UUI_Lobby_C_OnClicked_ABB2EFAA45DA443993AFF5A5E90CA0BB_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_AE5D82454B464B14690A1CB64A6B03D5
	 */
	struct UUI_Lobby_C_OnClicked_AE5D82454B464B14690A1CB64A6B03D5_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnCheckStateChanged_73763CD04632B5D99CBD5B9293143FB0
	 */
	struct UUI_Lobby_C_OnCheckStateChanged_73763CD04632B5D99CBD5B9293143FB0_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_E092EC714D3CC2BC2B2AAFA80E269664
	 */
	struct UUI_Lobby_C_OnClicked_E092EC714D3CC2BC2B2AAFA80E269664_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_70E6B3FE48572083F5CFC1AFA21A32F1
	 */
	struct UUI_Lobby_C_OnClicked_70E6B3FE48572083F5CFC1AFA21A32F1_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_27C7AFDA403A4EB2AD7C42B7BC49E976
	 */
	struct UUI_Lobby_C_OnClicked_27C7AFDA403A4EB2AD7C42B7BC49E976_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_A3F214A243BB26EFF633BBA9C04B6042
	 */
	struct UUI_Lobby_C_OnClicked_A3F214A243BB26EFF633BBA9C04B6042_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_9B59C10E4A7AD6F3FE472580898A226B
	 */
	struct UUI_Lobby_C_OnClicked_9B59C10E4A7AD6F3FE472580898A226B_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_02E121FA4AD1FE78BD6A1E8105F511A0
	 */
	struct UUI_Lobby_C_OnClicked_02E121FA4AD1FE78BD6A1E8105F511A0_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_C34295EB4B21E04DC095F6BCCAE14AB2
	 */
	struct UUI_Lobby_C_OnClicked_C34295EB4B21E04DC095F6BCCAE14AB2_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_7BB24BAB41B35FCFD1FBC5B52548CB20
	 */
	struct UUI_Lobby_C_OnClicked_7BB24BAB41B35FCFD1FBC5B52548CB20_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_3DBA3E5845963748D65ABD926975F075
	 */
	struct UUI_Lobby_C_OnClicked_3DBA3E5845963748D65ABD926975F075_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_0589870847538039F489E1BD79C7655D
	 */
	struct UUI_Lobby_C_OnClicked_0589870847538039F489E1BD79C7655D_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_628D4F564557D4EDFB3BF29C79C1C194
	 */
	struct UUI_Lobby_C_OnClicked_628D4F564557D4EDFB3BF29C79C1C194_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_7A8386AF41CA23D3ACD7A39A1B717CCA
	 */
	struct UUI_Lobby_C_OnClicked_7A8386AF41CA23D3ACD7A39A1B717CCA_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_8C033A104E23112EF6FFFA81D06C69A2
	 */
	struct UUI_Lobby_C_OnClicked_8C033A104E23112EF6FFFA81D06C69A2_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_A0DA40434A323DBB4407CCBD05A09C65
	 */
	struct UUI_Lobby_C_OnClicked_A0DA40434A323DBB4407CCBD05A09C65_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_80DEA50444A957C83E4FC4A34AA16EA9
	 */
	struct UUI_Lobby_C_OnClicked_80DEA50444A957C83E4FC4A34AA16EA9_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_E623E06C484623B6A869EABE10E6DB58
	 */
	struct UUI_Lobby_C_OnClicked_E623E06C484623B6A869EABE10E6DB58_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_528054EC414C9995F86ED49B5F148E5B
	 */
	struct UUI_Lobby_C_OnClicked_528054EC414C9995F86ED49B5F148E5B_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_C8A4DB4348FF74AF114DBF9D0E9A871E
	 */
	struct UUI_Lobby_C_OnClicked_C8A4DB4348FF74AF114DBF9D0E9A871E_Params
	{	};

	/**
	 * DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_F710EA144C39CFDB9D953BB3E091BC3A
	 */
	struct UUI_Lobby_C_OnClicked_F710EA144C39CFDB9D953BB3E091BC3A_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnSolarUIOpened
	 */
	struct UUI_Lobby_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnSolarUIClosed
	 */
	struct UUI_Lobby_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnInitialized
	 */
	struct UUI_Lobby_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnHide
	 */
	struct UUI_Lobby_C_OnHide_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnAnimationFinished
	 */
	struct UUI_Lobby_C_OnAnimationFinished_Params
	{
	public:
		class UWidgetAnimation*                                    Animation;                                               // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ConstructCopy
	 */
	struct UUI_Lobby_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnShow
	 */
	struct UUI_Lobby_C_OnShow_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.OnBackKey
	 */
	struct UUI_Lobby_C_OnBackKey_Params
	{
	public:
		EWidgetBackKeyType                                         BackKeyType;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.Destruct
	 */
	struct UUI_Lobby_C_Destruct_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.GetModuleName
	 */
	struct UUI_Lobby_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.SetLevel
	 */
	struct UUI_Lobby_C_SetLevel_Params
	{
	public:
		int32_t                                                    Level;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.GetAnimTargetLocation
	 */
	struct UUI_Lobby_C_GetAnimTargetLocation_Params
	{
	public:
		class UWidget*                                             TargetObject;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UWidget*                                             UserObject;                                              // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FVector2D                                           TargetLocation;                                          // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.PreConstruct
	 */
	struct UUI_Lobby_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.Construct
	 */
	struct UUI_Lobby_C_Construct_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ReceiveShow
	 */
	struct UUI_Lobby_C_ReceiveShow_Params
	{	};

	/**
	 * Function UI_Lobby.UI_Lobby_C.ExecuteUbergraph_UI_Lobby
	 */
	struct UUI_Lobby_C_ExecuteUbergraph_UI_Lobby_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_181W[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
