#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.OnMouseButtonDownEvent_4B58E0224142357CAB1CDEB00E5DFF9D
	 */
	struct UUI_MicroPhoneSetting_C_OnMouseButtonDownEvent_4B58E0224142357CAB1CDEB00E5DFF9D_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FPointerEvent                                       MouseEvent;                                              // 0x0038(0x0070)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.OnMouseButtonDownEvent_B9D5A2FE44D77356BD1A02A0742A8CC9
	 */
	struct UUI_MicroPhoneSetting_C_OnMouseButtonDownEvent_B9D5A2FE44D77356BD1A02A0742A8CC9_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FPointerEvent                                       MouseEvent;                                              // 0x0038(0x0070)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.OnStateChangedEvent_EF6964914BA6B627781E1EA75A87DDBA
	 */
	struct UUI_MicroPhoneSetting_C_OnStateChangedEvent_EF6964914BA6B627781E1EA75A87DDBA_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.OnStateChangedEvent_78A63FB4442408C9C3027CB75EAD4C7F
	 */
	struct UUI_MicroPhoneSetting_C_OnStateChangedEvent_78A63FB4442408C9C3027CB75EAD4C7F_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.Construct
	 */
	struct UUI_MicroPhoneSetting_C_Construct_Params
	{	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.Destruct
	 */
	struct UUI_MicroPhoneSetting_C_Destruct_Params
	{	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.GetModuleName
	 */
	struct UUI_MicroPhoneSetting_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.PreConstruct
	 */
	struct UUI_MicroPhoneSetting_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.ExecuteUbergraph_UI_MicroPhoneSetting
	 */
	struct UUI_MicroPhoneSetting_C_ExecuteUbergraph_UI_MicroPhoneSetting_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
