#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.OnCheckStateChanged_83FB3B8E45A4932D05C7289FDE85ADD4
	 */
	struct UUI_MicroPhoneOperation_Item_C_OnCheckStateChanged_83FB3B8E45A4932D05C7289FDE85ADD4_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.OnCheckStateChanged_EC9C8BD644D54C743E0989A8EDAD970C
	 */
	struct UUI_MicroPhoneOperation_Item_C_OnCheckStateChanged_EC9C8BD644D54C743E0989A8EDAD970C_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.OnCheckStateChanged_BFD3D68A4F1D8587B52D63AA15B66304
	 */
	struct UUI_MicroPhoneOperation_Item_C_OnCheckStateChanged_BFD3D68A4F1D8587B52D63AA15B66304_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.OnCheckStateChanged_254388B64B3B82C92B687EAADB0E173E
	 */
	struct UUI_MicroPhoneOperation_Item_C_OnCheckStateChanged_254388B64B3B82C92B687EAADB0E173E_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.Destruct
	 */
	struct UUI_MicroPhoneOperation_Item_C_Destruct_Params
	{	};

	/**
	 * Function UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.Construct
	 */
	struct UUI_MicroPhoneOperation_Item_C_Construct_Params
	{	};

	/**
	 * Function UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.GetModuleName
	 */
	struct UUI_MicroPhoneOperation_Item_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.SetOrder
	 */
	struct UUI_MicroPhoneOperation_Item_C_SetOrder_Params
	{
	public:
		int32_t                                                    OrderId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.PreConstruct
	 */
	struct UUI_MicroPhoneOperation_Item_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.ExecuteUbergraph_UI_MicroPhoneOperation_Item
	 */
	struct UUI_MicroPhoneOperation_Item_C_ExecuteUbergraph_UI_MicroPhoneOperation_Item_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
