#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.OnCheckStateChanged_FF1314C94D416A23B1E1D8B7E04AC124
	 */
	struct UUI_MicroPhoneOperation_Item_C_OnCheckStateChanged_FF1314C94D416A23B1E1D8B7E04AC124_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.OnCheckStateChanged_D7DE8844432689A4F122DBA4D3A41A5E
	 */
	struct UUI_MicroPhoneOperation_Item_C_OnCheckStateChanged_D7DE8844432689A4F122DBA4D3A41A5E_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.OnCheckStateChanged_23D7B3064C23DD4889E0438E5B224923
	 */
	struct UUI_MicroPhoneOperation_Item_C_OnCheckStateChanged_23D7B3064C23DD4889E0438E5B224923_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.OnCheckStateChanged_E04B8CCF46B440BB33725D88B3029DA0
	 */
	struct UUI_MicroPhoneOperation_Item_C_OnCheckStateChanged_E04B8CCF46B440BB33725D88B3029DA0_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.Construct
	 */
	struct UUI_MicroPhoneOperation_Item_C_Construct_Params
	{	};

	/**
	 * Function UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.Destruct
	 */
	struct UUI_MicroPhoneOperation_Item_C_Destruct_Params
	{	};

	/**
	 * Function UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.GetModuleName
	 */
	struct UUI_MicroPhoneOperation_Item_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.SetOrder
	 */
	struct UUI_MicroPhoneOperation_Item_C_SetOrder_Params
	{
	public:
		int32_t                                                    OrderId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.PreConstruct
	 */
	struct UUI_MicroPhoneOperation_Item_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_MicroPhoneOperation_Item.UI_MicroPhoneOperation_Item_C.ExecuteUbergraph_UI_MicroPhoneOperation_Item
	 */
	struct UUI_MicroPhoneOperation_Item_C_ExecuteUbergraph_UI_MicroPhoneOperation_Item_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
