#pragma once

/**
 * Name: FL84
 * Version: 1.15.1.6
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.OnMouseButtonDownEvent_8206C22C41FD0E455D16A9BE84F59E88
	 */
	struct UUI_MicroPhoneSetting_C_OnMouseButtonDownEvent_8206C22C41FD0E455D16A9BE84F59E88_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FPointerEvent                                       MouseEvent;                                              // 0x0038(0x0070)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.OnMouseButtonDownEvent_461F9F934EAB73C79DDB2CA931A66733
	 */
	struct UUI_MicroPhoneSetting_C_OnMouseButtonDownEvent_461F9F934EAB73C79DDB2CA931A66733_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FPointerEvent                                       MouseEvent;                                              // 0x0038(0x0070)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.OnStateChangedEvent_5C22B51E4690382810BFC89F0306DB6B
	 */
	struct UUI_MicroPhoneSetting_C_OnStateChangedEvent_5C22B51E4690382810BFC89F0306DB6B_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.OnStateChangedEvent_F68ABAE04DA9197E0AEF40A42CF8B3D8
	 */
	struct UUI_MicroPhoneSetting_C_OnStateChangedEvent_F68ABAE04DA9197E0AEF40A42CF8B3D8_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.Construct
	 */
	struct UUI_MicroPhoneSetting_C_Construct_Params
	{	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.Destruct
	 */
	struct UUI_MicroPhoneSetting_C_Destruct_Params
	{	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.GetModuleName
	 */
	struct UUI_MicroPhoneSetting_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.PreConstruct
	 */
	struct UUI_MicroPhoneSetting_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.ExecuteUbergraph_UI_MicroPhoneSetting
	 */
	struct UUI_MicroPhoneSetting_C_ExecuteUbergraph_UI_MicroPhoneSetting_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
