#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.OnMouseButtonDownEvent_58ABEF6B438BB4230E3B5AB271B59D62
	 */
	struct UUI_MicroPhoneSetting_C_OnMouseButtonDownEvent_58ABEF6B438BB4230E3B5AB271B59D62_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FPointerEvent                                       MouseEvent;                                              // 0x0038(0x0070)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.OnMouseButtonDownEvent_83B18A83482F16A2B0F699A550636FE5
	 */
	struct UUI_MicroPhoneSetting_C_OnMouseButtonDownEvent_83B18A83482F16A2B0F699A550636FE5_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FPointerEvent                                       MouseEvent;                                              // 0x0038(0x0070)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.OnStateChangedEvent_163521C64D97F4A68FB5238EDA08E631
	 */
	struct UUI_MicroPhoneSetting_C_OnStateChangedEvent_163521C64D97F4A68FB5238EDA08E631_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.OnStateChangedEvent_E140CD364805A1CAFC502BAD907E4847
	 */
	struct UUI_MicroPhoneSetting_C_OnStateChangedEvent_E140CD364805A1CAFC502BAD907E4847_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.Construct
	 */
	struct UUI_MicroPhoneSetting_C_Construct_Params
	{	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.Destruct
	 */
	struct UUI_MicroPhoneSetting_C_Destruct_Params
	{	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.GetModuleName
	 */
	struct UUI_MicroPhoneSetting_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.PreConstruct
	 */
	struct UUI_MicroPhoneSetting_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_MicroPhoneSetting.UI_MicroPhoneSetting_C.ExecuteUbergraph_UI_MicroPhoneSetting
	 */
	struct UUI_MicroPhoneSetting_C_ExecuteUbergraph_UI_MicroPhoneSetting_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
