#pragma once

/**
 * Name: FL84
 * Version: 1.15.1.6
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_Rank_Icon_Small.UI_Rank_Icon_Small_C.FormatViewCopy
	 */
	struct UUI_Rank_Icon_Small_C_FormatViewCopy_Params
	{
	public:
		int32_t                                                    LevelID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Rank_Icon_Small.UI_Rank_Icon_Small_C.OnSolarUIOpened
	 */
	struct UUI_Rank_Icon_Small_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Rank_Icon_Small.UI_Rank_Icon_Small_C.OnInitialized
	 */
	struct UUI_Rank_Icon_Small_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Rank_Icon_Small.UI_Rank_Icon_Small_C.OnSolarUIClosed
	 */
	struct UUI_Rank_Icon_Small_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Rank_Icon_Small.UI_Rank_Icon_Small_C.FormatViewJustIconCopy
	 */
	struct UUI_Rank_Icon_Small_C_FormatViewJustIconCopy_Params
	{
	public:
		int32_t                                                    LevelID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Rank_Icon_Small.UI_Rank_Icon_Small_C.GetModuleName
	 */
	struct UUI_Rank_Icon_Small_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Rank_Icon_Small.UI_Rank_Icon_Small_C.FormatViewJustIcon
	 */
	struct UUI_Rank_Icon_Small_C_FormatViewJustIcon_Params
	{
	public:
		int32_t                                                    LevelID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Rank_Icon_Small.UI_Rank_Icon_Small_C.SetStar
	 */
	struct UUI_Rank_Icon_Small_C_SetStar_Params
	{
	public:
		bool                                                       Star;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Rank_Icon_Small.UI_Rank_Icon_Small_C.FormatView
	 */
	struct UUI_Rank_Icon_Small_C_FormatView_Params
	{
	public:
		int32_t                                                    LevelID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Rank_Icon_Small.UI_Rank_Icon_Small_C.PreConstruct
	 */
	struct UUI_Rank_Icon_Small_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Rank_Icon_Small.UI_Rank_Icon_Small_C.SetRankIconView
	 */
	struct UUI_Rank_Icon_Small_C_SetRankIconView_Params
	{
	public:
		int32_t                                                    Param;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Rank_Icon_Small.UI_Rank_Icon_Small_C.ExecuteUbergraph_UI_Rank_Icon_Small
	 */
	struct UUI_Rank_Icon_Small_C_ExecuteUbergraph_UI_Rank_Icon_Small_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
