#pragma once

/**
 * Name: FL84
 * Version: 1.14.4.5.503427
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_Settings_VehicleControls_BtnState.UI_Settings_VehicleControls_BtnState_C.GetModuleName
	 */
	struct UUI_Settings_VehicleControls_BtnState_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Settings_VehicleControls_BtnState.UI_Settings_VehicleControls_BtnState_C.SetHover
	 */
	struct UUI_Settings_VehicleControls_BtnState_C_SetHover_Params
	{
	public:
		bool                                                       IsVisible;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_VehicleControls_BtnState.UI_Settings_VehicleControls_BtnState_C.SetLegged
	 */
	struct UUI_Settings_VehicleControls_BtnState_C_SetLegged_Params
	{
	public:
		bool                                                       IsVisibleLegged;                                         // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_VehicleControls_BtnState.UI_Settings_VehicleControls_BtnState_C.SetWheel
	 */
	struct UUI_Settings_VehicleControls_BtnState_C_SetWheel_Params
	{
	public:
		bool                                                       IsVisibleWheel;                                          // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_VehicleControls_BtnState.UI_Settings_VehicleControls_BtnState_C.SetMask
	 */
	struct UUI_Settings_VehicleControls_BtnState_C_SetMask_Params
	{
	public:
		bool                                                       IsMask;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_VehicleControls_BtnState.UI_Settings_VehicleControls_BtnState_C.SetSelect
	 */
	struct UUI_Settings_VehicleControls_BtnState_C_SetSelect_Params
	{
	public:
		bool                                                       IsSelect;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_VehicleControls_BtnState.UI_Settings_VehicleControls_BtnState_C.PreConstruct
	 */
	struct UUI_Settings_VehicleControls_BtnState_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_VehicleControls_BtnState.UI_Settings_VehicleControls_BtnState_C.BndEvt__Btn_SelectWheeledJoyStick_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUI_Settings_VehicleControls_BtnState_C_BndEvt__Btn_SelectWheeledJoyStick_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Settings_VehicleControls_BtnState.UI_Settings_VehicleControls_BtnState_C.BndEvt__Btn_JoyStickControlCustomize_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	 */
	struct UUI_Settings_VehicleControls_BtnState_C_BndEvt__Btn_JoyStickControlCustomize_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Settings_VehicleControls_BtnState.UI_Settings_VehicleControls_BtnState_C.ExecuteUbergraph_UI_Settings_VehicleControls_BtnState
	 */
	struct UUI_Settings_VehicleControls_BtnState_C_ExecuteUbergraph_UI_Settings_VehicleControls_BtnState_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Settings_VehicleControls_BtnState.UI_Settings_VehicleControls_BtnState_C.OnClickedCustomize__DelegateSignature
	 */
	struct UUI_Settings_VehicleControls_BtnState_C_OnClickedCustomize__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Settings_VehicleControls_BtnState.UI_Settings_VehicleControls_BtnState_C.OnClickedSelect__DelegateSignature
	 */
	struct UUI_Settings_VehicleControls_BtnState_C_OnClickedSelect__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
