#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_90142FD84EB72170D9EFBD831F20F6F9
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_90142FD84EB72170D9EFBD831F20F6F9_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_53773A0246BCBE382499AABE1F49887B
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_53773A0246BCBE382499AABE1F49887B_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_43F1471E44666CD1F76B849C3D258B3A
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_43F1471E44666CD1F76B849C3D258B3A_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_546CBDD24FE5CD75222ECC8C0A1720FD
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_546CBDD24FE5CD75222ECC8C0A1720FD_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_08BE23AC4CF248738C4A3A9B0929496D
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_08BE23AC4CF248738C4A3A9B0929496D_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_C6DAC82D4B300A9CE5845386B7368300
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_C6DAC82D4B300A9CE5845386B7368300_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_E46901194F0F24C1DB4BD1A8C432E6C4
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_E46901194F0F24C1DB4BD1A8C432E6C4_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_7CAF1807480A02DC1E6264B4E1D6C450
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_7CAF1807480A02DC1E6264B4E1D6C450_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_B022D7CF4FC6D748758D2DB40A00C730
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_B022D7CF4FC6D748758D2DB40A00C730_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_1CFA8E0F4F043B18768301BA9AEBF154
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_1CFA8E0F4F043B18768301BA9AEBF154_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_E3D0E1D146CD5C60BB7F62BF20424F97
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_E3D0E1D146CD5C60BB7F62BF20424F97_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_4F55BDF445936D7685F7D1B863DA6493
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_4F55BDF445936D7685F7D1B863DA6493_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_DE93A64B4084919C51A4408EE952C2C9
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_DE93A64B4084919C51A4408EE952C2C9_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_E78A58154D720ED2FA5F43B308957378
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_E78A58154D720ED2FA5F43B308957378_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_238FF91A48BAD9D50E3BAC8D4B2A2787
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_238FF91A48BAD9D50E3BAC8D4B2A2787_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_2F7D66924B7F6436C726F4ABBCA585E4
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_2F7D66924B7F6436C726F4ABBCA585E4_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_F498C3B14067F933E8BA36BEA9D5E960
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_F498C3B14067F933E8BA36BEA9D5E960_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_8AAD5FF84EFA7424D01683ADA9021E5B
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_8AAD5FF84EFA7424D01683ADA9021E5B_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_B73964DD4ED2E32770268180CED5B6C9
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_B73964DD4ED2E32770268180CED5B6C9_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_1E3EF2B64617CFCB1D8F40890E80A2CB
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_1E3EF2B64617CFCB1D8F40890E80A2CB_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_D1C523DF45DF445941404882957E59F0
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_D1C523DF45DF445941404882957E59F0_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_B673D4AE449796C0CF5FF7A6154439E1
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_B673D4AE449796C0CF5FF7A6154439E1_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_29E0B5674FA72E42381C27AA941DCBEB
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_29E0B5674FA72E42381C27AA941DCBEB_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_9E5F014B450B1D5DB1F996A80D5E6522
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_9E5F014B450B1D5DB1F996A80D5E6522_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_7267FB624BF119ED3A2C889FD3EF68E2
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_7267FB624BF119ED3A2C889FD3EF68E2_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_C31631D6446E3A9F60D63E898F74FD67
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_C31631D6446E3A9F60D63E898F74FD67_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_A911A897492C967CB698A3926725F9CF
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_A911A897492C967CB698A3926725F9CF_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_62B1550C417733AE0C104E883B1E0FA0
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_62B1550C417733AE0C104E883B1E0FA0_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_6DD658ED4FDEB76A13525EA9D1F7A9ED
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_6DD658ED4FDEB76A13525EA9D1F7A9ED_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_0F154E26444946029586688C28634242
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_0F154E26444946029586688C28634242_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_AA4D53AE423624FFE4D430A59F19788A
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_AA4D53AE423624FFE4D430A59F19788A_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_A20630404E0A7A728B19A08EAFD66CA5
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_A20630404E0A7A728B19A08EAFD66CA5_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_DA8161384E258C8DF35F3BA361A3CB75
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_DA8161384E258C8DF35F3BA361A3CB75_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_C6F7FBBE402D7236BFD3D7B254C11180
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_C6F7FBBE402D7236BFD3D7B254C11180_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_317E89454FD538C0685DEA9087457F1D
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_317E89454FD538C0685DEA9087457F1D_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_45FE4AFE4081438FC5E294BFA7523467
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_45FE4AFE4081438FC5E294BFA7523467_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_3EAC2DFB4D88404694AB96897FF8D040
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_3EAC2DFB4D88404694AB96897FF8D040_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_2747376D4B987A763088B484EA9B6631
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_2747376D4B987A763088B484EA9B6631_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_647F21F2433344873E02D0865495E5E6
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_647F21F2433344873E02D0865495E5E6_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_40FB0A8C4BA5250C79A2A1BAAE35246A
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_40FB0A8C4BA5250C79A2A1BAAE35246A_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_EE857D9045D5261509AE02BD4B8EC2A9
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_EE857D9045D5261509AE02BD4B8EC2A9_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_668C9A25498B6CF65C2C0398A861BF7B
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_668C9A25498B6CF65C2C0398A861BF7B_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_51CDA03B47844571C801309E27A13AA2
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_51CDA03B47844571C801309E27A13AA2_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_54D7BA22436500E5FB391F9E884A31E3
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_54D7BA22436500E5FB391F9E884A31E3_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_D220FDD5419455BFB2E1D5A54D738B11
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_D220FDD5419455BFB2E1D5A54D738B11_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_30415C314D0A7B6CB1AC9DABC81FA039
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_30415C314D0A7B6CB1AC9DABC81FA039_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_D8B8373A421FF8DDC48287936F95B0D0
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_D8B8373A421FF8DDC48287936F95B0D0_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_C7034C77481F57ACCF3F3EBE4F83C707
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_C7034C77481F57ACCF3F3EBE4F83C707_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_03BA8CBD45C1B82BE5B3B4973C236DDE
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_03BA8CBD45C1B82BE5B3B4973C236DDE_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_80AA6E1C4C4A083329B1DDAE0819726E
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_80AA6E1C4C4A083329B1DDAE0819726E_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_C4FDCFDE4D0C83DAC57163AC67D0BF51
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_C4FDCFDE4D0C83DAC57163AC67D0BF51_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_51D236CE44C3553374F887A1C0DA24B3
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_51D236CE44C3553374F887A1C0DA24B3_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_135A94524D1131ACE2ECA0B7E0085726
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_135A94524D1131ACE2ECA0B7E0085726_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_C895B72D4D59B429F52302AAF08443F4
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_C895B72D4D59B429F52302AAF08443F4_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_0C7C443640873CB6FD9B229E628CAF14
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_0C7C443640873CB6FD9B229E628CAF14_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_3F1962FD4B6AC20AFA70B2B9D7B518D0
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_3F1962FD4B6AC20AFA70B2B9D7B518D0_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_D19630FA435995EA6AA397B9FDDCACC7
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_D19630FA435995EA6AA397B9FDDCACC7_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_5E3C3D034981EFC55862EC9648889F72
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_5E3C3D034981EFC55862EC9648889F72_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_4FD59BD840C81895063BF8A8C7D1BF14
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_4FD59BD840C81895063BF8A8C7D1BF14_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_231C2038408F6C7FEC6F0EAF480DEB95
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_231C2038408F6C7FEC6F0EAF480DEB95_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_ED2A83AE494C21D29BB505AD13191AFA
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_ED2A83AE494C21D29BB505AD13191AFA_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_7C1850D144257DF60E517B83826BE55F
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_7C1850D144257DF60E517B83826BE55F_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_393234264A958959373178AB0A0F8B20
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_393234264A958959373178AB0A0F8B20_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_368F59564517E13923E6A7BC555828AF
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_368F59564517E13923E6A7BC555828AF_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_4E67E172478F60203B9D1D98D7166A25
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_4E67E172478F60203B9D1D98D7166A25_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_8D6E1FE848FACC92846F98BEC19D7D1A
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_8D6E1FE848FACC92846F98BEC19D7D1A_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_3CB38B0C4CDCDDEBD5240EB8DBDC735B
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_3CB38B0C4CDCDDEBD5240EB8DBDC735B_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_FA1F593747B99A7ABD24689905186E25
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_FA1F593747B99A7ABD24689905186E25_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_7149F0CE437C71BE90133785F5E0C863
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_7149F0CE437C71BE90133785F5E0C863_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_EE353C294FAB57A466F2FCA1E93E90F0
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_EE353C294FAB57A466F2FCA1E93E90F0_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_5261F834493AA6437BB2FE81281C1F09
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_5261F834493AA6437BB2FE81281C1F09_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_41C4495440E8DBC856082CA67DC68E76
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_41C4495440E8DBC856082CA67DC68E76_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_8C2BC03842154B3D3C66D3BE6A4FE99A
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_8C2BC03842154B3D3C66D3BE6A4FE99A_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_6A8C387D489016999D758E82E364F2F7
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_6A8C387D489016999D758E82E364F2F7_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_0B5ECEAD4968012353FEE58CA3ED25C9
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_0B5ECEAD4968012353FEE58CA3ED25C9_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_011418104BA9622350357FADF94D65AA
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_011418104BA9622350357FADF94D65AA_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_EA157A6E489AA3DC61956B88DA1ECBDF
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_EA157A6E489AA3DC61956B88DA1ECBDF_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_8E4780114C315641936B69802D905FF1
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_8E4780114C315641936B69802D905FF1_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_B82639694723DFEA883A1885054187EE
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_B82639694723DFEA883A1885054187EE_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_3CCDDA704DE7DDC365536A9A3A757C94
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_3CCDDA704DE7DDC365536A9A3A757C94_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_9185CFA84D3A1587AC19D088D6B193AE
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_9185CFA84D3A1587AC19D088D6B193AE_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnStateChangedEvent_DE78563149275F7C08F0D7A127D708F2
	 */
	struct UUI_Settings_Item_Slot_C_OnStateChangedEvent_DE78563149275F7C08F0D7A127D708F2_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked_50BF116C41A63243FD7F469A0556D664
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked_50BF116C41A63243FD7F469A0556D664_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnClicked_BDDD787C4ED92E03CF8D2C8A8622C0F3
	 */
	struct UUI_Settings_Item_Slot_C_OnClicked_BDDD787C4ED92E03CF8D2C8A8622C0F3_Params
	{	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnInitialized
	 */
	struct UUI_Settings_Item_Slot_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.GetModuleName
	 */
	struct UUI_Settings_Item_Slot_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.SetDisable
	 */
	struct UUI_Settings_Item_Slot_C_SetDisable_Params
	{
	public:
		bool                                                       IsDisable;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_79PS[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.UpdateCheckGroupList
	 */
	struct UUI_Settings_Item_Slot_C_UpdateCheckGroupList_Params
	{	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.AddItemToCheckGroupListData
	 */
	struct UUI_Settings_Item_Slot_C_AddItemToCheckGroupListData_Params
	{
	public:
		class FString                                              Text;                                                    // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.ClearCheckGroupListData
	 */
	struct UUI_Settings_Item_Slot_C_ClearCheckGroupListData_Params
	{	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.SetSwitchInitValue
	 */
	struct UUI_Settings_Item_Slot_C_SetSwitchInitValue_Params
	{
	public:
		bool                                                       IsInitValue;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.SetSwitch
	 */
	struct UUI_Settings_Item_Slot_C_SetSwitch_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.IsSwitchOnVisible
	 */
	struct UUI_Settings_Item_Slot_C_IsSwitchOnVisible_Params
	{
	public:
		bool                                                       IsVisible;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.PreConstruct
	 */
	struct UUI_Settings_Item_Slot_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.BndEvt__CheckBoxGroup_Gryo_K2Node_ComponentBoundEvent_1_OnCheckBoxGroupStateChangedEvent__DelegateSignature
	 */
	struct UUI_Settings_Item_Slot_C_BndEvt__CheckBoxGroup_Gryo_K2Node_ComponentBoundEvent_1_OnCheckBoxGroupStateChangedEvent__DelegateSignature_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.BndEvt__CheckBoxGroup_Gryo_K2Node_ComponentBoundEvent_2_OnCheckBoxGroupStateChangedEventEx__DelegateSignature
	 */
	struct UUI_Settings_Item_Slot_C_BndEvt__CheckBoxGroup_Gryo_K2Node_ComponentBoundEvent_2_OnCheckBoxGroupStateChangedEventEx__DelegateSignature_Params
	{
	public:
		TArray<class UCheckBox*>                                   ChildChangedArray;                                       // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
		int32_t                                                    CheckedChildIndex;                                       // 0x0010(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_TOCC[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UCheckBox*                                           PrevCheckedChild;                                        // 0x0018(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.BndEvt__UI_Component_Switch_K2Node_ComponentBoundEvent_0_OnSwitchClicked__DelegateSignature
	 */
	struct UUI_Settings_Item_Slot_C_BndEvt__UI_Component_Switch_K2Node_ComponentBoundEvent_0_OnSwitchClicked__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.BndEvt__UI_Component_Switch_K2Node_ComponentBoundEvent_3_OnStateChanged__DelegateSignature
	 */
	struct UUI_Settings_Item_Slot_C_BndEvt__UI_Component_Switch_K2Node_ComponentBoundEvent_3_OnStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       NewValue;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.SetCheckGroupTextList
	 */
	struct UUI_Settings_Item_Slot_C_SetCheckGroupTextList_Params
	{
	public:
		TArray<class FString>                                      NewParam;                                                // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.ExecuteUbergraph_UI_Settings_Item_Slot
	 */
	struct UUI_Settings_Item_Slot_C_ExecuteUbergraph_UI_Settings_Item_Slot_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchStateChanged__DelegateSignature
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchStateChanged__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnSwitchClicked__DelegateSignature
	 */
	struct UUI_Settings_Item_Slot_C_OnSwitchClicked__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnCheckBoxStateChangedEventEx__DelegateSignature
	 */
	struct UUI_Settings_Item_Slot_C_OnCheckBoxStateChangedEventEx__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Settings_Item_Slot.UI_Settings_Item_Slot_C.OnCheckBoxStateChangedEvent__DelegateSignature
	 */
	struct UUI_Settings_Item_Slot_C_OnCheckBoxStateChangedEvent__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
