#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_Settings.UI_Settings_C.OnClicked_437D45AD4E51708B6C4A4AAA4A98805C
	 */
	struct UUI_Settings_C_OnClicked_437D45AD4E51708B6C4A4AAA4A98805C_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.OnClicked_34782E6145443A2294A5B383F7F520C2
	 */
	struct UUI_Settings_C_OnClicked_34782E6145443A2294A5B383F7F520C2_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.OnActiveTabChanged_AAD0EEA441A7AA74594A8CA8303FD837
	 */
	struct UUI_Settings_C_OnActiveTabChanged_AAD0EEA441A7AA74594A8CA8303FD837_Params
	{
	public:
		class FString                                              Key;                                                     // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		int32_t                                                    Index;                                                   // 0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Settings.UI_Settings_C.Destruct
	 */
	struct UUI_Settings_C_Destruct_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.OnInitialized
	 */
	struct UUI_Settings_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.SaveAndQuit
	 */
	struct UUI_Settings_C_SaveAndQuit_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.OnSolarUIOpened
	 */
	struct UUI_Settings_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.OnSolarUIClosed
	 */
	struct UUI_Settings_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.OnHide
	 */
	struct UUI_Settings_C_OnHide_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.OnSettingRequestOpened
	 */
	struct UUI_Settings_C_OnSettingRequestOpened_Params
	{
	public:
		int32_t                                                    InOwnerType;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings.UI_Settings_C.OnBackKey
	 */
	struct UUI_Settings_C_OnBackKey_Params
	{
	public:
		EWidgetBackKeyType                                         BackKeyType;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings.UI_Settings_C.ConstructCopy
	 */
	struct UUI_Settings_C_ConstructCopy_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.Get_Hero01_CheckedState_1
	 */
	struct UUI_Settings_C_Get_Hero01_CheckedState_1_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.Construct
	 */
	struct UUI_Settings_C_Construct_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.BndEvt__Btn_SelectHero_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature
	 */
	struct UUI_Settings_C_BndEvt__Btn_SelectHero_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.ReceiveShow
	 */
	struct UUI_Settings_C_ReceiveShow_Params
	{	};

	/**
	 * Function UI_Settings.UI_Settings_C.ExecuteUbergraph_UI_Settings
	 */
	struct UUI_Settings_C_ExecuteUbergraph_UI_Settings_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_948B[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
