#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnSwitchClicked_6C7E457E4C141E4D5619C8B36E776B2D
	 */
	struct UUI_Settings_Graphics_New_C_OnSwitchClicked_6C7E457E4C141E4D5619C8B36E776B2D_Params
	{	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_982166DF492E7A7D3B47D794DBDA268B
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_982166DF492E7A7D3B47D794DBDA268B_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_E4CC95C044B77A85671E92BAB8DFE1FB
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_E4CC95C044B77A85671E92BAB8DFE1FB_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_ED876D0F47318BDF19AB409262B33AE6
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_ED876D0F47318BDF19AB409262B33AE6_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_04DA1378415BD71A9B9BC2814E43D324
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_04DA1378415BD71A9B9BC2814E43D324_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_57E529C64936A175899F24BB12C2041D
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_57E529C64936A175899F24BB12C2041D_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_D4150A58499B465F60E857B77D1ECEFA
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_D4150A58499B465F60E857B77D1ECEFA_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_7B9231A840027B031F43CEA67EFC97AD
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_7B9231A840027B031F43CEA67EFC97AD_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_F58B36ED415DB8C9F3CE0FBDC4E549DD
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_F58B36ED415DB8C9F3CE0FBDC4E549DD_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_DC6DA63C48E5DA09EB5A6780FDB848FF
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_DC6DA63C48E5DA09EB5A6780FDB848FF_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_28387EC64A4EC1A2AACEF788950FAB7A
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_28387EC64A4EC1A2AACEF788950FAB7A_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_303C250D40B882944A9746BEAA27B180
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_303C250D40B882944A9746BEAA27B180_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_F7AB65634FE86AF504C2D6A66D9BABBC
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_F7AB65634FE86AF504C2D6A66D9BABBC_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_EF8556B04BBC67A3B973B6BB4CF3D35F
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_EF8556B04BBC67A3B973B6BB4CF3D35F_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_2EBA5A7B48BD7D9D77E9B8A975F0709E
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_2EBA5A7B48BD7D9D77E9B8A975F0709E_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_99B118A94313EAF9FF4480A12FA149EF
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_99B118A94313EAF9FF4480A12FA149EF_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_84B768E24AB0DB9EF823E6874975BCED
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_84B768E24AB0DB9EF823E6874975BCED_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_E88C86BD4F55A1B3A8BA5587A765ACAD
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_E88C86BD4F55A1B3A8BA5587A765ACAD_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_40C422654A3D885ADEEFC8AE3CA7429B
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_40C422654A3D885ADEEFC8AE3CA7429B_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_B7C93262430F834E6455EFA32944D797
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_B7C93262430F834E6455EFA32944D797_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_7FACAD7949E0E7FC4C024499CEC3843B
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_7FACAD7949E0E7FC4C024499CEC3843B_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_FBCDA45F42D52BC4F839C99993717BE8
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_FBCDA45F42D52BC4F839C99993717BE8_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_CCD016514EB6E11C88356299BAE37EC7
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_CCD016514EB6E11C88356299BAE37EC7_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_F90357EA4894BA1E62B981B85D942CC3
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_F90357EA4894BA1E62B981B85D942CC3_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_A443D95A48031A6022424A8F1FACEF76
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_A443D95A48031A6022424A8F1FACEF76_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_D8D624264116500ADE1A23A904430C35
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_D8D624264116500ADE1A23A904430C35_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_7B2118BC44532B20B6832CADB7DEA743
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_7B2118BC44532B20B6832CADB7DEA743_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_D8D752FE41039AAC96789A9235B8B4C7
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_D8D752FE41039AAC96789A9235B8B4C7_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_B957647F47200AA8B6B824B12C99687A
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_B957647F47200AA8B6B824B12C99687A_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_E99974AD437E641745CB2AA9EAAD0586
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_E99974AD437E641745CB2AA9EAAD0586_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnStateChangedEvent_36452A004BDB4CB65650CC87F81977FA
	 */
	struct UUI_Settings_Graphics_New_C_OnStateChangedEvent_36452A004BDB4CB65650CC87F81977FA_Params
	{
	public:
		int32_t                                                    InLastButtonIndex;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnClicked_766D7ACE45BC2E488042098019A46D4F
	 */
	struct UUI_Settings_Graphics_New_C_OnClicked_766D7ACE45BC2E488042098019A46D4F_Params
	{	};

	/**
	 * Function UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnSwitchClicked_C02544914632D5D31B8847AE06E15CA3
	 */
	struct UUI_Settings_Graphics_New_C_OnSwitchClicked_C02544914632D5D31B8847AE06E15CA3_Params
	{	};

	/**
	 * Function UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnSwitchClicked_F8AEB4A6460DF060B4C3E4BC918E7ACC
	 */
	struct UUI_Settings_Graphics_New_C_OnSwitchClicked_F8AEB4A6460DF060B4C3E4BC918E7ACC_Params
	{	};

	/**
	 * Function UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnInitialized
	 */
	struct UUI_Settings_Graphics_New_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnSolarUIClosed
	 */
	struct UUI_Settings_Graphics_New_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.OnSolarUIOpened
	 */
	struct UUI_Settings_Graphics_New_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.GetModuleName
	 */
	struct UUI_Settings_Graphics_New_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Settings_Graphics_New.UI_Settings_Graphics_New_C.SetFOVPercent
	 */
	struct UUI_Settings_Graphics_New_C_SetFOVPercent_Params
	{
	public:
		float                                                      Percent;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
