#pragma once

/**
 * Name: FL84
 * Version: 15.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_Settings_Audio_New.UI_Settings_Audio_New_C.OnSelectionChanged_76EF1488462999B8A4A2C18741B050F7
	 */
	struct UUI_Settings_Audio_New_C_OnSelectionChanged_76EF1488462999B8A4A2C18741B050F7_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Settings_Audio_New.UI_Settings_Audio_New_C.OnSelectionChanged_EF6F4A254FFC42AEFDB07787775404D8
	 */
	struct UUI_Settings_Audio_New_C_OnSelectionChanged_EF6F4A254FFC42AEFDB07787775404D8_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Settings_Audio_New.UI_Settings_Audio_New_C.OnTitleCheckStateChanged_02D4242449EBD4AD19CE8CBA91688AB9
	 */
	struct UUI_Settings_Audio_New_C_OnTitleCheckStateChanged_02D4242449EBD4AD19CE8CBA91688AB9_Params
	{
	public:
		bool                                                       IsChecked;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_Audio_New.UI_Settings_Audio_New_C.OnTitleCheckStateChanged_D08B768B473EC675885B059DDE7ECFD9
	 */
	struct UUI_Settings_Audio_New_C_OnTitleCheckStateChanged_D08B768B473EC675885B059DDE7ECFD9_Params
	{
	public:
		bool                                                       IsChecked;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_Audio_New.UI_Settings_Audio_New_C.OnTitleCheckStateChanged_2856B1714898B0A87318A0BF04A7C418
	 */
	struct UUI_Settings_Audio_New_C_OnTitleCheckStateChanged_2856B1714898B0A87318A0BF04A7C418_Params
	{
	public:
		bool                                                       IsChecked;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_Audio_New.UI_Settings_Audio_New_C.OnTitleCheckStateChanged_77E3FC5749D16EF6DA8D7FB583364EE3
	 */
	struct UUI_Settings_Audio_New_C_OnTitleCheckStateChanged_77E3FC5749D16EF6DA8D7FB583364EE3_Params
	{
	public:
		bool                                                       IsChecked;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Settings_Audio_New.UI_Settings_Audio_New_C.OnSolarUIClosed
	 */
	struct UUI_Settings_Audio_New_C_OnSolarUIClosed_Params
	{	};

	/**
	 * Function UI_Settings_Audio_New.UI_Settings_Audio_New_C.OnInitialized
	 */
	struct UUI_Settings_Audio_New_C_OnInitialized_Params
	{	};

	/**
	 * Function UI_Settings_Audio_New.UI_Settings_Audio_New_C.OnDeinitialize
	 */
	struct UUI_Settings_Audio_New_C_OnDeinitialize_Params
	{	};

	/**
	 * Function UI_Settings_Audio_New.UI_Settings_Audio_New_C.OnSolarUIOpened
	 */
	struct UUI_Settings_Audio_New_C_OnSolarUIOpened_Params
	{	};

	/**
	 * Function UI_Settings_Audio_New.UI_Settings_Audio_New_C.Construct
	 */
	struct UUI_Settings_Audio_New_C_Construct_Params
	{	};

	/**
	 * Function UI_Settings_Audio_New.UI_Settings_Audio_New_C.GetModuleName
	 */
	struct UUI_Settings_Audio_New_C_GetModuleName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
