#pragma once

// Dumped with Dumper-7!


namespace SDK
{
	//---------------------------------------------------------------------------------------------------------------------
	// ENUMS
	//---------------------------------------------------------------------------------------------------------------------


	//---------------------------------------------------------------------------------------------------------------------
	// STRUCTS
	//---------------------------------------------------------------------------------------------------------------------

	// 0x1 (0x1 - 0x0)
	// ScriptStruct UnLua.PropertyCollector
	struct FPropertyCollector
	{
	public:
		enum class ETutorialTriggerType              None;                                              // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class AActor* None2;                                              // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		TSubclassOf<class UObject>                   None3;                                              // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
		int32                                        None4;                                              // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FTutorialTableRow                     None5;                                              // 0x0(0x98)(HasGetValueTypeHash)
		struct FGateAddress_Dep                      None6;                                              // 0x0(0x20)(HasGetValueTypeHash)
		struct FServerInfo_Dep                       None7;                                              // 0x0(0x50)(HasGetValueTypeHash)
		struct FInputKeyMappingEntry                 None8;                                              // 0x0(0x40)(HasGetValueTypeHash)
	};

	// 0x1 (0x1 - 0x0)
	// ScriptStruct UnLua.InSightEvent
	struct FInSightEvent
	{
	public:
		uint8                                        Pad_8D1[0x1];                                      // Fixing Size Of Struct [ Dumper-7 ]
	};

}


